[
    {
        "label": 1,
        "text": "Sivir - League of Legends #sivir #lol #leagueoflegends #ai #aiart #aiartcommunity #ai #stablediffusion #forge #phonewallpaper #waifu #photography"
    },
    {
        "label": 1,
        "text": "yeah they definitely rushed it but they have more lore from league of legends - essentially, they're a secret order of mages who controls noxus from the shadows and in league their primary goal is to stop an evil, powerful warlord from coming back from the dead"
    },
    {
        "label": 1,
        "text": "I’ve never played a lick of League of Legends, but season 2 of Arcane is some of the best damn compelling television I've seen in a long time."
    },
    {
        "label": 1,
        "text": "League of Legends, conocido en el español de fuera de Tenerife como el \"Cordón de Leyendas\"."
    },
    {
        "label": 1,
        "text": "League of Legends is right there"
    },
    {
        "label": 1,
        "text": "✧ Teleport Rework | League of Legends \n\n» Confira os novos efeitos visuais do Teleport."
    },
    {
        "label": 1,
        "text": "✧ Arcane | League Of Legends  \n\n» Confira a splash art animada para a skin de Jinx Fragmentada."
    },
    {
        "label": 1,
        "text": "Arcane is a government psyop to get queer people into League Of Legends and unfortunately it’s working"
    },
    {
        "label": 1,
        "text": "What's one weakness your main has in league of legends?\n\nHe to focused on love when he has so much power, it makes him stupid\n\n#leagueoflegends #viego"
    },
    {
        "label": 1,
        "text": "looking for moots <3\n\n🦊She/Her\n\n🦊ults:(G)I-DLE, K/DA\n\n🦊Fandoms welcomed: Neverland OT6 or OT5 (OT5 people that hate on Soojin or OT6 are not welcomed!!) and BLADES\n\n🦊Interests: League of Legends related content, anime, music, video games and tv series"
    },
    {
        "label": 1,
        "text": "Arcane is just anime if it were good. It's also League of legends if it were good"
    },
    {
        "label": 1,
        "text": "as someone that doesn’t play league of legends, is it still worth it to watch arcane?"
    },
    {
        "label": 1,
        "text": "tinha um colega meu que dizia q esse jogo me transformava na pior versão de mim mesma \n\ninsuportável league of legends n tem como"
    },
    {
        "label": 1,
        "text": "Worke in Proegresse\n#Arcane #leagueoflegends #ekko"
    },
    {
        "label": 1,
        "text": "Never fully got into twitter when it was still alive and kicking but figured we’d give this a go 👾🎮👻\n•Horror\n•Diablo\n•Fighting games\n•League of legends\n•Scream Series\n•Magic The Gathering\n•Cyberpunk 2077\n•Devil May Cry\n•Hades\n•The Binding of Isaac\n•RE\n•Tattoos\n\nAny mutual interests hmu! #promotesky"
    },
    {
        "label": 1,
        "text": "Lowkey I've been playing a little league of legends recently if you tryna 👀"
    },
    {
        "label": 1,
        "text": "Nah I got cooked by the League of Legends next season announcement info. 🫠"
    },
    {
        "label": 1,
        "text": "IDC what any Arcane fan has to say they ruined Viktor in League of Legends \n\nThat rework is actually criminal 😐🤡"
    },
    {
        "label": 1,
        "text": "Irelia [2023 Repost]"
    },
    {
        "label": 1,
        "text": "Every time you find yourself thinking League of Legends is the worst game, take a moment to remember it could be worse. Pokémon Unite exists."
    },
    {
        "label": 1,
        "text": "-Vossa execelencia!\n-League of Legends!!\n*batida de martelo*\n-Sentença: Morte"
    },
    {
        "label": 1,
        "text": "First post here on Blue Sky\n\nThis is a little wip of jinx from league of legends arcane\n\n#leagueoflegends #lol #arcane #jinx #netflix"
    },
    {
        "label": 1,
        "text": "quieres?"
    },
    {
        "label": 1,
        "text": "🎭 SKINS - LEAGUE OF LEGENDS\n\n#Arcane - Parte II do Evento \n\n🖼 SPLASHART ANIMADA:\n~ Jinx Fragmentada (Primeira Skin EXALTADA do LOL)\n\n#LeagueOfLegends #Jinx"
    },
    {
        "label": 1,
        "text": "Arroba league of legends por favor coloque o mordekaiser na próxima série mas deixe ele assustadoramente inacreditavelmente tetudo num ponto q distrai as pessoas assistindo e os personagens que interagem com ele obrigado\nCom amor, Vitor"
    },
    {
        "label": 1,
        "text": "2018, Original caption:\nIf Blitz is friends with Viktor… and Blitz is friends with Ekko… Then ..Viktor and Ekko will HAVE to be friends because who’d want to upset Blitzcrank????\n[ #Blitzcrank #ekko #viktor #machineherald #leagueoflegends ]"
    },
    {
        "label": 1,
        "text": "#promosky\n\n🦋 Persona series\n🦋 Macross series\n🦋 Fate series\n🦋 League of Legends\n🦋 Overwatch 2\n🦋 One Piece\n🦋 Quintessencial Quintuplets\n🦋 Fatal Frame\n🦋 The Guy she was interested in it wasn't a Guy at all\n🦋 Animals ✨️\n🦋 Cosplaying/Make-up\n🦋 Seiyuu's staff\n🦋 Pokemon\n🦋 Ancient History \n🦋 Singing"
    },
    {
        "label": 1,
        "text": "What if I made Sett mister League of Legends in FFXIV as another alt linked to the Arcadion. \n\nHaha hehe. I did that. I'm insane enough to run Dawntrail a third and more times. \n\n#FFXIV | #FF14 | #Gpose | #LeagueofLegends"
    },
    {
        "label": 1,
        "text": "Dead by Daylight\nWarhammer 40k\nEscape the Backrooms\nDestiny 2\nTiny Tina's Wonderlands\nHelldivers 2\nFall Guys\nSons of the Forest\nPUBG\nFortnite\nCall of Duty Zombies\nLeague of Legends\nRealm of the Mad God\nMagic the Gathering\n\nSome of the games may not be uploaded yet but will be! Thank you again!"
    },
    {
        "label": 1,
        "text": "🎭 SKINS - LEAGUE OF LEGENDS\n\n#Arcane - Parte II do Evento \n\n🔀 COMPARAÇÃO DAS 3 FORMAS:\n~ Jinx Fragmentada (Primeira Skin EXALTADA do LOL)\n\n#LeagueOfLegends #Jinx   "
    },
    {
        "label": 1,
        "text": "I finished Arcane after being spoiled a million times over. \n\nMakes me wonder what is League of Legends aside from well a game...\n\nWhat do you do?\n\nI know nothing and only know that it sucks and everyone hates it."
    },
    {
        "label": 1,
        "text": "Did draw yesterday just forgot to post. But yesterday I tried to draw some League of Legends character splash art \nFirst one being Pantheon and the second one I really tried my best with Chosen of the Wolf Kindred but I dont like how it turned out\n#leagueoflegends"
    },
    {
        "label": 1,
        "text": "sorry im going a lil insane w mr viktor league of legends"
    },
    {
        "label": 1,
        "text": "im gonna do something evil (dual boot windows) (for fucking league of legends)"
    },
    {
        "label": 1,
        "text": "Coming Soon to Your Local Funko Retailer\n\nFunko Pop! Animation: Arcane - League of Legends \n\nAmazon CA:\namzn.to/3OnPlha\n\nAmazon US:\namzn.to/3V4RXnU\n\n#funkofanatic #funkofamily #popvinyl #funkopop #funko #funkopopvinyl #funkofunatic #funkopops #funkoaddict #funkocanada #ad #lol #leagueoflegends"
    },
    {
        "label": 1,
        "text": "I love when the normies discover arcane and then think league of legends will be a fun game."
    },
    {
        "label": 1,
        "text": "COMM @sharjeneva.bsky.social of Nami as a pool toy with Miss Fortune on her, from League of Legends."
    },
    {
        "label": 1,
        "text": "✧ Arcane | League Of Legends \n\n» Confira o banner e as bordas das skins arcane."
    },
    {
        "label": 1,
        "text": "its 4pm babe, time for league of legends twitch.tv/sushicolayt"
    },
    {
        "label": 1,
        "text": "lets take ibuprofen together…"
    },
    {
        "label": 1,
        "text": "***Arcane Spoilers***\n\nMel Medarda the woman you are. And I swear you better be making your way over to League of Legends like ASAP"
    },
    {
        "label": 1,
        "text": "i started play league of legends and i literally don't understand anything please im so confused"
    },
    {
        "label": 1,
        "text": "(23 different games in my backlog) should i hop on league of legends"
    },
    {
        "label": 1,
        "text": "Not a fan of League of Legends, but I loved the first season of Arcane a lot so I’m happy to see they stuck the landing with season 2. So god damn good."
    },
    {
        "label": 1,
        "text": "um personagem do jogo league of legends kkkkk transformaram o coitado num twink"
    },
    {
        "label": 1,
        "text": "People who like Arcane are interested in RWBY. I think that's fine. Just remember that the FNDM (RWBY fandom) is really on edge because a lot of the she's future is up in the air and like any fandom, some of those people can be defensive and jerks sometimes. Some of you are League of Legends players"
    },
    {
        "label": 1,
        "text": "I've never played League of Legends, and have no interest in it. But I'm intrigued by Arcane. Is it comprehensible and enjoyable for someone coming in with no lore background?"
    },
    {
        "label": 1,
        "text": "Trop frais mon profil league of legends"
    },
    {
        "label": 1,
        "text": "League of Legends is making a bunch of changes that rubber band the game and make it more forgiving and inviting for new players. It's also adding a wider variety of objectives and gimmicks.\n\nIt's just becoming Heroes of the Storm now. Everyone hates this and I love it. It's specifically for me."
    },
    {
        "label": 1,
        "text": "fucking League of Legends\nwhy does such an unfun game have to have such peak character design"
    },
    {
        "label": 1,
        "text": "sorry to post about league of legends but if that fuckass viktor skin has no haters im dead"
    },
    {
        "label": 1,
        "text": "👥️ ATUALIZAÇÃO DE CAMPEÃO - LEAGUE OF LEGENDS \n\n🛠️💇✨️Atualização Visual e de Jogabilidade - Viktor\n\n🖼 Splashart (Antigas vs Novas)\n~ Viktor Velho Oeste\n\n#LeagueOfLegends #Viktor"
    },
    {
        "label": 1,
        "text": "👥️ ATUALIZAÇÃO DE CAMPEÃO - LEAGUE OF LEGENDS \n\n🛠️💇✨️Atualização Visual e de Jogabilidade - Viktor\n\n🖼 Splashart (Antigas vs Novas)\n~ Viktor Protótipo\n\n#LeagueOfLegends #Viktor"
    },
    {
        "label": 1,
        "text": "👥️ ATUALIZAÇÃO DE CAMPEÃO - LEAGUE OF LEGENDS \n\n🛠️💇✨️Atualização Visual e de Jogabilidade - Viktor\n\n🖼 Splashart (Antigas vs Novas)\n~ Viktor Jurado de Morte\n\n#LeagueOfLegends #Viktor"
    },
    {
        "label": 1,
        "text": "thought league of legends was exclusively for virgins wdym you guys have a lesbian relationship and haven’t fallen into the bury your gays trope"
    },
    {
        "label": 1,
        "text": "So…. I want to get into League of Legends 🥹 Any tips??\n#Lol #LeagueOfLegends #VtuberEN"
    },
    {
        "label": 1,
        "text": "Jinx? Jinx!\n\n#arcane League of Legends Jinx\n#arcaneseason2"
    },
    {
        "label": 1,
        "text": "who here plays league of legends!?  anyone ?"
    },
    {
        "label": 1,
        "text": "In the meantime... \n\nFavorite Games!\n\n🔸️Sims 3 & 4\n🪨Terraria\n🌾Stardew Valley\n🚬League of Legends\n♟️Team Fight Tactics(TFT)\n🍻Bladurs Gate 3\n🛍Dress to impress\n🥷Mortal Kombat\n🔥Sonic Adventure Battle 2\n🦤Palworld\n🚘GTA 5\n🪐Starbound\n🌐MMO'S\n✨️Simulation Games\n#promosky"
    },
    {
        "label": 1,
        "text": "Looking for some people to follow on here, I'm into~\n\n- Web Design & Development\n- Dogs\n- Video Games\n- Hiking\n- Football\n- Investing\n- Weight lifting\n- WordPress\n- JavaScript\n- Freelance\n- Indie hacking\n- League of Legends\n- Arcane\n- Twitch\n- Buying domains\n\n#promosky"
    },
    {
        "label": 1,
        "text": "My birthday present to myself has been fully funded by a League of Legends drain today💖"
    },
    {
        "label": 1,
        "text": "breaking: jake paul exhumed graves of multiple long-dead sports legends, brought back to life by PRIME, to start a zombie fight league"
    },
    {
        "label": 1,
        "text": "I don't league of legends but I feel like I need to watch the lesbian sex, for research 👀"
    },
    {
        "label": 1,
        "text": "I love animation. No. I love high quality animation.  Even more than that, I love high quality animation as a medium for storytelling. Both of these series, Arcane on Netflix, and Pantheon, on AMC+ (also on Netflix but other places too), fit the bill."
    },
    {
        "label": 1,
        "text": "Viktor VGU thread"
    },
    {
        "label": 1,
        "text": "✧ Viktor | League Of Legends \n\n» Confira os Ícones das skins Arcane 2 temporada"
    },
    {
        "label": 1,
        "text": "Uhoh I’m thinking about Viktor and Jayce again (but in a gay way and not in a I want to get back into league of legends kinda way)"
    },
    {
        "label": 1,
        "text": "Once again looking for the League of Legends bubble on Bluesky. \n\n23♂️\nEUW🇪🇺\nSupport Main🚑\nBard/Rakan/Lux🧙‍♂️\n\nJust a chill guy really \n\nIGN: Tamarisk \n#leaguesky #leaguetwt"
    },
    {
        "label": 1,
        "text": "#promosky #blacksky\nlooking for mutuals ( ꒪◡꒪)\nmy interest are:\n- queer/black culture, ballroom\n- pokemon & digimon\n- anime\n- gaming, League of Legends\n- DC and Marvel comics \n- art, character design, creative writing\n- nicki minaj \n- beyoncé\n- commercial dance, hip hop \n- cosplay\n- fitness \n- xxx"
    },
    {
        "label": 1,
        "text": "installing league of legends and inciting people into calling me slurs just to feel something"
    },
    {
        "label": 1,
        "text": "36. Favorite character? \nPyke from League of Legends!!! and also Jhin :> I am so obsessed with both despite not playing League for a while"
    },
    {
        "label": 1,
        "text": "Watching the Arcane / League of Legends fandom react to the end of the show across all social platforms (but especially Twitter) feels like injecting tumblr into your brain at unfathomable speed. This is fandom like I’ve never seen before."
    },
    {
        "label": 1,
        "text": "League of Legends will divide 2025 into three seasons with themes, narratives, and content specific to each"
    },
    {
        "label": 1,
        "text": "Going live on Twitch with some button mashing in Arams on League of Legends! Come hang out. 🥰\nNevaSkydancer on Twitch"
    },
    {
        "label": 1,
        "text": "will the server merger finally bring me back to league of legends? tune in to find out"
    },
    {
        "label": 1,
        "text": "Gonna try this #promosky to reach more mutuals!\n- Kingdom Hearts\n- Final Fantasy\n- League of Legends\n- Digimon\n- Pokemon\n- Arcane\n- Sonic The Hedgehog\n- Marvel Rivals\n- Marvel\n- Persona\n- Hatsune Miku/Vocaloid\n- ZEDD\n- RWBY"
    },
    {
        "label": 1,
        "text": "Live playing League of Legends⚡\ntwitch.tv/amigo_cat \n#Vtuber #ENVtuber"
    },
    {
        "label": 1,
        "text": "like are these bitches so gay that i’m forced to watch the League of Legends show?"
    },
    {
        "label": 1,
        "text": "The LoL splash art is going to put me into cardiac arrest"
    },
    {
        "label": 1,
        "text": "🎭 SKINS - LEAGUE OF LEGENDS\n\n#Arcane - Parte II do Evento \n\n👀 PRÉVIA:\n~ Jinx Fragmentada (Primeira Skin EXALTADA do LOL)\n\n#Arcane #LeagueOfLegends #Jinx"
    },
    {
        "label": 1,
        "text": "The world of league of legends is so cool I wish the community wasn’t so toxic so I could feel safe playing 😅"
    },
    {
        "label": 1,
        "text": "Io addirittura spero facciano spinoff! I mondi da esplorare in League of Legends sono parecchi: che ci pensino!!!"
    },
    {
        "label": 1,
        "text": "the only good thing about league of legends is that, i play support and every game in my head im like \"oh yeah beg for that help\""
    },
    {
        "label": 1,
        "text": "Everyday I stray further from the light & inch closer to downloading League of Legends"
    },
    {
        "label": 1,
        "text": "anytime u feel yourself wavering … just remember … the sweaty balding men that play league of legends and u should be good"
    },
    {
        "label": 1,
        "text": "It has absolutely ZERO business being as peak as it is.\n\nIt almost cured me of my League of Legends-related trauma."
    },
    {
        "label": 1,
        "text": "oh so it's the league of legends of sonic games"
    },
    {
        "label": 1,
        "text": "Elon says if he played League of Legends, it would harm the space program. 🎮🚀 Balancing gaming and space exploration is no easy feat!"
    },
    {
        "label": 1,
        "text": "tldr its a new game but it's not actually new so there are people who already have all the strats down from similar games -> not fun experience if you're actually new\n\ni dont mind playing vs other tryhard new people but not many are actually new lol\n\nanyway do not actually play league of legends"
    },
    {
        "label": 1,
        "text": "no because why is my best friend pregnant with her third child and im on bluesky talking about league of legends characters"
    },
    {
        "label": 1,
        "text": "My inner dialogue while playing League of Legends:"
    },
    {
        "label": 1,
        "text": "my wives going out on a date and leaving me at home: dont worry she has her happy meal and her league of legends and we left the heat on for her so she wont freeze"
    },
    {
        "label": 1,
        "text": "VB why 💔💔 this is so sad\nNo show no matter how good it is should lead to *shudders* league of legends…."
    },
    {
        "label": 1,
        "text": "#4: Tie of League of Legends/DOTA 2, Bot Mode Games\n\nit's a sickness that can't be cured. i enjoy mobas, but these days when I get the itch I just jump into a PVE version of it to keep the toxicity non-existant & the playtime short. this is a me problem. i'm sorry"
    },
    {
        "label": 1,
        "text": "Can't see anything League of Legends related without remembering that time they had someone rping on Twitter as one of the characters and she acted depressed so people would show off their merch and stuff"
    },
    {
        "label": 1,
        "text": "get to know your mutuals\nin no particular order, post 10 things you like:\n\nHerbalism\nTV series \nLeague of Legends\nArts and crafts \nDancing \nSinging \nLocal markets \nWeed \nInterior design"
    },
    {
        "label": 1,
        "text": "Juge League of Legends 1 semana y no me gusto, me aburre xD\n\nJuge Valorant y me aburrio\n\nVi Arcane unos pocos episodios y me aburrio y ni de blas vere la segunda temporada \n\nCon todo el respeto del mundo me aburre muchissimo Riot y LoL\n\nNo se que le ve la gente pero bueno lo respeto 💗✨"
    },
    {
        "label": 1,
        "text": "This show made me install League of Legends and those are not my kind of games but this show does something 😦🥹"
    },
    {
        "label": 1,
        "text": "you also get a contract right at the beginning where you promise not to throw, but then the tutorial just tells you how to attack lanes without explaining any roles or mentioning jungling or exactly how the lil shop thing works at the spawn then just tells you to play some games"
    },
    {
        "label": 1,
        "text": "me colocando como invisível no discord pq me verem jogando the sims 3 por 16h tudo bem, mas me verem abrindo league of legends ja eh demais"
    },
    {
        "label": 1,
        "text": "i did not enroll in university to hear about league of legends bro"
    },
    {
        "label": 1,
        "text": "the other night i had a fever dream of me returning to youtube just to make a vid shittin on the new player experience of League of Legends cuz what the fuck you mean this is the page where you buy a character? no description of their role, abilities, playstyle, no \"try this champion\" button?"
    },
    {
        "label": 1,
        "text": "The universe doesnt want me to play league of legends\nInternet just left orbit as I started a game\nGuess this is gnight"
    },
    {
        "label": 1,
        "text": "FINALLY trying out House Flipper! We will be jumping into League of Legends afterwards so come join in and hangout! twitch.tv/itsjustjenne #vtuber #envtuber #houseflipper #leagueoflegends #twitchaffiliate #twitch"
    },
    {
        "label": 1,
        "text": "Riot Games' new Jinx skin, inspired by Arcane Season 2, has sparked controversy due to its high price and gacha mechanics. Fans criticize the skin's similarity in forms and lack of iconic features, leading to disappointment in the community. #LeagueOfLegends\nRead more>>"
    },
    {
        "label": 1,
        "text": "Arcane is just goated right? The animation, the story. I bet even a non League of Legends fan would enjoy and like it"
    },
    {
        "label": 1,
        "text": "Winter Wonder Lulu - League of Legends [Tomia]\nView this article\n\n#hentaicosplay #hentai #cosplay #nsfw #league-of-legends #lulu #spiral-cats #pantyhose"
    },
    {
        "label": 1,
        "text": "Look, you'll never get me playing League again no matter how good an animated series you make... but look at this lil' guy. Vibes immaculate."
    },
    {
        "label": 1,
        "text": "Rarely does a sequel live up to its predecessor, yet Arcane: League of Legends Season Two not only meets but exceeds expectations. #ArcaneLeagueofLegends #EllaPurnell #HaileeSteinfeld #KatieLeung #KevinAlejandro\nwww.themovieblog.com/2024/11/arca..."
    },
    {
        "label": 1,
        "text": "im a casual gamer in the sense that i only play league of legends and valorant and I refuse to play anything else"
    },
    {
        "label": 1,
        "text": "I am in the middle of carrying a league of legends game about to close it out, and my bra-less wife brings me a sandwich (not asked for) with chips as I get a double kill bot lane.\n\nSo how is your day going?"
    },
    {
        "label": 1,
        "text": "League of Legends is my life (nmg grac w nic innego bo mi laptopa wypierdoli w powietrze)"
    },
    {
        "label": 1,
        "text": "I really want an arcane tattoo but an arcane tattoo = a league of legends tattoo and I do not want that 💀"
    },
    {
        "label": 1,
        "text": "my dad: what ur gay ass want for christmas\n\nme: league of legends RP gift cards $250 value"
    },
    {
        "label": 1,
        "text": "This skin almost is making me coming back to league of legends. For the first time in like 5 years or more they're starting to do taunt quotes again AND more than one quote for encountering Y champion. Their usual is just making first encounters quotes and nothing more than one quote per champion."
    },
    {
        "label": 1,
        "text": "That may be a good idea. Can I reccomend something nice and relaxing like overwatch or league of legends to counter the hardcore game animal crossing.\n\n/s"
    },
    {
        "label": 1,
        "text": "I-I'm so sorry...."
    },
    {
        "label": 1,
        "text": "Loot looks way too much like a League of Legends character so i hate it."
    },
    {
        "label": 1,
        "text": "classmate said he watched arcane and he downloaded league of legends because of it. tragic"
    },
    {
        "label": 1,
        "text": "Check out Remember Me (Intro) (from the series Arcane League of Legends) by d4vd on Amazon Music\nhttps://music.amazon.com/albums/B0DKTK9N2C?trackAsin=B0DKTJPT62&do=play&ts=1732657450&ref=dm_sh_N99ZaZgSebe7UmhnkKfXgzxS0 \n"
    },
    {
        "label": 1,
        "text": "Do I need an actually good computer to play league of Legends or is my dinosaur laptop fine"
    },
    {
        "label": 1,
        "text": "Also if you think Forza has a toxic community, wait until you see something like Rainbow Six Siege or League of Legends 💀 but yeah I try to stay away from Reddit as much as possible, ever since the AI scraping stuff they're doing."
    },
    {
        "label": 1,
        "text": "Vi: We need to team up to defeat my evil sister!\n\nCait: We need to form a group of Piltover's strongest legends!\n\nJayce: Heh, what are we, some sort of League of Legends?"
    },
    {
        "label": 1,
        "text": "TIL \"Everything Goes On\" by Porter Robinson is a League of Legends song (I just like Porter Robinson). BUT ALSO now I know the Star Guardian skins exist and now I'm looking at that Jinx skin like 👀 (I love that @mimlaria.bsky.social puts up with me 💖💖)"
    },
    {
        "label": 1,
        "text": "Idk how I'm meant to get chests in League of Legends. I have so many keys and nothing to do with them :("
    },
    {
        "label": 1,
        "text": "You had me until League of Legends"
    },
    {
        "label": 1,
        "text": "Wouahhhhhh la saison 2 d'Arcane, la fin c'est un truc de ouf.\n\nQue vous connaissiez ou pas League of legends aller matter cette série de malade"
    },
    {
        "label": 1,
        "text": "MILO LEAGUE OF LEGENDS MEU DEUS"
    },
    {
        "label": 1,
        "text": "God I hope one of the ultimates eventually graces us with a “League of Legends” title"
    },
    {
        "label": 1,
        "text": "League of Legends"
    },
    {
        "label": 1,
        "text": "I HATE LEAGUE OF LEGENDS"
    },
    {
        "label": 1,
        "text": "Would you say they were part of a league?\n\nOf legends?"
    },
    {
        "label": 1,
        "text": "A show based on league of legends has no business being this good.  It’s a masterpiece.    Truly."
    },
    {
        "label": 1,
        "text": "11. Hobbies are obvious. Art and Games. but more specifically, I LOVE fighting games and sadly, League of Legends. I love all things pixel art so we can talk about nuanced bullshit and ill cry happily (metal slug is soooo beautiful!) but also chats about digital entertainment development!"
    },
    {
        "label": 1,
        "text": "Today I will spoil You with an art piece from 2013 with a character from League of Legends - Annie 🐻\nEven though so many years have passed, I still like this drawing!\n#art #digitalart #annie #artist #leagueoflegends #drawing"
    },
    {
        "label": 1,
        "text": "Nothing hurts more than all my friends getting back into god damn League of Legends"
    },
    {
        "label": 1,
        "text": "this is criminal"
    },
    {
        "label": 1,
        "text": "So... League of Legends... Make this a thing please... Lil revive/fiddlesticks skin, it's just an idea #lilrevive #leagueoflegends #arcane"
    },
    {
        "label": 1,
        "text": "I think it goes back to the League of Legends DNA, in that they have these really well-defined characters with a setting that is much sketchier when it is not dealing with them. Zaun is not a place that Jinx happens to live, it is The Place Jinx Lives as the core of its identity."
    },
    {
        "label": 1,
        "text": "Alright, y'all win, I'll watch Arcane even though I never have and probably never will play League of Legends"
    },
    {
        "label": 1,
        "text": "continuing the challenge to draw every League of Legends champ (i will never do it)\n\n3/169 Akali"
    },
    {
        "label": 1,
        "text": "League of Legends AU where Ekko takes the larger clock hand"
    },
    {
        "label": 1,
        "text": "Salut Oz, tu connais Fiddlesticks ?\n\nC'est le lore de FNAF concentré dans League of Legends"
    },
    {
        "label": 1,
        "text": "internally at war with the fact that arcane is rehabilitating League of Legends image"
    },
    {
        "label": 1,
        "text": "(Oh, and should you play League of Legends, the game the show is based on? No, absolutely not.)"
    },
    {
        "label": 1,
        "text": "league of legends team fujoing out wow"
    },
    {
        "label": 1,
        "text": "fuck me they actually all have \"a league of legends story\" after them"
    },
    {
        "label": 1,
        "text": "they seem to got a concentrated effort to diffuse their own branding and i don't know if it's because they're dumb or it's VERY calculated.\n\nyou'd expect all of these to have a \"league of legends presents\" preceding them"
    },
    {
        "label": 1,
        "text": "Sorry idc how gay it is, I'm not interested in league of legends IP"
    },
    {
        "label": 1,
        "text": "can you go out of bounds in act 3 in the arcane mini game jinx fixes everything in league of legends? yes. is there an otherwise inaccessible lone fence floating outside of the entire map? also yes."
    },
    {
        "label": 1,
        "text": "The first and only time I have ever used a mens public restroom was while I was cosplaying Lux league of legends all by myself lol"
    },
    {
        "label": 1,
        "text": "Emerald Run is a #nuzlocke comic based on a blind playthrough of Emerald I did long ago. In the summer of 2010, a lone trainer is sent to Hoenn posing as a gym league contender, to tail teams Aqua and Magma and stop them from reviving legends best left buried.\n\nread: emeraldrun.thecomicseries.com"
    },
    {
        "label": 1,
        "text": "I want to add that I've never played League of Legends, (and probably never will my friends think I'll hate it) so I say this with no bias. My wife doesn't even play video games much at all and it's one of her favorite shows. It's THAT good 😭"
    },
    {
        "label": 1,
        "text": "A real promo post now, here are my fave things:\n\nanime\nmanga\noverwatch 2\nleague of legends \ntft\nstardew valley\nanimal crossing\nsims 4\nsilent hill\nmetal music\nart\ncats\nsushi\nstudio ghibli\nsanrio \npokemon\nwitchcraft \nembroidery\nbooks\n\n🩷 so I can follow! #promosky"
    },
    {
        "label": 1,
        "text": "✧ Viktor | League Of Legends \n\n» Veja as novas splash art para o Viktor."
    },
    {
        "label": 1,
        "text": "Looking for moots! Some of my interests \n-NFL (Bengals)\n-NBA (Kings\n-esports (Valorant / league of legends)\n-Movies of all kinds!\n- Coffee\n- Manga \n- video games (soulsborne mostly)\n-Anything remotely interesting lol\n\nInteract/reply for a follow!"
    },
    {
        "label": 1,
        "text": "Girlfriend didn't realise arcane was league of legends nature is healing"
    },
    {
        "label": 1,
        "text": "Hope you enjoy it! I have so far despite never playing League of Legends."
    },
    {
        "label": 1,
        "text": "Jinx by Ulichan\nView this article\n\n#hentaicosplay #hentai #cosplay #nsfw #jinx #league-of-legends #leagueoflegends #lol #ulichan"
    },
    {
        "label": 1,
        "text": "if I send you this it means I want you to play league of legends with me"
    },
    {
        "label": 1,
        "text": "Meu amigo... eu sou um PINSCHER, PURO ÓDIO NESSE CORAÇÃO\n\n(me deixa jogando league of legends por 5 minutos pra vocês verem onde vai toda essa agressividade)"
    },
    {
        "label": 1,
        "text": "everyone say thank you mel 🫶🏻"
    },
    {
        "label": 1,
        "text": "Jinx from League of Legends\n\n#cosplay"
    },
    {
        "label": 1,
        "text": "tempted to make fanart of arcane but that would mean making fanart of league of legends 😭"
    },
    {
        "label": 1,
        "text": "“you gotta watch arcane it’s like league of legends in show form” i understand elective lobotomies now"
    },
    {
        "label": 1,
        "text": "As the kids say: Lol, Lmao, even."
    },
    {
        "label": 1,
        "text": "working title: The Transgender Invasion\n\nheterosexual game options: call of duty, league of legends, fifa/college football, help wtf do straight men play"
    },
    {
        "label": 1,
        "text": "I think my favourite part of the Arcane finale was when Jayce said \"Guys we're a League... Of Legends\""
    },
    {
        "label": 1,
        "text": "this should appeal to a guy who is both a relatively online lesbian and a league of legends player. but I can't stand either of those communities"
    },
    {
        "label": 1,
        "text": "wdym you don't like the Netflix original series based on league of legends catered specifically for Twitter lesbians?"
    },
    {
        "label": 1,
        "text": "The show is my first experience with League of Legends, if I had a computer, I'd probably play.\n\nPerhaps one day.\n\nIn the meantime, preparing to watch season 2, I'm taking time out to get into the Xmas spirit with VIOLENT NIGHT.\n\n😁\n\nSomething light before I see what's in store for Vi and Jinx\n\n💋"
    },
    {
        "label": 1,
        "text": "This video actually sold me on league of legends 9 years ago. I can’t tell you how many times I watched it."
    },
    {
        "label": 1,
        "text": "▶︎▷League of Legends ｜ 愉快なみなさま ｜夕陽リリ￤にじさんじ\nTOP 57 words\nURL: https://www.youtube.com/watch?v=vD1i-0uN9Bk"
    },
    {
        "label": 1,
        "text": "Whelp.. Arcane got me back into this hell hole"
    },
    {
        "label": 1,
        "text": "My guess is that Arcane's lore isn't canon to the League of Legends game and this is them beginning to build lore for the MMO.\n\nShow up in Piltover and Vi and Cait are there. Gives the game \"main characters\" and leaves the opportunity in future patches to introduce Jinx/Viktor/Jayce/etc."
    },
    {
        "label": 1,
        "text": "\"I'm here to talk to you about the 'League of Legends' initiative.\""
    },
    {
        "label": 1,
        "text": "I've never played League of Legends, I have no prior connection to any of these characters, but frankly, Arcane may be literally the best storytelling I've ever seen on screen. And goddamn, the soundtrack is soooo good."
    },
    {
        "label": 1,
        "text": "Do I need to know anything about League of Legends, though?  I keep hearing amazing things, but ive never even seen a LoL twitch stream before..."
    },
    {
        "label": 1,
        "text": "5.\nback when i played league... (shudders) i mained seraphine"
    },
    {
        "label": 1,
        "text": "Complete the explosive finale of Jinx Fixes Everything Act 3 in League of Legends. Help Jinx upgrade her weapons at Ekko's workshop to save her friends. Finish the act to earn the Arcane Shimmer Lab Singed skin! #LeagueOfLegends\nRead more>>"
    },
    {
        "label": 1,
        "text": "learning that the league of legends show was actually a slow burn and not insane queer bait is so sad. I was hoping I could keep making fun of it"
    },
    {
        "label": 1,
        "text": "You're only allowed to make fun of me for playing League of Legends if you or a significant other of yours doesn't play Fortnite, that game is literally the antichrist compared to League"
    },
    {
        "label": 1,
        "text": "Acabo de ver que por un Aspecto cosmetico para el League of Legends Piden 200$... y seguro que hay gente mal de la cabeza que la compran"
    },
    {
        "label": 1,
        "text": "I avoid people who play league of legends im ngl"
    },
    {
        "label": 1,
        "text": "ye olde league of legends setup"
    },
    {
        "label": 1,
        "text": "Anybody here play league of legends or watch arcane? I have big viktor feelings but specifically from a charactervisual-gameplay design perspective and new viktor clashes in a way that makes me uncomfortable"
    },
    {
        "label": 1,
        "text": "QOTD: What fandoms are you in?\n\nI’m obviously in the furry fandom, but I love pokemon, warrior cats, league of legends, and most horror franchises to name a few 🖤🔪"
    },
    {
        "label": 1,
        "text": "Even after everything.. Remember not to actually install league of legends"
    },
    {
        "label": 1,
        "text": "I'm sorry to everyone if \"League of Legends\" turns up on my top artists for Spotify Wrapped."
    },
    {
        "label": 1,
        "text": "#promosky :)\n\n🍁 Creative Writing\n🌧 Poetry\n🍁 League of Legends/TFT\n🌧 Baldurs Gate 3\n🍁 DnD/Tabletop games\n🌧 Cards and Card games\n🍁 Pokemon\n🌧 Roguelikes\n🍁 Dungeon Meshi\n🌧 Madoka Magica\n🍁 Fall weather\n🌧 Queer media"
    },
    {
        "label": 1,
        "text": "25. Favourite video game?\nOughh can't pick one: Ori, Hollow Knight, League of Legends, Super Mario Galaxy, Final Fantasy..."
    },
    {
        "label": 1,
        "text": "Otro spoiler: va de League of Legends"
    },
    {
        "label": 1,
        "text": "i refuse to watch the league of legends show. you can't make me"
    },
    {
        "label": 1,
        "text": "painting practice\n#viktor #machineherald #myart #artoflegends"
    },
    {
        "label": 1,
        "text": "It’s a 4-way tie between mysims kingdom, hyrule warriors, league of legends, and strinova (new shooter game with weird paper mechanics but i played the beta and it was hella fun)"
    },
    {
        "label": 1,
        "text": "21. Favourite song? \nI think it varies with time. I an quite random for music, I especially like game/series soundtracks. Some of my favs are from League of Legends/Arcane and also Ori soundtracks."
    },
    {
        "label": 1,
        "text": "I’m not a big fan of League of Legends and I’ve never played it but the show is really good so far and the art is amazing"
    },
    {
        "label": 1,
        "text": "arcane to league of legends pipeline got me feeling like"
    },
    {
        "label": 1,
        "text": "But League of Legends might miss me"
    },
    {
        "label": 1,
        "text": "It ain’t right that arcane is gonna stay a part of my brain for the rest of my life. I know it’s ‘uncool’ and what not. I know it’s league. But I’m about it and it’s my thang and … aaaaaghhhhhhh why league of legends"
    },
    {
        "label": 1,
        "text": "Lulu league of legends:"
    },
    {
        "label": 1,
        "text": "i need this semester to be over so i can play league of legends for 10 hours a day"
    },
    {
        "label": 1,
        "text": "my main issue with league of legends is that they never really explored the series' connection with 20,000 leagues under the sea"
    },
    {
        "label": 1,
        "text": "Hi hiii! I’m new to this platform and wanted to spread my art somewhere  ٩(ˊᗜˋ*)و ♡!! \n\nMy interests:\n❤️ Drawing/Art\n❤️ Anime/Manga\n❤️ League of Legends (I’m sorry lol)\n❤️ Gaming in general\n❤️ Silly cats \n❤️ Trinket collecting/keychains\n\nLETS BE MOOTS!!!"
    },
    {
        "label": 1,
        "text": "My only interaction with League of Legends are Arcane, Legends of Runeterra and 2 matches of the actual game 12 years ago (so the correct way to interact) but that Illaoi isn't more popular baffles me when she clearly is the best girl in the game. Hopefully the upcoming fighting game will fix that."
    },
    {
        "label": 1,
        "text": "Man kann von League of Legends halten was man will, aber Arcane ist cool und der Soundtrack geil."
    },
    {
        "label": 1,
        "text": "Haven't reintroduced myself since my name change, but I'm Avery/Averaey 🍀\n\nI'm primarily a League Of Legends streamer as a Master APC/Support player\n\nI also make educational content for League as your Girlypop Guide on other platforms! All my links ↓\n\n『 #ENVtuber  #VTuberEN #AveryIllust』"
    },
    {
        "label": 1,
        "text": "Sneak peek of my next analysis thread 😎"
    },
    {
        "label": 1,
        "text": "this is y/n. she has super alpha omega werewolf powers and is my orignal oc (do not steal). when she isn’t kicking beta butt, she’s playing league of legends because she’s #notlikeothergirls (cooler, one of the boys)\n#furry #myimmortal"
    },
    {
        "label": 1,
        "text": "Estúpido league of Legends no le bastaba con hacerme consumir contenido de ese estúpido juego de mierda que además tenía que hacerme escuchar música en francés."
    },
    {
        "label": 1,
        "text": "If you ever doubt the importance of paying attention to your kids, remember some grow up to play league of legends.. FOR FUN"
    },
    {
        "label": 1,
        "text": "this is for my people who just lost somebody 🕊️ #lol"
    },
    {
        "label": 1,
        "text": "Arcane may be one of the best things I've ever watched, animated or not. I've never played a second of League of Legends either. Just an unbelievable experience."
    },
    {
        "label": 1,
        "text": "Arcane is very good currently taking suggestions for more LoL content that isn't League of Legends"
    },
    {
        "label": 1,
        "text": "i dont care how good arcane is, im not playing league of legends"
    },
    {
        "label": 1,
        "text": "I don't know what League of Legends is either lol"
    },
    {
        "label": 1,
        "text": "My interests: \nWh40k\nWorld of Warcraft \nLeague of Legends \nVampire the masquerade bloodlines \nSkyrim\nMass effect \nThe Witcher 3\nZzz\nGenshin impact \nNier automata\nBorderlands \nSailor Moon \nNaruto\nOshi no ko \nKimetsu no yaiba \nDeath note\nEvangelion \nDungeon meshi \nOther anime\nDc and marvel \n#promosky"
    },
    {
        "label": 1,
        "text": "15 years after launch, League of Legends is getting a new queue: Swiftplay.\n\nThis will replace Quickplay in select territories, and provides a faster-paced, more relaxed variant of regular League.\n\nhttps://freetoplayer.com/league-of-legends/swiftplay/"
    },
    {
        "label": 1,
        "text": "I've played league of legends more than I've watched arcane this is disgusting (friend wanted to play in middle school, we sucked)"
    },
    {
        "label": 1,
        "text": "First of all - friends shouldn't let friends play League of Legends. Second, I would still give my life for a Diana and Leona toxic romance show.\n\nOr maybe they change the lore so it's not a giga toxic lesbian moon and sun god romance. Either way, let the Noxus/Ionia show be theirs!!!"
    },
    {
        "label": 1,
        "text": "Then you'd become a greasy virgin introvert who plays league of legends"
    },
    {
        "label": 1,
        "text": "Id recommend looking into Legends of Runeterra and Teamfight Tactics if you wanna dabble in the League of Legends universe. They're much more beginner friendly ^-^\nYou're welcome to add me if you want, Riot ID's are across their games. I'm like level 900 at this point ( ￣▽￣)"
    },
    {
        "label": 1,
        "text": "euw bsky users gimme ur league of legends ign pls"
    },
    {
        "label": 1,
        "text": "Novos detalhes sobre a primeira temporada do novo modelo sazonal de League of Legends www.otakupt.com/jogos/novos-..."
    },
    {
        "label": 1,
        "text": "Yo de verdad, nunca pensé que algo relacionado con League of Legends fuera a interesarme.\n\nEste es otro ejemplo de que las series de videojuegos pueden ser la hostia, siempre que se hagan bien.\n\nHay muchos ejemplos en los que, por mucho que sea videojuegos, se hace mal y es horrible..."
    },
    {
        "label": 1,
        "text": "another #promosky because my feed is filled with german politics\n\ngaming: \n\n❣️ League of Legends \n❣️ Black Ops 6\n❣️ Overwatch 2\n❣️ Valorant\n❣️ Minecraft\n❣️ Age of Empires 2\n❣️ TFT\n❣️ Cyberpunk 2077\n\nanime:\n\n❣️ Attack on Titan\n❣️ Full Metal Alchemist Brotherhood\n❣️ One Piece\n❣️ Cowboy Bebop\n\n♡/↻ appreciated!"
    },
    {
        "label": 1,
        "text": "the rengar on the enemy team"
    },
    {
        "label": 1,
        "text": "no matter how good arcane is, it is still based off league of legends and i need to remember that </3"
    },
    {
        "label": 1,
        "text": "League of Legends but it's actually good"
    },
    {
        "label": 1,
        "text": "Arcane is just pro-League of Legends propaganda cause why are me and my boyfriend talking about downloading it again 😭😭😭"
    },
    {
        "label": 1,
        "text": "League of Legends has the most toxic fan base I've ever met. Absolutely not new just extra loud with how prevalent social media is these days"
    },
    {
        "label": 1,
        "text": "It's always weird seeing merch of League of Legends Jinx in a post Arcane world. It always looks like bootleg merch. I'm here for the sad girl and not this blue harley quinn looking rip off.\n\nThe irony of League's roster being full of bootleg characters makes this funnier."
    },
    {
        "label": 1,
        "text": "lol!   hooo lol (league of legends) asuhauhsuahsa"
    },
    {
        "label": 1,
        "text": "Basically Unite is like league of legends but the meta is absolute shit. Every new Pokemon is absolutely through the roof overpowered in order for them to make money selling it. They only let you buy new Pokemon with paid currency"
    },
    {
        "label": 1,
        "text": "“Take my hand. I will save you from League of Legends.”"
    },
    {
        "label": 1,
        "text": "Não adianta Riot, eu nao vou jogar league of legends pra comprar skin só pq vi arcane. Mas essa skin do Viktor ta fodassa"
    },
    {
        "label": 1,
        "text": "We got 60 subs tonight thanks to @bigbysgaminghand.bsky.social, @vtubertherapist.bsky.social, @/Ciel_ChaqeXiu, and \n@mangsora.bsky.social. \n\nThanks for the subs, bits, and follows, too!\n\n  ~*~*~*I WILL PLAY LEAGUE OF LEGENDS~*~*~*  \n\nThank you to all who dropped by the streams and joined the hunts!"
    },
    {
        "label": 1,
        "text": "me, innocent, unknowing of the future: “Violeta is a good name because it was my abuela’s. Plus, ‘Vi’ is a good nickname, and a fun reference to my favorite family of text editors”\n\nThe fucking League of Legends tv show:"
    },
    {
        "label": 1,
        "text": "Okay but hear me out.\n\nLeague of Legends is a cozy game."
    },
    {
        "label": 1,
        "text": "That League of Legends intro thing with Linkin Park was incredible."
    },
    {
        "label": 1,
        "text": "league of legends is such an amazing game when you don't have an asshole in your ear messing you up for every mistake to such an extent that you end up afraid to commit to anything"
    },
    {
        "label": 1,
        "text": "I never even heard about League of Legends before I watched the show. You don't have to play that game to enjoy the show."
    },
    {
        "label": 1,
        "text": "I won’t be fooled into playing League of Legends I won’t be fooled into playing-"
    },
    {
        "label": 1,
        "text": "League of legends 🫵"
    },
    {
        "label": 1,
        "text": "Arcane having a lesbian sex scene sounds so fake but it actually happens like what do you mean a league of legends cartoon has a lesbian sex scene???"
    },
    {
        "label": 1,
        "text": "Tem episódio novo do LPTV no ar! Dessa vez a banda mostra como foi a apresentação na final do League of Legends e bastidores dos shows em Paris e Dallas.\n\nAssista agora no LP:BR www.linkinparkbr.com/news/lptv-wo...\n\n#LinkinPark #FromZeroWorldTour #LPTV"
    },
    {
        "label": 1,
        "text": "League of Legends good"
    },
    {
        "label": 1,
        "text": "Arcane Season 2's Best Episode Feels More Like Life Is Strange Than League of Legends"
    },
    {
        "label": 1,
        "text": "She was forced to play League of Legends"
    },
    {
        "label": 1,
        "text": "👥️ ATUALIZAÇÃO DE CAMPEÃO - LEAGUE OF LEGENDS \n\n🛠️💇✨️Atualização Visual e de Jogabilidade - Viktor\n\n🖼 Splashart (Antigas vs Novas)\n~ Viktor Criador\n\n#LeagueOfLegends #Viktor"
    },
    {
        "label": 1,
        "text": "November has been a tough month. The first week was the roughest. But last week the end of Riot’s League of Legends TV series Arcane on Netflix put animation fans through the spin cycle of the stages of grief yet again #arcane #netflix #animation #leagueoflegends #vi #election #riot #fortiche"
    },
    {
        "label": 1,
        "text": "league of legends"
    },
    {
        "label": 1,
        "text": "Una propuesta valiente y con potencial creada por exdesarrolladores de League of Legends"
    },
    {
        "label": 1,
        "text": "🔥 Sharing a few more of my Annie cosplay pics! Who is your favorite League of Legends character? 🐻🔥\n\n#arcane #cosplay #leagueoflegends"
    },
    {
        "label": 1,
        "text": "A good onboarding process pays you for the time you spend learning. This rewards you for taking your time to get things right. Completing a tutorial should give you something really valuable, League of Legends does this by giving you a choice of a few characters to unlock permanently."
    },
    {
        "label": 1,
        "text": "Savior Viktor looks so stunning?? \n\n(New League of Legends skin)\n\n#viktorarcane #leagueoflegends"
    },
    {
        "label": 1,
        "text": ""
    },
    {
        "label": 1,
        "text": "I regret to inform you that I am playing League of Legends\n\nTtv/ Lucy"
    },
    {
        "label": 1,
        "text": "also i got spoiled for arcane in the funniest way possible thanks to @kyleenim.bsky.social ily"
    },
    {
        "label": 1,
        "text": "Finished Arcane yesterday and it was so fucking good it's actually getting me to stop shitposting for 10 seconds to tell you how fucking good it was. Everyone who sees this go watch Arcane and never fucking play League of Legends"
    },
    {
        "label": 1,
        "text": "Trying this for the first time! Looking for mutuals 👽 \n\nBOOKS:\n\n✧ John Dies at the End\n✧ House of Leaves\n✧ Dune\n✧ Pygmy\n\nFILM/TV:\n✧ Memento\n✧ I Saw The Devil\n✧ Lost Highway\n✧ X-Files\n\nGames: \n✧ League of Legends \n✧ BF2042\n✧ Baldur's Gate III\n✧ Resident Evil\n\n#promosky ✨"
    },
    {
        "label": 1,
        "text": "get in losers we're day drinking and playing League of Legends."
    },
    {
        "label": 1,
        "text": "if you see this, post a bunny! \n\nhere's my lovely bun-bun 🥺"
    },
    {
        "label": 1,
        "text": "Me : \"I want to train Caitlyn cause she's a counter to my main bot picks\"\nOpposing botlane : *bans Caitlyn because long range counters Jinx*\nMe, who has been playing nothing but APC Ziggs for two weeks : \"So, you have chosen death\"\n#LeagueOfLegends"
    },
    {
        "label": 1,
        "text": "👥️ ATUALIZAÇÃO DE CAMPEÃO - LEAGUE OF LEGENDS \n\n🛠️💇✨️Atualização Visual e de Jogabilidade - Viktor\n\n🖼 Splashart (Antigas vs Novas)\n~ Viktor Robotico\n\n#LeagueOfLegends #Viktor"
    },
    {
        "label": 1,
        "text": "League of Legends is the only time imagine dragons makes good music"
    },
    {
        "label": 1,
        "text": "Arcane Season 2’s Best Episode Feels More Like Life Is Strange Than League of Legends\n\nArcane‘s final season on Netflix raised the bar for what a high budget animated series with a plethora of talented artists can accomplish. While fans are hard at work theorizing where the next League of Legends…"
    },
    {
        "label": 1,
        "text": "👥️ ATUALIZAÇÃO DE CAMPEÃO - LEAGUE OF LEGENDS \n\n🛠️💇✨️Atualização Visual e de Jogabilidade - Viktor\n\n🖼 Splashart (Antigas vs Novas)\n~ Viktor (Base)\n\n#LeagueOfLegends #Viktor"
    },
    {
        "label": 1,
        "text": "Decideixo veure un altre vegada Arcane i després veure la segona temporada. Encara no havia vist cap spoiler. \nI sabeu qui m'ha fet l'spoiler??\nEl compte de League of Legends oficial!!!"
    },
    {
        "label": 1,
        "text": "WIP Jinx from league of legends \n\n#anime #digitalart #leagueoflegends #riot #jinx #arcane #wip"
    },
    {
        "label": 1,
        "text": "Here is the Wrathmas Wheel! The alt text contains the fully written out list of gifts\n\nThere is still the opportunity to add more gifts during the event, so any suggestions are welcome 🧡"
    },
    {
        "label": 1,
        "text": "notes:\n- everyone likes to set drinks on fire\n- viego league of legends is canon in ffxiv and is my friend\n- rock and stone\n- i need to cook the zeph drink but shhhh"
    },
    {
        "label": 1,
        "text": "do nada a mulher falando de league of legends na reunião seríssima do trabalho até me engasguei"
    },
    {
        "label": 1,
        "text": "Ich habe #Arcane: League of Legends: The Dirt Under Your Nails (S2.E9) auf #IMDb mit 8/10 bewertet."
    },
    {
        "label": 1,
        "text": "foi nessa skin que ela virou a mulher league of legends"
    },
    {
        "label": 1,
        "text": "#arcanespoilers\n\nGosh, how adorable is this skin? I'm so happy that Heimerdinger was able to get something out of this season of Arcane. And this song has been playing in my head over and over since I watched episode 7. 🥺"
    },
    {
        "label": 1,
        "text": "Yep! League of Legends"
    },
    {
        "label": 1,
        "text": "What if I start showering less, stay in my room more often, become a virgin, and play League of Legends"
    },
    {
        "label": 1,
        "text": "14. Current (or most recent) gaming wallpaper\n\nLeague of Legends Star Guardians official wallpaper. It's been there for a while, pretty much since those skins were released. I was still playing League back then... I no longer play, but I like this picture."
    },
    {
        "label": 1,
        "text": "new Viktor splash art.............. i'm such a queer for this man"
    },
    {
        "label": 1,
        "text": "Look out there's a gremlin behind you she's gonna make you play League of Legends"
    },
    {
        "label": 1,
        "text": "👥️ ATUALIZAÇÃO DE CAMPEÃO - LEAGUE OF LEGENDS \n\n🛠️💇✨️Atualização Visual e de Jogabilidade - Viktor\n\n🔀 COMPARAÇÃO DE DESIGN:\n~ Em Arcane\n~ Na Splashart\n~ Modelo In-Game\n~ Modelo de Apresentação 3D no Wild Rift"
    },
    {
        "label": 1,
        "text": "Jinx (League of Legends/Arcane Ver) - Nendoroid"
    },
    {
        "label": 1,
        "text": "So excited for the viktor vgu in league of legends. Also can’t wait for the swift play mode. Finally, a mode that provides the traditional rift experience without the high playtime."
    },
    {
        "label": 1,
        "text": "Die Eintracht ist schon länger in League of Legends aktiv und seit diesem Jahr der erste Bundesligist der mit VALORANT in einen Shooter E-Sport eingestiegen ist.\n\nAm Samstag spielen sie im Valorant Pokal in den Playoffs!"
    },
    {
        "label": 1,
        "text": "Ahri, Leona, and Diana from League of Legends"
    },
    {
        "label": 1,
        "text": "If I were to draw characters from League of Legends and Overwatch, who would you want to see me draw? 👀"
    },
    {
        "label": 1,
        "text": "Gracias internet por todos los memes de arcane de\n\"We are a league of legends\" y derivados"
    },
    {
        "label": 1,
        "text": "Unfortunately I am starting to consider downloading league of legends"
    },
    {
        "label": 1,
        "text": "To celebrate the 2nd season of #Arcane, bring chaos to your Twitch channel with explosive panels inspired by Jinx from League of Legends.\n\nDesigned with her wild, unpredictable energy, these graphics will make your stream zap with that 'pow-pow' flair! 💥\n\nwww.etsy.com/listing/1720..."
    },
    {
        "label": 1,
        "text": "Should I download League of Legends? 😭"
    },
    {
        "label": 1,
        "text": "Finished Arcane Season 2. What a top tier piece of media, Fortiche did an amazing job with the art and the VA's were so strong. Loved the whole journey through all 18 episodes.\n\n... Now onto finishing Owl House, what a tone shift.\n\n#arcane #owlhouse"
    },
    {
        "label": 1,
        "text": "Livro League of Legends: Reinos de Runeterra - (Amazon)\n\nIdioma inglês \n👉 amzlink.to/az0NyZlCF9Gm9\nR$ 17,34 à vista \nFrete Grátis Prime\n\nIdioma Português - Capa Dura\n👉 amzlink.to/az0h8rNUevol8\nR$ 39,90 à vista\nFrete Grátis Prime"
    },
    {
        "label": 1,
        "text": "I wanna finish and play league of legends 🥰"
    },
    {
        "label": 1,
        "text": "The league of legends show is very good and all but can I just be the first to say the arcane version of Warwick / Vander is sexy AF. His big thighs, tits, and ass is out the whole time and he could probably power bottom the hell out of you 🤤"
    },
    {
        "label": 1,
        "text": "If you haven't watched Arcane: The series from League of Legends guys, You should. It's amazing.\n\nYou don't need to know anything about the game. It's standalone.\n\n#Arcane #LeagueOfLegends #LoL #S2"
    },
    {
        "label": 1,
        "text": "Arcane : League of Legends - Saison 1 en version 4K est en précommande sur ⤵️\n\nFnac : tidd.ly/4i00rXr\nAmazon : amzn.to/499Mh1L\n\nContient dans un Boîtier avec fourreau, 3 Blu-Ray 4K de la saison et 1 Blu-ray de bonus !\n\nInfos : www.steelbookjeuxvideo.fr/arcane-leagu... #pub"
    },
    {
        "label": 1,
        "text": "But liking League of Legends does."
    },
    {
        "label": 1,
        "text": "Riot Games teases League of Legends Season 15, launching January 8, 2025. Expect new gameplay themes, an epic monster, ranked changes, and a revamped battle pass system. Get ready for an exciting new chapter in the LoL universe. #LeagueOfLegends #LoLSeason15\nRead more>>"
    },
    {
        "label": 1,
        "text": "yeah im referring to the toxic ones that complain about every game that isnt league of legends or call of duty"
    },
    {
        "label": 1,
        "text": "I hope I don’t need to play league of legends to watch arcane. I don’t know league of legends lore"
    },
    {
        "label": 1,
        "text": "Amém, meu deus"
    },
    {
        "label": 1,
        "text": "New here so mutuals appreciated!\n\n🧙‍♀️World of Warcraft\n🧂League of Legends\n📜Elder Scrolls Online\n⛏️Minecraft\n🚀EVE Online\n🎴Magic the Gathering\n🐸Pokémon\n🏳️‍🌈LGBTQIA+\n📖Author\n🎭Actor\n🎡Londoner\n🫦Sex Positive\n🧠Mental health\n\nWhat's your thing? Feel free to let me know\n\n#PromoSky #GaySky #Writer #Gaming #BookSky"
    },
    {
        "label": 1,
        "text": "another #promosky because my feed is filled with german politics\n\ngaming: \n\n❣️ League of Legends \n❣️ Black Ops 6\n❣️ Overwatch 2\n❣️ Valorant\n❣️ Minecraft\n❣️ Age of Empires 2\n❣️ TFT\n❣️ Cyberpunk 2077\n\nanime:\n\n❣️ Attack on Titan\n❣️ Full Metal Alchemist Brotherhood\n❣️ One Piece\n❣️ Cowboy Bebop\n\n♡/↻ appreciated!"
    },
    {
        "label": 1,
        "text": "Would you gag on it while I play League of Legends?"
    },
    {
        "label": 1,
        "text": "I feel like it’s either Overwatch, League of Legends or Valorant."
    },
    {
        "label": 1,
        "text": "Arcane fans downloading League of Legends, then realizing its dogshit is one of the funniest things right now."
    },
    {
        "label": 1,
        "text": "Minha vida tá uma merda\nVoltei a jogar League of Legends"
    },
    {
        "label": 1,
        "text": "I have no attachment to league of legends but man, arcane s2e7 makes me feel things i haven't felt from romance in any media in a long time"
    },
    {
        "label": 1,
        "text": "🎭 SKINS - LEAGUE OF LEGENDS\n\n#Arcane - Parte II do Evento \n\n🖼 SPLASHART:\n~ Jinx Fragmentada (Primeira Skin EXALTADA do LOL)\n\n#Arcane #LeagueOfLegends #Jinx"
    },
    {
        "label": 1,
        "text": "dios quién me iba a decir que iba a acabar obsesa perdía con el lore del league of legends jsjjsjks ((no lo voy a jugar, lo prometo)"
    },
    {
        "label": 1,
        "text": "How can arcane be such a peak work of fiction but league of legends be so shit 😭"
    },
    {
        "label": 1,
        "text": "I am elevated, rotating an elaborate palace in my mind. And what are you doing? League of Legends? Typical....."
    },
    {
        "label": 1,
        "text": "i've been hearing about arcane a lot lately, but i haven't watched, is it worth?\nsorry, i'm scared of league of legends, for obvious reasons"
    },
    {
        "label": 1,
        "text": "Also for some reason a lot of people who do very good rendering work and have very professional and coveted styles (usually hyperrealism even in furry) have obscenely bad opinions (like actual bigotry) and get away with murder p much just cause they can paint like a League of Legends splash screen"
    },
    {
        "label": 1,
        "text": "🎭 SKINS - LEAGUE OF LEGENDS\n\n#Arcane - Parte II do Evento \n\n🖼 SPLASHART:\n~ Professor Heimerdinger\n~ Ekko Batalha Final\n~ Warwick Vander\n~ Viktor Salvador de Arcane \n\n #LeagueOfLegends #Warwick #Heimerdinger #Viktor #Ekko"
    },
    {
        "label": 1,
        "text": "#Arcane #Arcaneseason2spoilers not spoilers but I'll tag it anyway just in case for ppl who are not familiarized with the runeterran version of #Viktor \n\nSaw some time ago an artist (wish I remembered the name) who drew viktor and #jinx being friends and I need it in my life.\nFT a bit of #jayvik too"
    },
    {
        "label": 1,
        "text": "i will proudly NEVER watch arcane\nLeague of Legends. Not even once."
    },
    {
        "label": 1,
        "text": "League of legends fans are dumb part 2\n\nOne is currently arguing with me that Sylas league of legends being written like a terrorist is a good writing. Then I check his tweets on Palestine and ofc he thinks Israel is justified in their violence against Palestine lmfao."
    },
    {
        "label": 1,
        "text": "League of Legends has revealed Viktor’s new splash arts for his upcoming ASU to align him with Arcane’s redesign.\n\nHis title has been changed from The Machine Herald to Herald of the Arcane."
    },
    {
        "label": 1,
        "text": "Alright I'm going back to league of legends once I get back. I can't wait to play as Warwick again."
    },
    {
        "label": 1,
        "text": "League of legends for 12 years on and off. It's like a toxic relationship 😅"
    },
    {
        "label": 1,
        "text": "As someone who hates league of legends but loved arcane i say do it anyways! They can be enjoyed seperately!"
    },
    {
        "label": 1,
        "text": "Is arcane good?? I’ve never been a big league of legends fan so I never looked into it hHh"
    },
    {
        "label": 1,
        "text": "Eu vou CHORAR"
    },
    {
        "label": 1,
        "text": "League of Legends is literally a virus and so is every game that uses Vanguard"
    },
    {
        "label": 1,
        "text": "Me: haha i feel bad for all these suckers deciding to play league of legends because of Arcane. i'll never go back.\nThe internet: hey mel merdarda might be in league in 2025\"\nMe, putting on a clown nose:"
    },
    {
        "label": 1,
        "text": "Akali - League of Legends\n\nModel: @ryanreoscg.bsky.social"
    },
    {
        "label": 1,
        "text": "Kocham Arcane wy nie rozumiecie, mnie zwykle nie obchodzą geje w fikcji, ale tutaj?? I jeszcze do tego canon lesbijki?? Dzięki ci league of legends lol"
    },
    {
        "label": 1,
        "text": "GIRLLLLLLLLLLLLL HES SO PRETTY IVE GOTTA GO BACK TO WAVING MY CREDIT CARD AT LEAGUE OF LEGENDS"
    },
    {
        "label": 1,
        "text": "✧ Arcane | League Of Legends \n\n» Confira as novas splash art para o Viktor."
    },
    {
        "label": 1,
        "text": "Like. This is my little baby as you can tell."
    },
    {
        "label": 1,
        "text": "✧ Arcane | League Of Legends \n\n» Confira a Splash art para:\n\n• Professor Heimerdinger\n• Last Stand Ekko\n• Vander Warwick"
    },
    {
        "label": 1,
        "text": "✧ Arcane | League Of Legends  \n\n» Confira a Splash art para Viktor o Salvador."
    },
    {
        "label": 1,
        "text": "Feels like there is literally no communication between the design teams for Arcane itself and the League of Legends skins, they just make some random stuff for League of Legends and slap the name \"Arcane\" onto it"
    },
    {
        "label": 1,
        "text": "I'm so tired of the \"nooo don't play League of Legends!\" shit. If people are curious about it following Arcane, let them try - you don't know if they'll enjoy it. \n\nThis game has a huge & consistent playerbase, including me. It's cool. I want more people to play so I have more friends to play with."
    },
    {
        "label": 1,
        "text": "Voy a decir League of legends, por diferenciarme del resto"
    },
    {
        "label": 1,
        "text": "#promosky time! anybody have similar interests 🤔\n\n▪️baldurs gate 3\n🔹arcane \n▪️league of legends (unfortunately)\n🔹final fantasy\n▪️animal crossing\n🔹tattoos/piercings\n▪️alt music (bmth, mcr, sleep token, soad, etc.)\n🔹magic the gathering\n▪️reading (romantasy, horror, sci-fi, etc.)\n🔹politics/political theory"
    },
    {
        "label": 1,
        "text": "Most sane league of legends player"
    },
    {
        "label": 1,
        "text": "In a dark place (playing League of Legends)"
    },
    {
        "label": 1,
        "text": "Recent Holostars Streams\n\nTenma's SF6 🦔💨\nJurard & Octavio's Tagalog Liar's Bar 🦖♾️\nOga's Cat Encyclopedia 🐃\nAru-san's SF6 🍕\nAstel's League Of Legends 🎭"
    },
    {
        "label": 1,
        "text": "it was the most relatable thing a House member did since AOC played league of legends honestly"
    },
    {
        "label": 1,
        "text": "arcane|league of legends"
    },
    {
        "label": 1,
        "text": "My latest lore deep dive is League of Legends lore because of Arcane. I almost want to play LoL again, ALMOST!"
    },
    {
        "label": 1,
        "text": "alguém pode me instruir como eu contato a prefeitura pra denunciar entulho? minha amiga está falando sobre league of legends no grupo"
    },
    {
        "label": 1,
        "text": "There is a Viktor reference for any League of Legends / Arcane fans. Whether it makes any sense is another question I am not prepared to answer."
    },
    {
        "label": 1,
        "text": "My favorite champs that I play on League of Legends are Kayle, Katarina, Zyra, Aphelios, Kayn, Sion, Poppy, and Yone 😊"
    },
    {
        "label": 1,
        "text": "I miss him already :("
    },
    {
        "label": 1,
        "text": "Aww I love that piece. ❤️\n\nIt's honestly been forever since I played league of legends. What season is it on now?"
    },
    {
        "label": 1,
        "text": "good morning. i will never play league of legends"
    },
    {
        "label": 1,
        "text": "when I want to be verbally abused I just play league of legends 😮‍💨"
    },
    {
        "label": 1,
        "text": "Deactivated my twitter and I’m looking for mutuals~ If you like the following, follow me and I’ll follow back:\n\nAnime\nLeague of Legends \nArcane\nK-pop\nSHINee\nNormani \nNCT \nEXO\nAteez \nAespa \nPalia \nStreaming\nVideo games\nArt"
    },
    {
        "label": 1,
        "text": "✧ Viktor | #LeagueOfLegends  \n\n» Confira o modelo atualizado de Viktor, destacando seu novo design em League of Legends!"
    },
    {
        "label": 1,
        "text": "I don't care if there's \"hot lesbian sex\"\n\nI am not watching a League of Legends show"
    },
    {
        "label": 1,
        "text": "I’m Guy and these are a few of my favorite things in no particular order\n\n🎮Final Fantasy\n🎮League of legends \n🎮Rainbow 6 Siege\n🎮Baldurs Gate 3\n🎮🎬Horror\n🎮RPGs\n🎤Singing\n❤️Spending time with my girlfriend \n🎨Mini painting\n🐶Dogs\n🎸Sleep Token\n\nHelp me meet some new people!\n\n#promosky"
    },
    {
        "label": 1,
        "text": "Je peux pas en choisir qu'un. (Yubel c'est Master duel et Duel Links ça compte.)"
    },
    {
        "label": 1,
        "text": "Daddy sorry daddy sorry daddy sorry da—"
    },
    {
        "label": 1,
        "text": "nya (wip)"
    },
    {
        "label": 1,
        "text": "im tempted to watch arcane because it looks so beautiful but it then feels like im giving in to all my exes who were obsessed with league of legends and i cant do that"
    },
    {
        "label": 1,
        "text": "So for me Arcane S2 was better than S1, which is not something that happens so often in tv shows. Story based on character relationships, beautiful animation and music. \nBeing loosely based on League didn't get in the way."
    },
    {
        "label": 1,
        "text": "virus named league of legends..."
    },
    {
        "label": 1,
        "text": ""
    },
    {
        "label": 1,
        "text": "🎮 13 videogames by Regen 🎮\n\n🛹 Tony Hawk Pro Skater 4\n🌴 GTA Vice City\n⚔️ Imperivm III\n🏛️ Zeus Señor del Olimpo\n⚓ Assassin's Creed IV Black Flag\n💛 The Simpsons Hit & Run\n🚗 Gran Turismo 4\n🥊 Tekken 5\n⚽ Fifa 14\n🤠 Gun\n💀 League of Legends\n🪖 Call of Duty: Ghosts\n✨ Sacred"
    },
    {
        "label": 1,
        "text": "☁️ Welcome to Safi's Streaming Schedule! ☁️\n7PM EST  |  4PM PST\n\nWhat's in store:\n⌢•⌢•⌢⬥⌢•⌢•⌢\n🚦 Cyberpunk: Doing side quests\n👥 Sims 4: Not so berry challenge: Mint Gen\n🪄 League of Legends: Chill time while we int\n⌣•⌣•⌣⬥⌣•⌣•⌣"
    },
    {
        "label": 1,
        "text": "Great news! Arcane may be over, but a new League of Legends show is already a year into development! Showrunner Christian Linke says"
    },
    {
        "label": 1,
        "text": "League of Legends Nendoroid No.2678 Jinx (Arcane Ver.) up for preorder at BBTS ($61.99) https://buff.ly/40ZhbId \n\nCD Japan (~$34.74) https://buff.ly/3ZyyvTr \namiami $46.16 https://buff.ly/3ZoYFrq \nHLJ $55.54 https://buff.ly/3CWEgkA"
    },
    {
        "label": 1,
        "text": "Pre-Order: League of Legends Nendoroid No.2678 Jinx (Arcane Ver.) $61.99 via Big Bad Toy Store. ow.ly/nQt350UfR08"
    },
    {
        "label": 1,
        "text": "mother #Mel #Arcane"
    },
    {
        "label": 1,
        "text": "[Amazon] Livro League of Legends: Reinos de Runeterra (Capa Dura)\n\n1️⃣ Em Inglês (Capa Dura)\n👉 https://jogobara.to/oFS91\n• R$ 17,34 à vista\n• Frete Grátis Prime\n\n2️⃣ Em Português (Capa Comum)\n👉 https://jogobara.to/dhC6q\n• R$ 39,90 à vista\n• Frete Grátis Prime"
    },
    {
        "label": 1,
        "text": "Why are all of the League of Legends Worlds songs such bangers? IMO Worlds songs are the best things Riot have done for LoLEsports. \n\n2014 Warriors? 🔥\n2017 Legends Never Die? 🔥\n2018 Rise? 🔥\n2023 GODS? 🔥\n2024 Heavy is the Crown? 🔥"
    },
    {
        "label": 1,
        "text": "Still thinking about this; I'm also extremely salty that my 10+ years of playing league of legends made me privy to so many easter eggs........... on the one hand man there's a lot more going on when you know the Whole Lore™️, on the other hand I played league of legends for 10+ years"
    },
    {
        "label": 1,
        "text": "Unfortunately I did play League of Legends with a friend recently"
    },
    {
        "label": 1,
        "text": "Names are nuts. ParamountPlus is an asshole but he absolutely shreds the League of Legends ladder, Roku's anime recaps are better than the real thing, and Mubi is a bit TOO kawaii but gives me ASMR-crinkle-tingles like you would NOT believe."
    },
    {
        "label": 1,
        "text": "why did mine end up being league of legends 😭"
    },
    {
        "label": 1,
        "text": "Glinda : Paracelsus, you will have to collect the most famous protagonists of these fairytales and help them to reach immortality. A huge threat is coming and we need the best team to defeat it.\n\nParacelsus : I will my lady. I will form a league… a league of legends."
    },
    {
        "label": 1,
        "text": ""
    },
    {
        "label": 1,
        "text": "hey nathan! i think you’d enjoy-\n\nif you could please consult the charts /j (check alt)"
    },
    {
        "label": 1,
        "text": "league of legends being censored is really funny"
    },
    {
        "label": 1,
        "text": "2/8 Humble Beginnings in League of Legends\n\nPokimane started like many of us—grinding in League of Legends. With a simple setup, she streamed her passion, and slowly, her fun personality began drawing in viewers. #StartSmall"
    },
    {
        "label": 1,
        "text": "I think League of Legends is so tome consuming.  I play their card  game Legends of Runeterra and hyped for 2XKO coming very soon!"
    },
    {
        "label": 1,
        "text": "my last 3 tiktok videos about wanting to get into league of legends getting semi-popular and people wanting to watch me stream… azza streamer era incoming"
    },
    {
        "label": 1,
        "text": "mt dificil ser literalmente Lux league of legends"
    },
    {
        "label": 1,
        "text": "El League of Legends es un juego que se encuentra en un proceso de cambios constantes para que as� no se pueda producir un estancamiento y que resulte atractivo para los jugadores."
    },
    {
        "label": 1,
        "text": "Arcane makes league of legends seem like the forbidden apple, except when you bite into it there's asbestos hidden inside."
    },
    {
        "label": 1,
        "text": "muito difícil ser literalmente Morgana league of legends"
    },
    {
        "label": 1,
        "text": "It's infuriatingly good.\n\nI walked in knowing approximately zero about League of Legends. I still found it to be among the best shows of my lifetime. If anything, prior knowledge of the game is a detriment."
    },
    {
        "label": 1,
        "text": "Arcane was so good it made me play league of legends again"
    },
    {
        "label": 1,
        "text": "Com Arcane concluída, Riot anuncia mais três séries de League of Legends para o futuro"
    },
    {
        "label": 1,
        "text": "Arcane: League of Legends just ended on Netflix, only 2 seasons ✨️"
    },
    {
        "label": 1,
        "text": "Hello Diamond V 😼 I just ranked up on Arena of Valor after a few weeks. Being a League of Legends player gives you a huge advantage. Do you call it #RoV or #ArenaofValor ? I discovered the game when I was in Thailand and they call it RoV there 🥳 🇹🇭"
    },
    {
        "label": 1,
        "text": "your honour, league of legends"
    },
    {
        "label": 1,
        "text": "This is also to say if anyone out there is coincidentally playing League of Legends and isn't very good at it, I could noodle around."
    },
    {
        "label": 1,
        "text": "Man arcane is about to make me relapse into playing league of legends again. I'm 6 years sober maaaan don't do this to meeeee!\n\nI don't wanna listen to imagine dragons!"
    },
    {
        "label": 1,
        "text": "it can infiltrate my life as much as it wants, ill never play league of legends, I'm not THAT mentally ill n self hating\n\nthe only league player I've ever known was my super toxic ex and I shoulda taken that as a bigger red flag at the time tbh"
    },
    {
        "label": 1,
        "text": "Lo de llevarme el portátil a clase a lo mejor no ha sido la mejor idea, me están mirando con ojitos"
    },
    {
        "label": 1,
        "text": "It's been sad because for the past decade or so the trailers to league of legends have made me think about the game and then I find out more about the playerbase and I'm okay.  I'm glad they just made an actual series and stopped teasing me with trailers."
    },
    {
        "label": 1,
        "text": "Good morning! Never recommend that I watch a show based on League of Legends! WOW that’s so insane of you! ♥️"
    },
    {
        "label": 1,
        "text": "league of legends 2990\nView this article\n\n#hentaivideo #rule34video #video #hentai #rule34 #nsfw"
    },
    {
        "label": 1,
        "text": "Finished watching Arcane season 2.....there are some new skins needed in League of Legends STAT!"
    },
    {
        "label": 1,
        "text": "Streaming the not so bad game\nLive with League of Legends!\n🔴#StormLive\nwww.twitch.tv/arkm_jun"
    },
    {
        "label": 1,
        "text": "Not much of a yapper, however I'll be sure to post more when I get my passion going. As someone who spent way too long covering pigs and League of Legends, (not synonymously funnily enough) it will be nice to spend my time on a hobby with some guaranteed happiness and gratification. 😊"
    },
    {
        "label": 1,
        "text": "I am an old League of Legends player (started playing in 2012, and still playing almost everyday!) and a Jinx enjoyer, so that show was just the perfect thing to me!"
    },
    {
        "label": 1,
        "text": "💥 ¿Sabes todo sobre Noxus en League of Legends? ¿Te has quedado con ganas después de #Arcane?\n\nOrigen, política, campeones y curiosidades de este poderoso imperio.\n\n¡Descubre su historia completa aquí!\n\n▶️ youtu.be/2FTEjhT0Vpw"
    },
    {
        "label": 1,
        "text": "looking for moots ! ᵕ̈ (mdni) \n\n✶ league of legends\n✶ ggs\n✶ comics\n✶ women\n✶ elder scrolls\n\nlunecakes.straw.page\n\n♡ / ↻    ifb\n#promosky"
    },
    {
        "label": 1,
        "text": "youtu.be/a8yfXRIXQ3Q?...\n\nThe road to the big league starts here! My journey from the lower reaches of motorsport to the glitz and glamour of F1 starts here in Grid Legends (PS5) \n\nDrop a like on the video and sub to the channel while you’re there!"
    },
    {
        "label": 1,
        "text": "I think it is, at its core, a show for the average aged league of legends player. Which is like ages 13-25 I'm assuming. So it's a show mostly made for a teen audience that explores darker topics, albeit very gently and in a not that complex package."
    },
    {
        "label": 1,
        "text": "me and my male wife comfort character"
    },
    {
        "label": 1,
        "text": "4) Mon Plaisir Coupable Vidéoludique\n\nPromis je prends des douches.\n\nLa commu est néfaste, la boîte est affreuse mais j'y joue depuis 15 ans avec de longues pauses et franchement, quand je joue avec des potes je m'amuse vraiment."
    },
    {
        "label": 1,
        "text": "The implications that #Arcane will have on League’s lore are going to be super interesting, but having spoken to Riot ahead of the Season 1 reveal, I think that, overall, we’re set to see a better League of Legends as a result.\n\nwww.pcgamesn.com/league-of-le..."
    },
    {
        "label": 1,
        "text": "I finished part 2 of Arcane: League of Legends yesterday. I have episodes 7, 8 & 9 to go. Holy crap is this a fantastic show. The animation, the tension, the drama and the story. Everything is top tier! I can't wait to finish this series. #arcaneleagueoflegends #netflix"
    },
    {
        "label": 1,
        "text": "16. fall\n17. baseball\n18. rat\n19. Katowice\n20. Korean\n21. Caravan Palace - Dramophone\n22. Deep Purple - Hush\n23. Guckkastan - Vitriol\n24. Dynasty Warriors 2\n25. League of Legends\n26. Guckkastan 2019\n27. The Essential (w. Albert Camus)\n28. Alien Romulus\n29. Dog"
    },
    {
        "label": 1,
        "text": "Looking for mutuals!\n\nBe friends with me if you love:\n📸Photography\n✍🏼Writing\n📚Reader\n🥁Music (AJR, TØP, Nat Lefkoff ect.)\n🏴‍☠️Anime (Dan da Dan, Tokyo Ghoul, One piece ect.)\n🎮Gaming (Webfishing, COD, Valo, willing to teach me league of legends 👀)\n(Yes I am watching arcane)"
    },
    {
        "label": 1,
        "text": "Arcane is making me wanna play League of Legends\n\n💀"
    },
    {
        "label": 1,
        "text": "league of legends é tão tosco que me da azia logar naquele jogo\nSó tem animal essa hora..."
    },
    {
        "label": 1,
        "text": "LA INVASIÓN NOXIANA SE EXTIENDE POR RUNATERRA DURANTE LA PRIMERA TEMPORADA DE LEAGUE OF LEGENDS\n\n@riotgameslatam.bsky.social | #LoL \n\nsomosgaming.com/la-invasion-..."
    },
    {
        "label": 1,
        "text": "Cuando comienzas a jugar al League of legends\n\nFuera bromas, es tan buena como la primera temporada? Todavía no me lo vi"
    },
    {
        "label": 1,
        "text": "While Arcane has torn up the game's lore, it may just have saved League of Legends #Arcane  #LeagueOfLegends \n\nwww.pcgamesn.com/league-of-le..."
    },
    {
        "label": 1,
        "text": "me when folks complain that riot would just suddenly jettison an entire design, background, story, and theme of a league of legends character"
    },
    {
        "label": 1,
        "text": "Arcane's conclusion has sparked renewed interest in League of Legends lore, paving the way for a thematic seasonal model in 2025. This shift aims to integrate gameplay with rich storytelling, potentially revitalizing the game's narrative depth. #LeagueOfLegends #Arcane\nRead more>>"
    },
    {
        "label": 1,
        "text": "Everyone is loving Arcane, and friends are playing League of Legends. Do I come out of retirement and play League again?"
    },
    {
        "label": 1,
        "text": "god handicapping me by giving me a smaller dating pool, making me an insufferable yapper and then topping it off with a league of legends fixation"
    },
    {
        "label": 1,
        "text": "Looking for moots :3\n#promosky\n\n🗑 League of Legends\n🎮 Dark and Darker\n🎮 Rocket League\n🎮 Deadlock\n🎮 Stardew Valley\n🎮 Fortnite\n💻 PC Gaming\n🖥 Parks and Recreation\n🖥 The Good Place\n🖥 Bojack Horseman\n🖥 Community\n🖥 Dandadan\n🖥 Full Metal Alchemist\n✨️ Femboy Fashion\n🪡 Tattoos\n📓 Poetry\n🧀 Rats\n🎨 Art"
    },
    {
        "label": 1,
        "text": "Sports are kinda like League of Legends and Rick and Morty anything by Blizzard. The base product is pretty rad it's the company/fanbase that turnes people away"
    },
    {
        "label": 1,
        "text": "As a prior League of Legends lore person that got really jaded from all the changes over the years...\n\nArcane Season 2 is phenomenal and visually stunning. Legitimately very good and highly recommend to anyone that is even a bit invested in the world of Runeterra. \n\nIncredible experience."
    },
    {
        "label": 1,
        "text": "Am honing in on the cult leader era - so tired from tending to his followers that he needs help with his own needs. I feel like there's post-canon potential too, though it's hard to articulate and define knowing next to nothing about the broader League of Legends universe."
    },
    {
        "label": 1,
        "text": "Binch when we playing league of legends."
    },
    {
        "label": 1,
        "text": "should have figured south korea was full of incels when you remember how popular league of legends is over there"
    },
    {
        "label": 1,
        "text": "I knew it was gunna be a mistake to reload league of Legends.... but i wanted to Vi so badly after Arcane S2"
    },
    {
        "label": 1,
        "text": "15 years after launch, League of Legends is getting a new queue: Swiftplay.\n\nThis will replace Quickplay in select territories, and provides a faster-paced, more relaxed variant of regular League.\n\nhttps://freetoplayer.com/league-of-legends/swiftplay/"
    },
    {
        "label": 1,
        "text": "【 league of legends】 มือใหม่หัดหัวร้อน\n TIME : 20:00 GMT+7         \nทางขึ้นเขา : youtube.com/live/QFsjwMs...\nGeneral #EijiiSpend\nLiveTag #EijiiLive\nTalkTag #Eijiiiiii\nMeme Tag #EijiiMeme\nFanArt Tag #EijiiArtt"
    },
    {
        "label": 1,
        "text": "Arcane was so good. I fell in love with the characters and want more, but I don’t know if I have the mental stamina to try and learn League of Legends 😂 I’m playing Teamfight Tactics, cause at least that’s simple, but I don’t know if I could learn LoL."
    },
    {
        "label": 1,
        "text": "🔴Going live!!\n\nthis is not a cry for help...... i am not making horrible life choices...........\n\n#KaiIsLIVE #VTubers #ENVtubers"
    },
    {
        "label": 1,
        "text": "Hi All! My name is Sara and I'm illustrator and aspiring indie comics creator. I love color, flow, and stories about kickass ladies in science fiction and fantasy settings. \n\nPs. Thank you AlbaBG for this opportunity to post. I adore your art and grog the frog!"
    },
    {
        "label": 1,
        "text": "Vi não ver uma arte na parede de todos os companheiros mortos no final e dizer \"They are a League of Legends\" foi outra grande decepção de Arcane."
    },
    {
        "label": 1,
        "text": "The thing about being a journalist for so long is you become aware of the tricks, I'm pretty sure I'm immune to advertising. \n\nAnyway, I've reinstalled League of Legends for the first time in years. I'm sure the fact I just finished a complete watch of Arcane is a pure coincidence."
    },
    {
        "label": 1,
        "text": "aconteceu de novo, devido a arcane o ytb começou a me recomendar shorts de league of legends (o jogo)  e agora tem uns mano falando lingua esquisita na minha timeline"
    },
    {
        "label": 1,
        "text": "Arcane: League of Legends.\n\nSo good."
    },
    {
        "label": 1,
        "text": "A próxima série de League of Legends já está em desenvolvimento há cerca de um ano www.otakupt.com/anime/league..."
    },
    {
        "label": 1,
        "text": "Arcane has been canon for 3 years and you can still log on to League of Legends and listen to Vi yap about how much she likes police brutality"
    },
    {
        "label": 1,
        "text": "Just played a match as support in which I watched the Jinx I was laning with have the awareness of a fruitfly and we lost in 20 minutes\n\nI hate League of Legends"
    },
    {
        "label": 1,
        "text": "You play league of legends 8h a day. I play two games of mobile legends bang bang per week. We are not the same."
    },
    {
        "label": 1,
        "text": "Where is Valorant and League of Legends on the list?"
    },
    {
        "label": 1,
        "text": "Arcane League of Legends Season 2 soundtrack is an absolute banger top to bottom"
    },
    {
        "label": 1,
        "text": "really makes you think how league of legends itself has like 3 lesbian couples at least and only like 1 gay couple that still exists"
    },
    {
        "label": 1,
        "text": "Sona - League of Legends #lol #sona #leagueoflegends #ai #aiart #aiartcommunity #ai #stablediffusion #forge #phonewallpaper #waifu #photography"
    },
    {
        "label": 1,
        "text": "Je vais profiter de se nouvelle élan avec BlueSky. Ducoup je vais essayer de partager quelque création :\n\nJ'ai fais quelque FunCard du jeu Flesh&Blood à l'effigie de LoL car je trouve que les deux univers on pas mal de points commun #Fleshandblood #leagueoflegends #Arcane #FunCard"
    },
    {
        "label": 1,
        "text": "C'est dans l'ère du temps, j'ai un peu le sens de l'actualité, je parle de League of Legends, un peu d'Arcane, et surtout de pourquoi ça me perturbe autant que je puisse adorer et haïr League of Legends en même temps.\npoke @psychanar.bsky.social"
    },
    {
        "label": 1,
        "text": "Becoming so #Normiepilled I have done nothing but play League of Legends and Call of Duty this past week"
    },
    {
        "label": 1,
        "text": "new mutuals would be great pls \n#promosky \n\n🦋 genshin impact \n🦋 arcane \n🦋 league of legends\n🦋 overwatch\n🦋 real housewives \n🦋 bleach\n🦋 jujutsu kaisen\n🦋 my hero academia \n🦋 demonslayer\n🦋 drag race\n🦋 horror\n🦋 gay shit"
    },
    {
        "label": 1,
        "text": "I don't understand how a show based on League of Legends can be so good. How?\n\nIs it just bags of infinite money and letting talented people make something cool? How was this made?\n\nI'd love to watch a documentary on what appened here."
    },
    {
        "label": 1,
        "text": "🗼 Otra de las novedades que se vienen al League of Legends en 2025 es a las TORRES de NEXO.\n\nA partir de la siguiente temporada, y dentro de ciertas timers, dichas torretas PODRÁN REAPARECER.\n\n¡¿Qué os parece este cambio?!"
    },
    {
        "label": 1,
        "text": "25.  It was League of Legends"
    },
    {
        "label": 1,
        "text": "i fear i am re-entering league of legends brainrot"
    },
    {
        "label": 1,
        "text": "I don't think League of Legends is a bad game. It's just the community that is so weirdly toxic about it, I don't get it\n\nI played vs ai beginner bots on wildrift and someone got really mad we didn't have a good team composition. You have to be THROWING to lose beginner bots"
    },
    {
        "label": 1,
        "text": "feels like my east asian curse whenever im intertwined with league of legends"
    },
    {
        "label": 1,
        "text": "just ordered a bunch of arcane merch eowww i love league of legends"
    },
    {
        "label": 1,
        "text": "Oh wow! \n\nI don't play League Of Legends so i didn't know the character, but looking at it , i can definitely see why you made that assumption!"
    },
    {
        "label": 1,
        "text": "Yep, for sure...everything about it...I was sceptical going into it, as I had little interest in League of Legends (sorry to the fans)...but was simply blown away by literally everything about the series...to the point where I might even take a second look at the IP, if only to get a bit of a fix."
    },
    {
        "label": 1,
        "text": "Bit of a stretch, but the hair + the crystal motif of the background is giving Taric energy from League of Legends"
    },
    {
        "label": 1,
        "text": "can you imagine seeing league of legends katarina du couteau and thinking yeah, that’s a straight woman"
    },
    {
        "label": 1,
        "text": "From Netflix’s popular animated series “Arcane”, based on League of Legends, comes a #Nendoroid action figure of Jinx as she appears in the show!\n\nAvailable to preorder now, Jinx is estimated to land End November 2025 - hobbyfigures.co.uk/products/arc...\n\n#arcane #jinx #leagueoflegends #nendoroid"
    },
    {
        "label": 1,
        "text": "Miracles do happen overnight sometimes! \n\nYou always do spectacular pieces.\nThese are some of my traditional ink works \nI also do pencils and digital art."
    },
    {
        "label": 1,
        "text": "yone league of legends is so gender"
    },
    {
        "label": 1,
        "text": "Looking for moots :)\n\n❀ overwatch \n❀ vinyl records \n❀ league of legends \n❀ literature \n❀ history \n❀ fantasy \n❀ sci-fi  \n❀ hiking \n❀ jazz\n❀ folk\n❀ soul \n❀ electronic \n❀ indie/indie rock \n❀ neuro spice 🌶️\n\n♡ appreciated! \n#promosky"
    },
    {
        "label": 1,
        "text": "A Invasão Noxiana Chega a Runeterra: Detalhes da Primeira Temporada de League of Legends #atakhan #leagueoflegends #mecânicasdejogo #mododetreinomultijogador #noxus #passedebatalha #ranqueadas #temporada #trailer #viktor https://alternativanerd.com.br/games/a-invasao-noxiana-chega-a-runeterra-detal…"
    },
    {
        "label": 1,
        "text": "The lore of league of legends is so rich that i ended up reading all the bios and short stories 😱 the potential for MORE comics, more animation and MMORPG is honestly insane - sometimes i feel like it's such a waste"
    },
    {
        "label": 1,
        "text": "i hate league of legends there are so many good ships i love so much but the thought of the source game gives me headaches"
    },
    {
        "label": 1,
        "text": "i want to cosplay from league of legends (not arcane) but idk who :( maybe ezreal ?"
    },
    {
        "label": 1,
        "text": "La invasión noxiana llegará a League of Legends"
    },
    {
        "label": 1,
        "text": "gay sex? in MY league of legends? it’s more likely than you thi"
    },
    {
        "label": 1,
        "text": "I can't believe they made me like League of Legends content\n#arcane #pixelart\nStill won't play the game though"
    },
    {
        "label": 1,
        "text": "I got stuck on a tutorial in 2014 in League of Legends on old laptop. Uninstalled."
    },
    {
        "label": 1,
        "text": "just don't make the mistake of downloading and playing League of Legends XD"
    },
    {
        "label": 1,
        "text": "So on my League of Legends new player journey I get to unlock an Assassin today. Have to choose between Ekko, Fizz and Talon. I'll also likely hit level 10 and finish those rewards up.\n\nFizz would usually be my go to, but Ekko is so fucking COOL!\n\n#videogames"
    },
    {
        "label": 1,
        "text": "✸🎮 13 Video Games by \nCarmensita 🎮✸\n\n🌙Sea of stars\n🌿 The Last of Us\n🦋 Life Is Strange\n🌾 Stardew Valley\n👯🏻‍♀️ Just Dance\n💎 Minecraft\n🧍🏻 The Sims 3\n🗽 GTAV Roleplay\n🧢 The Walking Dead\n🗡 Assassin's Creed II\n👫It Takes Two\n🟥 Silent Hill 2\n💀League of Legends"
    },
    {
        "label": 1,
        "text": "Vamos a probar con esto, a ver qué tal!! #promosky\n\n👾Kingdom hearts\n👾Resident evil\n👾League of Legends\n👾Valorant\n👾Strinova\n\n🕹️PlayStation 1 y 2\n🕹️PC\n🕹️Cualquier consola retro\n\n🎞️Anime (Jojos, Your lie on april, etc...)\n🎞️Todo tipo de cine\n🎞️The walking dead\n\n🎁Me gusta mucho hablar y los MD son abiertos 🫶"
    },
    {
        "label": 1,
        "text": "🚨 C'est officiel ! 🚨 Alors que la saison 2 d'Arcane débarque sur Netflix. Fortiche Production prépare déjà une nouvelle série autour de League of Legends ! 👀🔥 Annoncé sur le live du streamer Necrit94, ce projet explorera les histoires d'autres champions du jeu. Qui a hâte ? 🙌 #Arcane #LOL #Netflix"
    },
    {
        "label": 1,
        "text": "Octokuro - Lingerie Vi 1\nView this article\n\n#hentaicosplay #hentai #cosplay #nsfw #big-breasts #japanese #large-tattoo #league-of-legends #leagueoflegends #lingerie #lol #octokuro #piercing #transparent-clothing #vi"
    },
    {
        "label": 1,
        "text": "I wanna watch arcane so bad bc,,,, vi,,,,,,,, but like i am so emotional and I just feel like it’s gonna ruin my life and i cannot let league of legends do that to me"
    },
    {
        "label": 1,
        "text": "Do I need to know anything about League of Legends beforehand to watch Arcane?"
    },
    {
        "label": 1,
        "text": "we are playing tekken but we might talk about league of legends. #Tekken8 #leagueOfLegends #PHvtuber #Vtuber www.twitch.tv/andro_dionevt"
    },
    {
        "label": 1,
        "text": "Woah its amazing how good I am skipping spoilers, the only thing I had to do was pretending that I don't watch that serie based on the popular game League of Legends"
    },
    {
        "label": 1,
        "text": "I know Riot Games would never actually do anything of substance to improve the quality of the gameplay in League of Legends because being like Valve and banning thousands of troll account. They'd lose at least a third of their player base after all, by my god is NA solo que a dreadful experience"
    },
    {
        "label": 1,
        "text": "Futanari Jinx from League of Legends\n#futa #futanari #jinx #leagueoflegends #arcane #arcaneseason2 #fanart #NSFW #nude #nudity #league"
    },
    {
        "label": 1,
        "text": "Shoutout to my original league of legends crew, Lipiken, Cwl, AJ and HakunaMatits."
    },
    {
        "label": 1,
        "text": "my greatest feat in league of legends was being proudly called a turret diver by one of my best friends. the high i got off of that led to me doing that the entire session"
    },
    {
        "label": 1,
        "text": "When I think of “show based off of popular battle game league of legends” the first thing that comes to my mind is not steamy lesbian sex scenes"
    },
    {
        "label": 1,
        "text": "real WHOA HEY moment in the league of legends show"
    },
    {
        "label": 1,
        "text": "Here’s some good news on a Tuesday. Riot has confirmed that with the excellent #Arcane finishing, they are currently developing, not one, not two, but THREE shows based on League of Legends! One of which has been in development for over a year already.\n\nGame on. 🧪"
    },
    {
        "label": 1,
        "text": "Love how this looks together :)\n\n#LeagueOfLegends #Arcane"
    },
    {
        "label": 1,
        "text": "Which League Of Legends Characters Die In Netflix’s Arcane Season 2?\n\nNetflix Heavy spoilers ahead for the \"Arcane\" season 2 finale. After just two seasons, the groundbreaking, award-winning, critically acclaimed \"Arcane\" has come to an end. The animated series made a huge impact when it premiered…"
    },
    {
        "label": 1,
        "text": "Trick question!! It's all of them!!\n\n(But my favorites, personally,,,);\n- Any of the Baldurs Gate 3 girls\n- Melinoë (Hades 2)\n- Madeline/Badeline (Celeste)\n- Link & Zelda (BotW/TotK especially)\n- Basically any of the Stardew Valley bachelors/bachelorettes\n- Most of the gals from League of Legends"
    },
    {
        "label": 1,
        "text": "This art was made as a gift to my commissioner. I like that the character is embedded in the ent of the League of Legends and is located on Noxus. Against the background, I tried to depict what the character is associated with\n\n#LeagueofLegends #fanart #Arcane #commission #digitalart #art"
    },
    {
        "label": 1,
        "text": "Arcane è una serie animata ambientata nell'universo di League of Legends, nota per la sua narrazione profonda, l'animazione di alta qualità e la complessità dei personaggi; tema centrale di Arcane è il ciclo di violenza e le scelte che i personaggi devono affrontare.\n\nyoutu.be/5i28xdS-JNQ"
    },
    {
        "label": 1,
        "text": "Yo digo que en la próxima temporada que hagan de League of Legends todos van a odiar a:\n\n- Boram Darkwil (el líder de Noxus, antes de que Swain haga su movimiento)\n- Singed\n- El general Du Couteau.\n- Jhin (en verdad creo que todos los van a amar, yo ya lo hago desde hace años)"
    },
    {
        "label": 1,
        "text": "league of legends has been calling to me for days"
    },
    {
        "label": 1,
        "text": "La diferencia entre el Viktor del LoL y el de Arcane era tan grande que Riot Games ha anunciado una actualización para el campeón en el jue\n\nhttps://www.3djuegos.com/juegos/league-of-legends/noticias/diferencia-viktor-lol-arcane-era-grande-que-riot-games-ha-anunciado-actualizacion-para-campeon-juego"
    },
    {
        "label": 1,
        "text": "les gens qui tweetent sur TFT, league of legends, genshin impact commentez svp j’ai besoin de follow des gens ma TL parle de trucs qui m’intéressent pas 😔😔"
    },
    {
        "label": 1,
        "text": "so smart of me to start playing league of legends again when my finals are coming"
    },
    {
        "label": 1,
        "text": "\"In all universes, in all possibilities, only you can show me this.\" \n🥺🥺🥺❤️❤️❤️\n😭😭😭😭😭\n\nYeah uh huh mr straight league of legends player of COURSE they're platonic friends🙄\nIdc about authoric intent, death of the author mfer. If they wanted jayvik to be perceived platonic they should written that better"
    },
    {
        "label": 1,
        "text": "Arcane was such a show and I can't recommend it enough to get into it, and the argument \"Ew League of Legends stinky\" is not an excuse, it never was \n\nAlso there's a wolf dude"
    },
    {
        "label": 1,
        "text": "I did a bad thing.\n\nI installed League of Legends. And won my very first ARAM. And had fun."
    },
    {
        "label": 1,
        "text": "Muss eh schon den ganzen Morgen an das \"Golden Wasteland\", \"Eden\" und den König aus Sky denken. Und dann seh ich gerade, dass das eine Lied aus #Arcane \"Wasteland\" heißt. Und sag mal meinem übertrieben müdem Gehirn, dass es das ganze nicht in einen Topf werfen soll..."
    },
    {
        "label": 1,
        "text": "ไม่เคยเล่น League of Legends เพื่งรู้มันแยกเซิพกันหรอ😂\nแต่เว็บเขียวนิรวมกันเป็นหนึ่ง"
    },
    {
        "label": 1,
        "text": "everyone is posting about what they like but i like a lot of things to the point i can't even remember most of them while counting.\n\nso instead, here's a list of what i HATE:\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-league of legends"
    },
    {
        "label": 1,
        "text": "fun fact: We know from her dialogue in the actual game league of legends that, when it comes to men, twinks are in fact her type (Ezreal, Hwei, ect.). And when it comes to women, its ones who are equally capable of absolutely crushing someone with their bare hands lol (Illaoi and Shyvana)"
    },
    {
        "label": 1,
        "text": "interest check: like if u would hop on a server for oomfs!\ntalk about stuff like:\n• zoology\n• art\n• writing\n• ocs\n• warriors\n• genshin impact\n• flightrising\n• d&d\n• pokemon\n• minecraft\n• castlevania\n• league of legends\n• queer media\nand more! i have a cobblemon mc server i'm fiddling with"
    },
    {
        "label": 1,
        "text": "League of Legends related combustion"
    },
    {
        "label": 1,
        "text": "I'll be fr, I kinda wasn't vibing until the \"wolf\" line/scene, which is like half the EP, but the second half, everything right after that scene, my god, they did it, greatest show ever."
    },
    {
        "label": 1,
        "text": "Stoked to be an artist for @callofthefirststar.bsky.social ! I can't wait to show off my Tahm Kench design. Thanks to the mod team for all their hard work bringing these fantastic artists together 💜 #firststarartist"
    },
    {
        "label": 1,
        "text": "my favorite part of arcane was that one scene where jinx said \"so, what? we some kinda league of legends?\""
    },
    {
        "label": 1,
        "text": "Ahri - League of Legends\n#anime #aiart\n\ntrynectar.ai?utm_source=a..."
    },
    {
        "label": 1,
        "text": "idk why a part of me still hoped that Lux would appear when I've never read League of Legends lore when watching Arcane lmao"
    },
    {
        "label": 1,
        "text": "and the same goes for League of Legends, but it's actually a lil better because the gameplay remains more or less the same; rediscovering \"old\" games with your friends is always fun! Hell yeah we're creating new memories together!"
    },
    {
        "label": 1,
        "text": "Xie \"Jinjiao\"Jin-Shan officially retired from League of Legends after 10 years"
    },
    {
        "label": 1,
        "text": "Arcane has by far some of the BEST animations I have seen in a long time, so good that its coming to their game League of Legends.\n\nArcane's Mel Medarda is coming to League of Legends in 2025 as a playable character\nLoL is also getting a new jungle boss, Atakhan, along with a Noxus-themed map."
    },
    {
        "label": 1,
        "text": "Amiga nunca nem cheguei perto de League of Legends kkkkkkk Mas eu gostei da série mesmo assim, achei que deu pra curtir a história mesmo sem saber nada"
    },
    {
        "label": 1,
        "text": "Let's try this trend🩵 \n\nBook 📚 \nPokémon 🐭 \nHollow knight 🖤 \nRock music 🎶 \nZelda 👑 \nE-Sports \nLeague of legends 🕹️\nOverwatch 🤡\nF1 🚗 \nTravel 🧳 \nMountain 🏔️ \nSunset 🌇 \nBasketball 🏀\n\n#promosky"
    },
    {
        "label": 1,
        "text": "Oh, yeah I'm watching that animated league of legends thing\n\nyoutu.be/UOxkGD8qRB4?..."
    },
    {
        "label": 1,
        "text": "I watched a clip of Arcane the show about league of legends and I thought \"wow I'm glad I don't know a single thing about this media franchise\""
    },
    {
        "label": 1,
        "text": "#Arcane season 2 finale was predictably a bit underwhelming. Trying to cram everything in just two seasons was just silly.\n\nThey should've flushed out the Black Rose storyline and given us at least one more season.\n\nSeason 1 was phenomenal tho', and will go down as one of the G.O.A.T.s.\n#TV #Netflix"
    },
    {
        "label": 1,
        "text": "Twitch League Of Legends wasn't allowed in Arcane because he would have been the hottest character and they are cowards."
    },
    {
        "label": 1,
        "text": "Briar league of legends\n#leagueoflegends #briar #nsfw #smegma #pussy #rule34 #nsfwart #digitalart #Digitalartist #lol"
    },
    {
        "label": 1,
        "text": "La serie de Arcane ha conseguido lo que parecía imposible: 15 años después ha logrado que por fin le dé una oportunidad a\n\nhttps://www.3djuegos.com/juegos/league-of-legends/noticias/serie-arcane-ha-conseguido-que-parecia-imposible-15-anos-despues-ha-logrado-que-fin-le-oportunidad-a-league-of-legends"
    },
    {
        "label": 1,
        "text": "Favourite games:\n\n💛 Kingdom Hearts series\n🗡️ Skyrim\n🗡️ Final Fantasy series\n🗡️Dragon Age\n💙 League of Legends\n👻 Phasmophobia\n🪄 Hogwarts Legacy\n💥 Borderlands\n🚀 Elite Dangerous\n🚀 No Man’s Sky\n🚀 Starfield\n🐀 Jak n Daxter\n🔧 Ratchet and Clank\n🐲 Spyro\n❤️ Crash Bandicoot\n\nAnd many more x\n\n#promosky #gaymer"
    },
    {
        "label": 1,
        "text": "Reposting to add the tag...\n\nHi Im Lexi! I like:\n\n🩵 Weed\n🩷 Pokémon\n🤍 League of Legends\n🩷 Apex Legends\n🩵 Fellow trans women\n🩷 Nature\n🤍 Animals\n🩷 Minecraft\n🩵 Food\n\nI also speak English, fairly fluent Spanish, and I'm slowly learning Japanese.\n\n#promosky"
    },
    {
        "label": 1,
        "text": "genuinely forgot how stupid league of legends fans are.\n\n\"this thing i didnt like about the game made me quit the game\"\n\"wow thats pathetic you need to go outside. ive played for 13 years and idc\"\n\"i stopped playing a video game youve been playing for 13 years straight yet i need to go outside??\""
    },
    {
        "label": 1,
        "text": "this really is a league of legends they assembled"
    },
    {
        "label": 1,
        "text": "Unlike any other game I've played in my life - League of Legends is an awful dogshit experience most of the time & you question why you play it. Riot does nothing to police poor behavior so you're stuck with just the worst degenerates on the planet"
    },
    {
        "label": 1,
        "text": "Well at least you weren't playing league of legends."
    },
    {
        "label": 1,
        "text": "Okay but real talk, League of Legends is not as horrible as people like to think of it at all.\n\nArcane is a love letter to League of Legends fans, so can Arcane only people just be normal about it? \n\nWithout League of Legends there would have never been Arcane."
    },
    {
        "label": 1,
        "text": "just finished watching arcane wowowowo i sure love league of legends :)"
    },
    {
        "label": 1,
        "text": "hot steamy lesbian sex league of legends version (arcane is pretty good)"
    },
    {
        "label": 1,
        "text": "Okay so it's a League of Legends show, that's why is so popular lol I might fuck around and check it out tonight or tomorrow morning"
    },
    {
        "label": 1,
        "text": "It's great. Personally I don't play League of Legends, but it made me really tempted to try it again just bc the story and art is cool."
    },
    {
        "label": 1,
        "text": "chrissy constanza!! <3 atc also made a song for league of legends too (legends never die) but this is my fav song by them open.spotify.com/track/7xqWmi..."
    },
    {
        "label": 1,
        "text": "how i came to be surprised by the final episode of arcane being essentially a game of league of legends is beyond me"
    },
    {
        "label": 1,
        "text": "I’m gonna do the unforgivable and download league of legends"
    },
    {
        "label": 1,
        "text": "become a league of legends player after watching arcane or continue playing fortnite"
    },
    {
        "label": 1,
        "text": "see if u had told me months ago that my hardest cry of the year would be because of some league of legends show...... i wouldve laughed in ur face"
    },
    {
        "label": 1,
        "text": "do i need to play League of Legends to watch Arcane?"
    },
    {
        "label": 1,
        "text": "‘Paranoia’ by Heartsteel (virtual League of Legends band), it’s the song that introduced me to K’sante/caused my downfall.\n😭"
    },
    {
        "label": 1,
        "text": "Your mental health is important. Uninstall League of Legends today. #mentalhealth #leagueoflegends"
    },
    {
        "label": 1,
        "text": "I will not be tricked into speaking in any way positively of “League of Legends” also."
    },
    {
        "label": 1,
        "text": "I’m playing league of legends again and idk how but I’m sure this is @jyuki.bsky.social fault."
    },
    {
        "label": 1,
        "text": "i am normal about sejuani league of legends"
    },
    {
        "label": 1,
        "text": "Can I tell you a secret? love league of legends, it’s my addiction. I quit because I was so addicted 😳"
    },
    {
        "label": 1,
        "text": "tis true they aren’t intended for league of legends the game i was also considering this but saying “league” is a lot easier"
    },
    {
        "label": 1,
        "text": "I am sorry but other than actually catching up on my gacha games, I just want to play League of Legends\n\nPlease give me a good game in the Runeterra world that is not lol, i am going to die"
    },
    {
        "label": 1,
        "text": "「 LEAGUE OF LEGENDS 」\n\nOH GOD SHE'S BACK AND SHE'S PLAYING MORE LEAGUE!!!!\n\ni'm sickge but we do some solo ranked + bp grind!!! GIMME PRESTIGE CAIT GRAHHHHH\n\nLIVE ON THE PURPLE SITE RIGHT NOW!! COME HANG OUT!!\n\n#solivedesu #phvtuber #vtuber"
    },
    {
        "label": 1,
        "text": "Ranked League of legends IS gross.\nOfficially doing pay to play…$10 for champs in insane roles. I’d say it’s a joke but it happened. LOL.\n\nThank you so much @lazywing67.bsky.social @naomieecat.bsky.social & @khaishinryu.vtubers.social for the raids! 🥺🫶🏻🐰✨🤍\nWe raided to @skyrindrifter.bsky.social"
    },
    {
        "label": 1,
        "text": "Eu ia ver até saber que tem a ver com League of legends, aí eu perdi o interesse. Não quero ter que entender nada previamente pra conseguir entender uma série"
    },
    {
        "label": 1,
        "text": "＜今日の人気のゲーム情報＞\n『League of Legends』来年開幕の新シーズンでは「時限付き復活バフ」が獲得可能に。ネクサスタワー復活やブーツのアップグレードなど、新要素一挙お披露目【AUTOMATON】\n#LoL\n#YouTube\n#人気ゲームニュース\nhttps://game-news.tokyo/news/744766"
    },
    {
        "label": 1,
        "text": "okay fine ill play league of legends again"
    },
    {
        "label": 1,
        "text": "started watching the league of legends show because my friends won't leave me ALONE about it\n\nverdict: yeah it's cool.\n\nnot fixated on it like most of you all are but it's good.\n\nnow please leave me alone about it"
    },
    {
        "label": 1,
        "text": "So, the thing about League of Legends is EVERYTHING about it so phenomenal. If you just ignore the fact that there's a game called League of Legends."
    },
    {
        "label": 1,
        "text": "Nothing can beat the high of two dominant wins of League of Legends for the night. I won't be able to sleep tonight😬"
    },
    {
        "label": 1,
        "text": "I did not get sucked into playing League of Legends 💪 crisis averted"
    },
    {
        "label": 1,
        "text": "Gods, could you imagine.\n\nI love CaitVi, and this scene gave me life, but I don't wanna think of League of Legends (as a game) and sex in the same sentence. \n\nLeague players could drive me to celibacy (or murder)"
    },
    {
        "label": 1,
        "text": "thank you league of legends for bringing back stromae to us"
    },
    {
        "label": 1,
        "text": "League of Legends has sex now??? Sex update???"
    },
    {
        "label": 1,
        "text": "League of Legends Season Baru Awal 2025  Bawa Tema Noxus!"
    },
    {
        "label": 1,
        "text": "The third Jinx WIP (with earlier WIPs an OG pic)"
    },
    {
        "label": 1,
        "text": "i need someone who isn't easily impressed to tell me if arcane is good or just another bloated marvel-esque lore commercial for league of legends. i will not watch it either way, i just love to hear about the tea"
    },
    {
        "label": 1,
        "text": "Due diligence WHO????\n\n69 investors really gave this man $420.69 MILLION DOLLARS bc they were impressed he couldn’t stop playing League of Legends long enough for a zoom call?!?"
    },
    {
        "label": 1,
        "text": "League of legends is shredding years off my life.\n\nIma q up again tho"
    },
    {
        "label": 1,
        "text": "Maybe I am the league of legends these are the two most insane games I've had in a while."
    },
    {
        "label": 1,
        "text": "Even though it not a masterpiece levels of the first season, Arcane: League of Legends is still awesome in it final season thanks to the animation, visuals, characters, voice acting, action scenes, world building, and the emotional stakes. It a must watch season that ends on a bittersweet note. 9/10"
    },
    {
        "label": 1,
        "text": "Yes. Coming from a person who doesn't even like playing League of Legends"
    },
    {
        "label": 1,
        "text": "I have condemned myself to hell"
    },
    {
        "label": 1,
        "text": "It's fun league of legends fortnite overwatch war craft 3 evercore heroes"
    },
    {
        "label": 1,
        "text": "I’ve lost many friends to the disease known as league of legends. They’re entrapped by the allure of charismatic characters and tall tales of esports glory. Yet the result is all the same: late nights at the desk, grinding away in jungle for hours, Sisyphus pushing a boulder of his own volition"
    },
    {
        "label": 1,
        "text": "literally anything that's not a league of legends commercial"
    },
    {
        "label": 1,
        "text": "Gwen (League Of Legends)"
    },
    {
        "label": 1,
        "text": "My League of Legends experience has been my friends asking \"what role do you want to play\" and me responding with \"i dont care I'm the fish man om nom nom nom\""
    },
    {
        "label": 1,
        "text": "i cant bring myself to like hate this show its compelling enough but man it sure was a show by the league of legends people meant to cater to twitter lesbians"
    },
    {
        "label": 1,
        "text": "I don't care if you aren't into animation. I don't care if League of Legends isn't your thing.\n\nIf you're a system with fictives, and ESPECIALLY if any of those fictives are \"villains\" in their source:\n\nWatch Arcane. S2E7 is the important one."
    },
    {
        "label": 1,
        "text": "My younger sibling just finished Arcane. \n\nShe asked me about League of Legends and wanting to try it out."
    },
    {
        "label": 1,
        "text": "Okay!  We got an extra day, but we may have to do another some time this week due to not being able to stream on Saturday.  But until then, let's get to League of Legends Ranking with No raging!\nwww.twitch.tv/merable08"
    },
    {
        "label": 1,
        "text": "i think i'm at the point where i can calmly and safely say\n\nDead By Daylight is more toxic than League of Legends"
    },
    {
        "label": 1,
        "text": "they can’t make me watch the league of legends show"
    },
    {
        "label": 1,
        "text": "Arcane is so good. It's wild that it is based on League of Legends. Love the world so much and it'd be so cool to see an AP set in the world/tone of the show."
    },
    {
        "label": 1,
        "text": "We had a super fun stream tonight playing 100% OJ and League of Legends!!! 😤👏\n\nWe raided off to @cinnafaun.bsky.social who is live right now playing Slay the Princess!! 💖\n\nGO SHOW SOME LOVE\n\ntwitch.tv/cinnafaun\n\n#envtuber #vtuber"
    },
    {
        "label": 1,
        "text": "O Viktor é o único downgrade claro, mas ele não teve muito tempo de tela ainda.\nNem parece que esse cara é pra ser o Transhumanista-mor, e ele também não dá namedrop da Gloriosa Revolução nenhuma vez na série.\nEspero que ele melhore na segunda temporada."
    },
    {
        "label": 1,
        "text": "Mild take Riot should remove Draven from league of legends from my games."
    },
    {
        "label": 1,
        "text": "Lol it did not inspire you to play League of legends?"
    },
    {
        "label": 1,
        "text": "em abstinência de arcane pensando em jogar league of legends"
    },
    {
        "label": 1,
        "text": "3. I have a black cat named Jinx (named after the League of Legends/Arcane character!)"
    },
    {
        "label": 1,
        "text": "I want all the algorithms to hear me. JUST CAUSE I LIKE ARCANE DONT MEAN I GIVE TWO FUCKS ABOUT LEAGUE OF LEGENDS."
    },
    {
        "label": 1,
        "text": "I watch Arcane but will never have the urge to play league of legends.\n\nI have my own toxic addiction called Godzilla Battle Line"
    },
    {
        "label": 1,
        "text": "discovering league of legends after watching arcane and wym my dommy mommyguard sevika isn’t a playable character?? devastated"
    },
    {
        "label": 1,
        "text": "so what are we. some kind of league of legends"
    },
    {
        "label": 1,
        "text": "arcane has no right being this good being based on league of legends"
    },
    {
        "label": 1,
        "text": "Ok i just tried out Supervive. A mishmash of a battleroyale and League of Legends. (Made by devs that made LoL) seemed neat enough but there is no solo option and I hate playing with randos. If anyone ends up trying it let me know if you need a partner or another squad member"
    },
    {
        "label": 1,
        "text": "League of legends discord? 🤷‍♂️"
    },
    {
        "label": 1,
        "text": "little guy commissions\n\nvgen.co/fathoneybee/"
    },
    {
        "label": 1,
        "text": "...and you are one of the few people who understands why the League of Legends character \"Heimerdinger\" makes me giggle."
    },
    {
        "label": 1,
        "text": "Four cosplays to get to know me!\n\nHolo - Spice and wolf\nAhri - League of legends\nMayuri - Steins gate\nAeirth - FF7\n\nAnimal ears and sad girl stories.. Yeah that about sums me up.\n\nwhich one is your favorite?"
    },
    {
        "label": 1,
        "text": "League of legends. Very cozy."
    },
    {
        "label": 1,
        "text": "Happy Monday! Looking for mutuals \n\n- League of Legends 🎮\n- Arcane 🌉\n- Stardew 🧑🏻‍🌾\n- Animal Crossing 🐾\n- Tiny Glade 🏰\n- Wicked 🧚\n- Last Airbender ⬇️\n- Retro/Pixelart 👾\n- Hobby shops 🪅\n- Thrifting 🥾\n- Teddy Swims 🏊🏼‍♂️\n- The Weeknd 🚨 \n\n#promosky\n\nAlso check out Pixadom, cos I’m obsessed! pixadom.com\n🅿️ℹ️❎🅰️🆔🅾️Ⓜ️"
    },
    {
        "label": 1,
        "text": "WE ARE STILL LIVE RIGHT NOW!! After 100% OJ we switched over to League of Legends with @thesandysandile.bsky.social!! 😤🔥\n\nCOME JOIN THE FUN!!\n\ntwitch.tv/chordsyvt\n\n#envtuber #vtuber"
    },
    {
        "label": 1,
        "text": "League until the other game downloads  |  Playing League of Legends!\nwww.twitch.tv/ladysaga_"
    },
    {
        "label": 1,
        "text": "That's some super awesome growth! Congrats!\n\nHere's the creations I've got!"
    },
    {
        "label": 1,
        "text": "Nendoroid League of Legends Jinx up for preorder on CD Japan (~$34.74) https://buff.ly/3ZyyvTr \namiami $46.16 https://buff.ly/3ZoYFrq \nHLJ $55.54 https://buff.ly/3CWEgkA"
    },
    {
        "label": 1,
        "text": "i hate that it’s a genuine statement that i’d rather play league of legends than have sex"
    },
    {
        "label": 1,
        "text": "Hot tip if he’s ignoring you for league of legends, become league of legends"
    },
    {
        "label": 1,
        "text": "Finished Arcane.\n\nMan, what a show.... I'm still not playing no League of Legends. \n\nBut still, everyone from the storytellers, animators, composers, and actors. \n\nThey all did an amazing job.\n\n#Arcane"
    },
    {
        "label": 1,
        "text": "arcane thoughts: true to league of legends fashion, the worst thing about it is actually turning out to be the fanbase lmaoooo"
    },
    {
        "label": 1,
        "text": "I'm sorry to say this... but I re-download league of legends after watching arcane 🥲\n#arcane #LOL #leagueoflegends"
    },
    {
        "label": 1,
        "text": "Stream Schedule November 25th-December 1st\n☆.｡.:*.｡.:*☆\nMonday: Study some math with me & Valorant afterwards ^^\nWednesday: Dead By Daylight & League of Legends ^^ \nThursday: Valorant & DBD ^^\n☆.｡.:*.｡.:*☆\n#LGBTQ #vtuber #pngtuber #twitch #TwitchAffliate #ENVtuber #ENpngtuber #dbd #LoL #Valorant"
    },
    {
        "label": 1,
        "text": "Hello my friends!\nI'm streaming right now if anyone wants to stop by and chill. :) I play valorant and league of legends mostly!\n\ntwitch.tv/handsome_egirl"
    },
    {
        "label": 1,
        "text": "League of Legends Arcane Season II - Jinx Nendoroid! Coming Soon!\n#LoL #Arcane #Jinx"
    },
    {
        "label": 1,
        "text": "Never imagined SVU would have a character rant about hating League of Legends"
    },
    {
        "label": 1,
        "text": "posting this here because why not. here's a list of my favorite league champs. both as characters and to play.\ni like egirls and weird old men."
    },
    {
        "label": 1,
        "text": "Help the group chat is peer pressuring each other into playing league of legends"
    },
    {
        "label": 1,
        "text": "i’ve loved jinx as a character since she came out in league of legends in 2013 but now that i’ve finally finished arcane i love her as a character even more ahhhh im so glad they picked her to be in such an amazing show"
    },
    {
        "label": 1,
        "text": "I know absolutely nothing about league of legends but I’ll do it for the gays"
    },
    {
        "label": 1,
        "text": "no matter how good arcane is do not play league of legends"
    },
    {
        "label": 1,
        "text": "Had a great Baldur's Gate 3 stream with @lazywing67.bsky.social and @jellykitsh.bsky.social ! Lots of chaos and demise. Had our first TPK, more scuffing, got a mirror mad at us, it was great!\n\nRaided out to @skylite6.bsky.social who was playing some good old League of Legends ranked! She's so cute~"
    },
    {
        "label": 1,
        "text": "this may be the one and only thing that pushes me into downloading league of legends wtf"
    },
    {
        "label": 1,
        "text": "me googling after clocking that ship:\n“what is a league of legends”"
    },
    {
        "label": 1,
        "text": "Someone save me, I'm updating League of Legends"
    },
    {
        "label": 1,
        "text": "ᅠ\n\nᅠᅠᅠ─── 𝓓iary of a bruxa 、 📖\n\nᅠᅠ𝗼𝗽𝗶𝗻𝗶𝗼𝗻𝘀. thoughts. ideas.\nᅠᅠdaily life. study. 𝘄𝗼𝗿𝗸𝗮𝗵𝗼𝗹𝗶𝗰. \nᅠᅠfavorite artists. music. art.\nᅠᅠeveryday situations. rage.\nᅠᅠ𝗲𝗺𝗼𝘁𝗶𝗼𝗻𝘀. passions. wicca.\nᅠᅠwithout politic. 𝗸𝗼𝗿𝗿𝗮. n/sfw.\nᅠᅠdark souls. 𝘵wrp. 𝗧𝗧𝗥𝗣𝗚.\nᅠᅠ𝐚𝐧𝐢𝐦𝐚𝐭𝐞𝐝 𝐬𝐞𝐫𝐢𝐞𝐬. 𝐋𝐀𝐑𝐀 𝐂𝐑𝐎𝐅𝐓.\n\nᅠᅠᅠ── 𝓓ead dove. 𝕕𝕠 𝕟𝕠𝕥 𝕖𝕒𝕥.\nᅠᅠᅠ"
    },
    {
        "label": 1,
        "text": "guys do i watch arcane? i know nothing about it or league of legends but jinx looks too cool"
    },
    {
        "label": 1,
        "text": "i'd tease a league of legends related drawing but\nit would probably be more fun chewing on glass then trying to draw them"
    },
    {
        "label": 1,
        "text": "i dont care how much lesbian porn is in it im not watching league of legends anime with soundtrack by imagine dragons"
    },
    {
        "label": 1,
        "text": "I don’t need sex I have league of legends"
    },
    {
        "label": 1,
        "text": "Vc pode até não gostar de League of Legends, tudo bem. Mas não dá pra falar mal de Arcane. Puta série foda. A animação é absolutamente linda! E ainda confirmou 110% o ship Vi e Cait ♥️"
    },
    {
        "label": 1,
        "text": "League of legends splash art study . #art #drawing #digitalart #league"
    },
    {
        "label": 1,
        "text": "90% of the people who watch arcane hate league of legends 😭"
    },
    {
        "label": 1,
        "text": "Great choices! \nMine is somewhat similar, a lot of the picks I’ve not had the chance to play myself but I’ve watched streamers play parts of them.\nHoping Metaphor or FF7R get GOTY and not the DLC!"
    },
    {
        "label": 1,
        "text": "The League of Legends Special"
    },
    {
        "label": 1,
        "text": "hate being insane over league of legends lore again. I thought I left the mines behind at 17. Oh the misery…"
    },
    {
        "label": 1,
        "text": "it's truly sinking in that the project i thought would only take a month...is going to take way longer 😂😂😂 i'm going to cope/procrastinate by immediately hopping in a league of legends game"
    },
    {
        "label": 1,
        "text": "Arcane: League of Legends has officially concluded. Season 2 now has a stellar Certified 100% Tomatometer, topped Netflix’s Global Top 10, and has proved to be a major critical success. It’s safe to say that the show has cemented itself as one of the greatest video game adaptations of all time."
    },
    {
        "label": 1,
        "text": "I need more friends on this app :3\n\nBaldur's Gate III \nOverwatch 2\nFortnite \nLeague of Legends\nValorant \nMarvel's Rival\nProject Zomboid \nLethal Company \nPhasmophobia\nLeft 4 Dead 2\nGuilty Gear -Strive-\nStardew Valley \nMinecraft \nTerraria \nRoblox\nFran Bow\nSoul Knight \nGTA V\nOur Life\nDDLC\n\n#promosky"
    },
    {
        "label": 1,
        "text": "forever cursing league of legends for having the most incredibly in-depth and jaw-dropping lore while simultaneously making me want to kill myself if i even think about playing it"
    },
    {
        "label": 1,
        "text": "quick, someone remind me that just because i love and miss arcane does not mean i need to try and play league of legends again"
    },
    {
        "label": 1,
        "text": "A MINHA NAMORADA QUER COLOCAR O NOME DA NOSSA FUTURA CRIANÇA DE UMA PERSONAGEM DE LOOOOL LEAGUE OF LEGENDS"
    },
    {
        "label": 1,
        "text": "League of legends had one of those asset OC builders for season 1"
    },
    {
        "label": 1,
        "text": "Made a quick icon for my husband so his account looks inhabited and not like a bot account.........\n\n[ #art #penguin #memedrawover #drawover ]"
    },
    {
        "label": 1,
        "text": "vi’s original in-game design has a tiny little tutu on one side. they nailed that gay ass hair on day 1 tho."
    },
    {
        "label": 1,
        "text": "I was reading up on the League of Legends Star Guardian lore, and WHAT THE FUCK DO YOU MEAN ZOE AND FIDDLESTICKS ARE DOOMED YURI IN THAT UNIVERSE!?"
    },
    {
        "label": 1,
        "text": "Wild Rift, the Mobile spinoff of League of Legends has games lasting from 10 to 20 minutes! That's my personal filler  😁"
    },
    {
        "label": 1,
        "text": "Despite everyone's belief and probably warnings i have decided to download league of legends"
    },
    {
        "label": 1,
        "text": "If all you did was watch the League of Legends cartoon (of which there's going to be more) rather than actually playing the game itself, I think you'll have an easier time getting functional again compared to actual LoL players.\n\nIf you do play LoL, well at least Arcane was a less stressful break."
    },
    {
        "label": 1,
        "text": "Only reason why I haven't seen it is because I don't even want to THINK about League of Legends lol"
    },
    {
        "label": 1,
        "text": "#Promosky\nJuegos:\nLegends of Runaterra \nLos Sims\nLeague of Legends\nAge of empires 2\nDino crisis\nCrash bandicoot \n\nAnime:\nNeon Genesis Evangelion\nDigimon\nSakura card captor\nGhost stories\n\nTodo esto entre muuchos más, pero son los que me vinieron a la mente rápido."
    },
    {
        "label": 1,
        "text": "TBH playing games makes me bored 😂 so I knew League of Legends for their music/ musical universe(?)."
    },
    {
        "label": 1,
        "text": "Jinx - Arcane / League Of Legends  #arcane #jinx #LeagueOfLegends #bdsm #art #sexy #lewd #hentai"
    },
    {
        "label": 1,
        "text": "I don't think Runeterra is a great name for the world of Arcane/League of Legends. It would be much better if they replaced the \"terra\" with a slightly more obscure synonym. Something like \"scape\" would be perfect."
    },
    {
        "label": 1,
        "text": "I just binge watched the entirety of season 2 of Arcane.\n\nI sobbed. Actively. Ugly tears. \nI’ve never watched anything so beautiful in my life.\n\nGod I hate league of legends"
    },
    {
        "label": 1,
        "text": "I wish I knew more about \"League of Legends\" so I'd know what \"Arcane\" was all about."
    },
    {
        "label": 1,
        "text": "older artworks\nHave a great Thanksgiving!"
    },
    {
        "label": 1,
        "text": "After watching Arcane I really really want to try out League of Legends but everyone keeps saying don't 🤔"
    },
    {
        "label": 1,
        "text": "Like a random tiktok video I watched a couple months ago once said \"everything surrounding league of legends, whether the books,comics,short stories, spin-off games, cinematics,music,shows, is amazing. Everything BUT the game itself.\""
    },
    {
        "label": 1,
        "text": "League of Legends 😬"
    },
    {
        "label": 1,
        "text": "Lux - League of Legends #lol #leagueoflegends #lux #ai #aiart #aiartcommunity #ai #stablediffusion #forge #phonewallpaper #waifu #photography"
    },
    {
        "label": 1,
        "text": "\"im sorry i just broke up with my boyfriend so i have no drive to play league of legends anymore\""
    },
    {
        "label": 1,
        "text": "esports is competitive video games! some popular esports are csgo, valorant, dota 2, league of legends, and rocket league"
    },
    {
        "label": 1,
        "text": "I downloaded league of legends Wild ride on my phone and have yet to play it actually because I’m scared"
    },
    {
        "label": 1,
        "text": "I have had a blood feud with League of Legends ever since some little turd who plays that abomination briefly stole my Discord in 2022"
    },
    {
        "label": 1,
        "text": "heavy on the league of legends i played it a while back and spent like 60 bucks within the first week of playing LOL"
    },
    {
        "label": 1,
        "text": "reading whatever league of legends version of miranda is while i flounce around in my maid outfit"
    },
    {
        "label": 1,
        "text": "league of legends.\nI play cod but casually, bops6 is a fuckin mashfest LOL"
    },
    {
        "label": 1,
        "text": "E gostei que eles colocaram o \"bracinho\" do Viktor no último episódio, achei que não iriam adaptar isso. Hehe!"
    },
    {
        "label": 1,
        "text": "Arcane so good it made me download League of Legends"
    },
    {
        "label": 1,
        "text": "15. Fav drink is tea!\n16. Fav season, summer!\n17. Fav sport? Well my ex was really into League of Legends so I've watched a fair bit of that.\n18. I think my Chinese zodiac was a rooster or something\n19. I'd love to visit Japan\n20. I only really speak English."
    },
    {
        "label": 1,
        "text": "Gaming: #promosky 🎮—-any mutuals?\n\n👾League of Legends\n👾Legend of Zelda\n👾Wild Rift\n👾Valorant\n👾Mario Kart\n\nNot much games I know. 😝"
    },
    {
        "label": 1,
        "text": "The worst part about having seen Arcane is that in spite of just how good the show is, I can never in good faith recommend people watch it because it's still League of Legends"
    },
    {
        "label": 1,
        "text": "Ruination is in the same sort of characters as Ruined King, same island area, and is a great story that I even went and got the special edition of. \n\nNEVER PLAY LEAGUE OF LEGENDS OG, IT'S A BAD PLACE\n\nCard game and autochess are fine tho XD"
    },
    {
        "label": 1,
        "text": "Franchise was the wrong word to use 🫠 I know League of Legends is the franchise question... the world created in Arcane just seems so distinct from the game that in my eyes it's its own unique, very special thing. I want to see so much more from the world of Runeterra."
    },
    {
        "label": 1,
        "text": "I came home from Vegas and all my friends are playing League of Legends again. Sucks"
    },
    {
        "label": 1,
        "text": "A combination of learning more about League of Legends lore along with heavy denial lead to the creation of this comic \n#Arcane  #ArcaneSeason2  #ArcaneSpoilers #comic"
    },
    {
        "label": 1,
        "text": "getting closer to the edge each day (the edge is playing league of legends)"
    },
    {
        "label": 1,
        "text": "force fed cait a cookie while they were playing league of legends"
    },
    {
        "label": 1,
        "text": "Arcane Season 2 Episode 7 - ในงาน Innovation Competition ดูเหมือนว่าทีม E-Sports จาก League of Legends จะมาเข้าร่วมด้วยครับ 🤣\n\n#กางเต็นท์ดูหนัง #Arcane #ArcaneSeason2"
    },
    {
        "label": 1,
        "text": "The crazy thing is i dont even go here (league of legends) but i still know the whole plot of arcane😔"
    },
    {
        "label": 1,
        "text": "why do so many rich people always fk kids? did no one tell them about hobbies? you could always play league of legends instead"
    },
    {
        "label": 1,
        "text": "Too many 😭😭 I was gonna get into dsmp and like current MCYT but just could NOT, I actually USED TO be an oLD vivziepop fan 😭😔 like pre show days when hazbin was a WEB COMIC, the list goes on. Voltron, league of legends (not arcane), WoW, and many more omg"
    },
    {
        "label": 1,
        "text": "they're eating pussy in league of legends now wtf"
    },
    {
        "label": 1,
        "text": "I am sad we have to bless league of legends for this, but arcane is a masterpiece"
    },
    {
        "label": 1,
        "text": "guys is this a safe space to say i've been addicted to league of legends for the past 10 years"
    },
    {
        "label": 1,
        "text": "NO BC IVE ALSO BEEN CONSUMED W ARCANE… but i chose to focus on Pokémon to cope so i don’t find myself playing league of legends 💔"
    },
    {
        "label": 1,
        "text": "WHAT THE FUCK WHY DOES LEAGUE OF LEGENDS HAVE GUNS"
    },
    {
        "label": 1,
        "text": "monday pf makes me want to install league of legends"
    },
    {
        "label": 1,
        "text": "www.twitch.tv/masayuki_vt living, we need to create a league, a league of legends"
    },
    {
        "label": 1,
        "text": "petição pra riot cancelar o league of legends pra continuar fazendo arcane"
    },
    {
        "label": 1,
        "text": "Bro there is no good reason to try and convince me to play League of Legends"
    },
    {
        "label": 1,
        "text": "Girl characters are cool!"
    },
    {
        "label": 1,
        "text": "I play league of legends only thank h"
    },
    {
        "label": 1,
        "text": "“𝐼’𝓂 𝑜𝓃 𝓉𝒽𝑒 𝒸𝒶𝓈𝑒.” 👮🏻‍♀️🧁\n—  \ncaitlyn sprite from league of legends ♡\n#pixelart #sprite #leagueoflegends #caitlyn"
    },
    {
        "label": 1,
        "text": "Lux - League of Legends #lol #leagueoflegends #lux #ai #aiart #aiartcommunity #ai #stablediffusion #forge #pantyhose #phonewallpaper #waifu #photography"
    },
    {
        "label": 1,
        "text": "It's League of Legends time tonight- happy to chat about the game or Arcane, or the Lore, whatever floats your boat!\n\ntwitch.tv/popeswiggins\n#LeagueOfLegends #Gaming #TwitchStreamer #FrutigerAero #Twitch #MOBA #Arcane #ChillVibes #SoloQueue #Ranked #VideoGames"
    },
    {
        "label": 1,
        "text": "『League of Legends』来年開幕の新シーズンでは「時限付き復活バフ」が獲得可能に。ネクサスタワー復活やブーツのアップグレードなど、新要素一挙お披露目\nautomaton-media.com/articles/new..."
    },
    {
        "label": 1,
        "text": "To be honest, for stuff like this, \"League\" could easily be replaced by \"Runeterra\", because whilst the game League of Legends itself might be questionable, at least the overall lore of Runeterra is considerably intriguing"
    },
    {
        "label": 1,
        "text": "Warwick (League of Legends, 2009)"
    },
    {
        "label": 1,
        "text": "Its also a video game! They're characters from the game League of Legends, a game I've played since like 2011 or 2012. Like I remember Jayce and Viktor being new champions in the game LOL"
    },
    {
        "label": 1,
        "text": "name a more iconic duo than League of Legends and everything other than the game itself being pretty good"
    },
    {
        "label": 1,
        "text": "Arcane devia terminar em um enorme cliffhanger, não ter nova temporada, e encerrar com um aviso \"Quer saber a continuação da história?, baixe o nosso jogo e faça ele você mesmo!\" E redirecionar pra um link pra instalar league of legends."
    },
    {
        "label": 1,
        "text": "I can not believe I am playing League of Legends again."
    },
    {
        "label": 1,
        "text": "NEW SHOW ALERT. Let's see what all this #arcane fuss is about :)\n\nMy Arcane: League of Legends 1x1 Reaction to \"Welcome to the Playground\" is up on YouTube now. #ArcaneSeason2 \n\nyoutu.be/mn4UPesmu2A?..."
    },
    {
        "label": 1,
        "text": "\"Oh wow, Vander you look like you've been through War, wicked...\"\n\n\"Jinx shut up, i need you to come join me in the league...of legends\""
    },
    {
        "label": 1,
        "text": "Bro I feel sadistic since I can relax playing League of Legends"
    },
    {
        "label": 1,
        "text": "VI from the hit series arcane league of legends??? What are you doing on bluesky???"
    },
    {
        "label": 1,
        "text": "\"amy what's the difference between the male gaze and the female gaze\"\n\nleague vi vs arcane vi"
    },
    {
        "label": 1,
        "text": "Since I got reminded of league, here's my top 3 favorite champions and the skins I own for them :D If anyone else play league and wants to share their champs and skins feel free to do so!"
    },
    {
        "label": 1,
        "text": "Watching arcane vs playing league of legends"
    },
    {
        "label": 1,
        "text": "Gonna play some league of Legends 😁 and chat on OF.\n\nNot like anybody asked, but yeah that's what I'm gonna do 😏"
    },
    {
        "label": 1,
        "text": "I very rarely engage in new media. With that out of the way, I'm rewatching all League of Legends Worlds Finals Opening Ceremonies for no reason."
    },
    {
        "label": 1,
        "text": "pov, im cleaning my room while in vc with my best friends who are streaming their league game"
    },
    {
        "label": 1,
        "text": "Time to go home and play League of Legends til my eyes bleed yet again, then read some relaxing dark fantasy for bed"
    },
    {
        "label": 1,
        "text": "🔴Live Now🔴playing League of Legends!\n\nThe grind is over...now we wait for the new skin reveal\n\n⛓️⤵️\nwww.twitch.tv/rikaersh"
    },
    {
        "label": 1,
        "text": "Sometimes I think about going back to playing league of legends but then I remember that I don’t like league of legends very much"
    },
    {
        "label": 1,
        "text": "What if I just play some league of legends"
    },
    {
        "label": 1,
        "text": "looking for moots 😊\n\n🌸 pokemon\n✨ xbox\n🌸 anime\n✨ yugioh\n🌸 league of legends\n✨ JRPGs\n🌸 Chinese food\n✨ money\n🌸 2D girls\n✨ weed\n\n♡/↻ appreciated!\n#promosky"
    },
    {
        "label": 1,
        "text": "Zaun's inventors! \n\nPartly inspired by League Viktor's short story, House on Emberflit Alley. Maybe Powder and Ekko would go and show off their various contraptions and get treats in return. I imagine in this timeline Viktor would eventually transform into his original League form."
    },
    {
        "label": 1,
        "text": "don't play league of legends"
    },
    {
        "label": 1,
        "text": "why are all of my \"friends\" telling me to not play league of legends"
    },
    {
        "label": 1,
        "text": "Would love to hear what y'all are thinking about all of today's League of Legends news! Team worked super hard on this, and personally so stoked for what's to come!\nwww.youtube.com/watch?v=3zx1..."
    },
    {
        "label": 1,
        "text": "So after finishing Arcane Season II… where in the world are we headed to next because I know NOTHING about League of Legends lore! Only some esports and their music/music videos but that’s it!"
    },
    {
        "label": 1,
        "text": "something something League of Legends something something"
    },
    {
        "label": 1,
        "text": "i love how arcane ended with vi saying \"we are finally a league...\" cait follows up \"... of legends\""
    },
    {
        "label": 1,
        "text": "First Atakhan, now the Deep keyword?? The Corpse of LoR is taking over league of legends"
    },
    {
        "label": 1,
        "text": "intro:\n\n🩷33\n🩷she/her\n🩷pansexual\n🩷love: lady gaga, ariana grande, taylor swift, chappell roan, WWE, SNSD & more\n🩷play: league of legends, dress to impress, team fight tactics\n\nbanner by: @reputaytionedit.swifties.social"
    },
    {
        "label": 1,
        "text": "y entonces jayce mira a la cámara y dice \"viktor, este realmente fue nuestro arcane (league of legends)\" y el público se levanta y aplaude"
    },
    {
        "label": 1,
        "text": "i don't care how good arcane is\ni'm not playing league of legends"
    },
    {
        "label": 1,
        "text": "now im gonna need Fortnite to do League of Legends so I can buy all the skins. not to mention the weapons & locations they can add 😩"
    },
    {
        "label": 1,
        "text": "I NEED TO KISS MEN AND PLAY LEAGUE OF LEGENDS AND EAT ONE BILLION CALORIES WORTH OF FRUIT FLAVORED CANDY AND JACK OFF AND HIT MYSELF IN THE HEAD WITH A FRYING PAN WHILE MY EYES BULGE OUT"
    },
    {
        "label": 1,
        "text": "adore him!!! He's fuzzy, reminds me vaguely of Gnar from league of legends and Stitch"
    },
    {
        "label": 1,
        "text": "Leona & Diana | League Of Legends"
    },
    {
        "label": 1,
        "text": "If you love arcane but refuse to play league of legends, I recommend downloading it just to play jinx fixes everything"
    },
    {
        "label": 1,
        "text": "I will never watch the league of legends show"
    },
    {
        "label": 1,
        "text": "Arcane's ending got me feeling so bummed out I'm thinking of getting a PC for League of Legends."
    },
    {
        "label": 1,
        "text": "[Dexerto]Massive LoL leak reveals Noxus-themed season & 2025 Arcane champion - Dexerto A huge League of Legends leak has revealed a Noxus season coming in 2025, complete with a new jungle boss and another Arcane champion."
    },
    {
        "label": 1,
        "text": "so is a game of league of legends narratively like a holy grail war kind of thing or what"
    },
    {
        "label": 1,
        "text": "My favorite part has to be when they all came together at the end and said “This is the league, the league of legends” and proceeded to have explosions in the background"
    },
    {
        "label": 1,
        "text": "ekko ekko ekko!!!!!!!!!!!!!!!! i leik him a lot!!!!!!!!!!!!!!!!!!!!\n\n#art #sketch #ekko #arcane #leagueoflegends #fanart"
    },
    {
        "label": 1,
        "text": "This is just Aurora League of Legends."
    },
    {
        "label": 1,
        "text": "It's time to play some LEAGUE OF LEGENDS\n\nPictured below, Me at the end of stream (hopefully)\n\nLIVE NOW: Link is in the comments!\n\n#vtuber #liveHearted #LeagueofLegends #Ranked"
    },
    {
        "label": 1,
        "text": "listening to league of legends music while i work is oddly helpful"
    },
    {
        "label": 1,
        "text": "More Lewd League of Legends Fanart but now of Volibear #nsfw"
    },
    {
        "label": 1,
        "text": "some people enjoy their free time and then there is me playing league of legends"
    },
    {
        "label": 1,
        "text": "first game back in over a month"
    },
    {
        "label": 1,
        "text": "Which League Of Legends Characters Die In Netflix's Arcane Season 2?: Arcane season 2 ends with the deaths of a whole bunch of characters from League of Legends. Let's run through them all, shall we? #LeagueOfLegends #Arcane #Netflix"
    },
    {
        "label": 1,
        "text": "It's time!\nWas the highly anticipated second season of Arcane a hit or a flop? Join Alex and Jon as they discuss the ins and outs of the conclusion to this animated adaptation of League of Legends!\n\n🔽Watch Here🔽\nyoutu.be/S-2LjKB93TU"
    },
    {
        "label": 1,
        "text": "played league of legends ONE TIME and i had the worst week ever chat don't listen to the arcane voices"
    },
    {
        "label": 1,
        "text": "I wrote something about Ekko and Jinx and them getting the future they deserve. \n\nTitle: better to be poorly accompanied than to be alone\nWord Count: 2.9k\nRating: G\n\narchiveofourown.org/works/60846805"
    },
    {
        "label": 1,
        "text": " No please god don't make me hyperfixate on league of legends"
    },
    {
        "label": 1,
        "text": "I am afraid League of Legends now has me in a choke hold"
    },
    {
        "label": 1,
        "text": "It's almost that time where I decorate my graduation cap and I'm currently contemplating combining League of Legends and a Mary Shelley quote. Maybe a Braum Poro and the quote.\n\nBut I'm also contemplating using LOTR for it instead. Like a little Hobbit hole door with a LOTR quote."
    },
    {
        "label": 1,
        "text": "𝐓𝐡𝐞 𝐛𝐨𝐲 𝐬𝐚𝐯𝐢𝐨𝐫 ⏱️\n\n#Arcane #Ekko"
    },
    {
        "label": 1,
        "text": "Immersive Introversion…\n\nKeeping with last weeks theme on immersive events and attractions, I just attended an event for the animated series Arcane, which is based on the game League of Legends. This event was hosted at the…\n\nhttps://shiftdownme.wordpress.com/2024/11/25/immersive-introversion/"
    },
    {
        "label": 1,
        "text": "also to my irls so sorry for arcaneposting so much but if i can tolerate lillis marauders era nd chlowan emo tweeting breakup era yall can bear w me through my league of legends lore lockdown"
    },
    {
        "label": 1,
        "text": "#Promosky\nHi☺️\n🎮\n-Diablo\n-League of legends\n-Backyard Baseball\n-Roller Coaster Tycoon\n-Football Manager\n-Bioshock\n-Elder Scrolls (Oblivion is GOAT)\n📺\n-Alien Franchise\n-Terminator\n-Arcane\n-Dexter\n-Snow Piercer\n-Sports (Football, Baseball, Darts)\n-Anime (Serial Experiments Lain, Hellsing, Angel Beats)"
    },
    {
        "label": 1,
        "text": "Arcane was so good that it's convinced me I'm finally not going to play League of Legends"
    },
    {
        "label": 1,
        "text": "I'm allergic to league of legends"
    },
    {
        "label": 1,
        "text": "My beloved discord server icon that Ive had since 2018 called the gwowious ewwowwution of Viktor drinking nescau"
    },
    {
        "label": 1,
        "text": "Need to find magic the gathering and league of legends mutuals/friends on here, idk how this works... are we doing hashtags???? \n#leagueoflegends\n#magicthegathering"
    },
    {
        "label": 1,
        "text": "Del final de Arcane me queda claro que, entonces, no es canon respecto al League of Legends.\n\nNi una actualización del lore. Es ajeno."
    },
    {
        "label": 1,
        "text": "Como obra eu achei linda demais, emocionante e me deu gosto de quero mais.\n\nComo mundo de league of legends eu acho q faltou algo...\nFicou meio em aberto algumas coisas e tem coisas que achei nada a ver com o game\n\nMas eu dou um 9.5 de nota final"
    },
    {
        "label": 1,
        "text": "yall I reinstalled League of Legends\nI fear I may never have a good relationship with that game for the rest of my days 😍🥰"
    },
    {
        "label": 1,
        "text": "can we have another canonical LoL gay pairing, because i need to see them kiss in 4k"
    },
    {
        "label": 1,
        "text": "Kindred...my fav champ... \n\n#kindred #kyleeart #lolsky"
    },
    {
        "label": 1,
        "text": "Meu bebê merece tudo de bom em todos os universos, inclusive naquele onde a única função dela era cuidar dos fogos de artifício e ela explodiu todos fora da hora só porque sim 🥹💕 \n\nJinx, Firecracker | League of Legends \n\n📸 Ton López | Cosplay Brasil\n\n[ #cosplay | #lolcosplay | #lunarnewyear]"
    },
    {
        "label": 1,
        "text": "Remember, League of Legends will NOT fill the Arcane shaped hole in your heart"
    },
    {
        "label": 1,
        "text": "📣NOUVELLE VIDEO📣\n\n#Arcane c'est fini ! Et quel banger ce fut ! On va en parler en review et j'ai hâte d'avoir vos opinions sur la série et vos attentes pour les nouvelles prods à venir dans l'univers de league of legends !\n\nyoutu.be/EahsReWTEBw"
    },
    {
        "label": 1,
        "text": "Wrote a short article about League of Legends for work.\nwww.cheatcc.com/articles/aft..."
    },
    {
        "label": 1,
        "text": "Karma from league of legends?"
    },
    {
        "label": 1,
        "text": "En fait, X c'est League Of Legends, alors qu'ici c'est plus Mario Party 🥳"
    },
    {
        "label": 1,
        "text": "pelo o que rapidamente pude ver, foi inspirado sim em um jogo, jogo de computador (league of legends)"
    },
    {
        "label": 1,
        "text": "I absolutely hope Swiftplay will be the saviour League of Legends needs to actually become a decent game again."
    },
    {
        "label": 1,
        "text": "I have so many emotions about Arcane that it broke my art block...\n-\n#Arcane #ArcaneSeason2 #ArcaneSpoilers"
    },
    {
        "label": 1,
        "text": "cw: #micro #footsky League of Legends\n\ntake a doodle i made for @adorkablecollin.bsky.social :3\nthey've been HELLA crushing on Heimerdinger so I doobled up a thing uwu"
    },
    {
        "label": 1,
        "text": "[Amazon] Livro League of Legends: Reinos de Runeterra (Capa Dura)\n\n👉 https://jogobara.to/dhC6q\n• R$ 39,90 à vista\n• Frete Grátis Prime\n\nLivro em capa dura, 256 páginas. Idioma: Português\n\nExperimente o Amazon Prime de graça por 30 dias: https://jogobara.to/90Q2N"
    },
    {
        "label": 1,
        "text": "Let's try anyway 😅\n\nPart I of II:\n\nStar Wars\nStar Wars - The Clone Wars\nStar Wars - Legends/EU\nStar Wars - The Bad Batch\nThe Locked Tomb\nArcane/League of Legends\nOur Flag Means Death\nGood Omens\nThe Sandman\nACOTAR/ACOMAF/ACOWAR\nThrone of Glass\nFrankenstein\nDracula"
    },
    {
        "label": 1,
        "text": "everybody give it up for leblanc for not having a single confirmed successful plan, scheme, or plot in any league of legends media ever for the 15th year running"
    },
    {
        "label": 1,
        "text": "Whimsi's Whacky Thanksgiving Schedule! 📆\n\nPlease note the time changes to the streams in pink! \n\nTuesday we'll be joining Iri as she navigates League of Legends for the first time! ( it's also her birthday! 🎉 )\n\nThen Saturday night we have an ENORMOUS 21-person collab playing Dale & Dawson! 🖨️📃"
    },
    {
        "label": 1,
        "text": "I check all those but League of Legends and LARP. Well technically LARP. I do medieval/ renaissance reenactment."
    },
    {
        "label": 1,
        "text": "I want to watch Arcane, but I don't want to provide any viewership to a league of legends property.\n\nBut it looks so good... But league of legends...\n\nBut hot lesbian drama... But stinky incel toxicity..."
    },
    {
        "label": 1,
        "text": "I'm helping my friend study League of Legends lore for a job she's shooting for (long story) and Garen, famously a basic bitch big sword himbo, has an absolutely legendary roast included in his wiki entry. 💀"
    },
    {
        "label": 1,
        "text": "Rarely does a sequel live up to its predecessor, yet Arcane: League of Legends Season Two not only meets but exceeds expectations. #ArcaneLeagueofLegends #EllaPurnell #HaileeSteinfeld #KatieLeung #KevinAlejandro\nwww.themovieblog.com/2024/11/arca..."
    },
    {
        "label": 1,
        "text": "Me having fun smashing Arcane dolls together with no knowledge whatsoever of the game. \n\nthe league of legends fandom drifting by my timeline **mad that characters are getting updates** \n\nSafe to say I will not be getting into the game."
    },
    {
        "label": 1,
        "text": "i will never forget the first time i played league of legends and my FIRST death my teammate told me to uninstall the game."
    },
    {
        "label": 1,
        "text": "Random thought, but I wonder how long it'll be before we get some kind of boutique League of Legends ttrpg. Like, you can't tell me with all the merchandising they're doing that they HAVENT had that discussion yet."
    },
    {
        "label": 1,
        "text": "“in all timelines in all possibilities only you couldve shown me this” is wedding vows worthy shit. however it is from a league of legends tv show"
    },
    {
        "label": 1,
        "text": "Life is wild as a League of Legends retiree"
    },
    {
        "label": 1,
        "text": "𝗖𝗵𝗮𝗿𝗮𝗰𝘁𝗲𝗿(𝘀): Ahri\n\n𝗦𝗲𝗿𝗶𝗲𝘀: League of Legends \n\n𝗔𝗿𝘁 𝗯𝘆: x.com/nuttycravat?..."
    },
    {
        "label": 1,
        "text": "Which League Of Legends Characters Die In Netflix's Arcane Season 2?"
    },
    {
        "label": 1,
        "text": "DRIP OR DROWN!? 💧 \nLeague of Legends Part 2! 🏆🏆 \n\nITCHING FOR MORE ARCANE!! \n\nyoutube.com/shorts/lJC6v...\n\nwww.tiktok.com/t/ZTYr2LDVR/"
    },
    {
        "label": 1,
        "text": "🏆Best Esports Game 🏆\n\nGanador de Corazón: League of Legends\n\nGanador de Cabeza: Valorant"
    },
    {
        "label": 1,
        "text": "Arcane would almost make you want to play League of Legends...almost"
    },
    {
        "label": 1,
        "text": "Spoilers ahead!\n\nFirst, I feel like I should say the game League of Legends means nothing to me. I don't care for the Moba genre of games. I tried LoL once in 2013 at the request of a friend then uninstalled it immediately after."
    },
    {
        "label": 1,
        "text": "Une série animée qui de base est inspirée du Lore de League Of Legends (j'y ai jamais joué et je connais pas le jeu). L'éditeur du jeu vidéo a donné un peu carte blanche au projet parce que je pense qu'ils s'en foutaient"
    },
    {
        "label": 1,
        "text": "the league of legends show deserves nothing more or less than imagine dragons, accept your burden"
    },
    {
        "label": 1,
        "text": "cuando recien anunciaron valorant a mi me hacia ilusion creer que iba a ser un overwatch pero de league of legends pero al final fue decepcionante que solo es un counter strikes de un universo completamente diferente\n\npor favor riot un hero shooter queda tan facil con los personajes"
    },
    {
        "label": 1,
        "text": "18 yo me arguing with ppl about league of legends in youtube comments is clearly still in there with how much willpower it takes me not to argue with fandom puritans spreading the same misguided, dumb takes over and over..."
    },
    {
        "label": 1,
        "text": "I've realized why so many trans women like League of Legends/Valorant and it's because every female character Riot has created gives me extreme gender envy"
    },
    {
        "label": 1,
        "text": "WAIT Arcane is a LEAGUE OF LEGENDS show?? I'm never watching it now"
    },
    {
        "label": 1,
        "text": "#promosky Interests and stuff...\n\n💯 Old School RuneScape\n💯 Progressive Metal\n💯 League of Legends\n💯 Cats\n💯 Animals\n💯 Hip Hop\n💯 Rap\n💯 Hard Rock\n💯 Skating\n💯 Gardening\n💯 Halo\n💯 Call of Duty\n\nLooking for mutuals and followers, thanks."
    },
    {
        "label": 1,
        "text": "Is “never played League of Legends” considered a gaming\nachievement? \n\nAnd should I watch Arcane anyway if I know nothing about the game?  \n\nLet me know 🙂"
    },
    {
        "label": 1,
        "text": "Hello! My name is Kit! I’m into:\n\nElden Ring\nBG3\nElder Scrolls\nCrusader Kings\nASOIAF\nMonster Hunter\nLeague of Legends\nDnD\n\nI stream occasionally and review games. I’m trying to be more active on here and looking for people to follow, so if you’re into any of the above, drop a follow!\n#promosky"
    },
    {
        "label": 1,
        "text": "I just started it 2 nights ago despite trying to stay away from it for so long because league of legends\n\nIt’s REALLY good! Got my friend to watch it with me too"
    },
    {
        "label": 1,
        "text": "Resumo de #Arcane:"
    },
    {
        "label": 1,
        "text": "Waiting for the league of legends show hype to die down so people stop thinking this account is about that 🥳"
    },
    {
        "label": 1,
        "text": "at the request of several people I finally started arcane over the weekend. I know nothing about league of legends, the only thing I knew about arcane was that really good song that sting did a few years ago, which I liked!"
    },
    {
        "label": 1,
        "text": "ok were going to league of legends"
    },
    {
        "label": 1,
        "text": "✨✨For all my League and Arcane cosplayers going to Katsucon!!✨✨\n\nHello! I will be hosting the League of Legends Cosplay Meetup there! It'll be held on that Saturday from 12-1 at the fountain \n\nAny and all LoL/Arcane designs are welcome!! \n\nfacebook.com/events/s/kat..."
    },
    {
        "label": 1,
        "text": "Imagine knowing League of Legends Lore, watching Arcane; and finding out one of the only characters that got a happy ending was Singed of all people. #Arcane"
    },
    {
        "label": 1,
        "text": "Never in a million years did I think Viktor League of Legends would become the poorest, littlest meow meow of all time."
    },
    {
        "label": 1,
        "text": "It's based specifically on the split city of Piltover and Zaun, so the characters who turn up are those who live there.\n\nThis makes me wonder if you know there's not even an implication of a 'League of Legends' in Arcane?"
    },
    {
        "label": 1,
        "text": "I come from my OTP being the most popular ship in the fandom (League of Legends Settphel) to Inazuma Eleven where I have to live knowing FuKaze will always be second place to two other more popular ships sigh..."
    },
    {
        "label": 1,
        "text": "I was commissioned to paint a banner of Aurora from League of Legends 🥰 My first time ever being commissioned to do fan art!! :D"
    },
    {
        "label": 1,
        "text": "I don’t care how good Arcane is you will not trick me into engaging with League of Legends!"
    },
    {
        "label": 1,
        "text": "i wanna play Qiyana in league of legends again but i only play league of legends when im at rock bottom and im afraid if i play some league i will end up at rock bottom."
    },
    {
        "label": 1,
        "text": "estou com varíola (doença de quem joga apenas com o personagem Varus no jogo league of legends)"
    },
    {
        "label": 1,
        "text": "So i got back on League of Legends"
    },
    {
        "label": 1,
        "text": "Arcane’s Long-Awaited Hookup Was Originally Longer and Steamier\n\nRiot Games and Fortiche’s final season of Arcane came and went over the weekend and now fans are left with a void to fill for their next “peak cinema” to hyperfixate over. While the animated League of Legends show came with its fair…"
    },
    {
        "label": 1,
        "text": "An Arcane act 3 spoiler but…\n\nThis is how I felt watching Act 3 as a 2011 League of Legends player."
    },
    {
        "label": 1,
        "text": "To all the Arcane fans who think Jinx is dead, just remember Arcane is meant to tell the origin stories of the playable characters in League of Legends and most of what happens in Arcane is canon to LOL so Jinx being dead would ruin the canon of the game"
    },
    {
        "label": 1,
        "text": "SUPER hype for the upcoming changes to League of Legends in 2025.\n\nLove that they snuck in that Viktor is getting a buff. Cool change!\n\nGlad we're finally getting themed maps. Really want to play on Winter Rift.\n\nNexus turret respawn good. HIT THE NEXUS END THE GAME.\n\nwww.youtube.com/watch?v=3zx1..."
    },
    {
        "label": 1,
        "text": "you can’t trick me into watching anything league of legends"
    },
    {
        "label": 1,
        "text": "vikjayce portal au\n#vikjayce #jayvik #myart #artoflegends"
    },
    {
        "label": 1,
        "text": "League of Legends: Arcane Season Two\nD4VD - REMEMBER ME 7\"\n£18, December 6\nUK/EU: arcaneuk.virginmusic.com/products/d4v..."
    },
    {
        "label": 1,
        "text": "Arcane made me play League of Legends..."
    },
    {
        "label": 1,
        "text": "League of Legends: Arcane Season Two\nTWENTY ONE PILOTS - THE LINE 7\"\n£18, December 6\nUK/EU: arcaneuk.virginmusic.com/products/twe..."
    },
    {
        "label": 1,
        "text": "If the aliens show up and we don't like em let me explain league of legends to them so they leave."
    },
    {
        "label": 1,
        "text": "The fact that Fortiche had to cut down the CaitVi sex scene because they got bonked by the ratings people and it was legit going to raise the rating of the actual League of Legends game to mature is fucking halerious.\n\nThe gays just keep winning with these two.\n\n#arcane #caitvi"
    },
    {
        "label": 1,
        "text": "I've been seeing a lot about Arcane (mostly over it being cancelled) but I have it had it recommended to me several times. Is this series welcoming to those who haven't ever played League of Legends?"
    },
    {
        "label": 1,
        "text": "𝗦𝗣𝗢𝗜𝗟𝗘𝗥𝗦 𝗔𝗥𝗖𝗔𝗡𝗘 𝗦𝗘𝗔𝗦𝗢𝗡 𝟮 𝗣𝗔𝗥𝗧 𝟭/ACT 1\nMy Thoughts and Opinions\n\nArcane opens season 2 with continuation of past events from season 1, Act 1 opens the idea of the different ways Grief may affect people and we see this heavily with Caitlyn as we learn about her losing a loved one"
    },
    {
        "label": 1,
        "text": "Literally was so hot it was going to raise the actual League of Legends game rating to Mature LMAO the gays truely keep winning"
    },
    {
        "label": 1,
        "text": "Não acredito\nDepois de 10 anos\nA lore de League of Legends ANDOU PRA FRENTE."
    },
    {
        "label": 1,
        "text": "If a League of Legends 2 ever comes out with Early Access being determined by spending, woof, a lot of us are going to get a very rude awakening."
    },
    {
        "label": 1,
        "text": "Honestly an affront to God to make such a great show based on League of Legends"
    },
    {
        "label": 1,
        "text": "FELT LMAO\n\ni went from top 0.1% in league of legends to only playing ARAM it’s so overrr"
    },
    {
        "label": 1,
        "text": "RT @KonbiniFr: Passionné par League of Legends, @Maynter_LOL est un joueur e-sport ukrainien, toplaner pour la @KarmineCorp. Il revient sur…"
    },
    {
        "label": 1,
        "text": "arcane fucked me up so bad im considering downloading league of legends"
    },
    {
        "label": 1,
        "text": "Cómo que League of Legends tiene novelas?"
    },
    {
        "label": 1,
        "text": "I fear it may be too late. I can't believe I might get dragged back into it..."
    },
    {
        "label": 1,
        "text": "It’s gay as all hell and you don’t need to like LoL to like it (I sure as hell won’t start playing league of legends just bc I watched arcane) but unfortunately, one of the lesbians is a cop"
    },
    {
        "label": 1,
        "text": "Vraiment, pleurer plusieurs fois devant un dessin animé League of Legends c'était pas dans mes plans de vie."
    },
    {
        "label": 1,
        "text": "league of legends."
    },
    {
        "label": 1,
        "text": "Well hello Vi, Powder, Claggor and Mylo.\n\nMy Arcane: League of Legends 1x1 Uncut Reaction to \"Welcome To The Playground\" is hitting Patreon shortly. #arcane #ArcaneSeason2 \n\nwww.patreon.com/screensanctum"
    },
    {
        "label": 1,
        "text": "Simba: Can you stop yelling while playing League of Legends?"
    },
    {
        "label": 1,
        "text": "\"Riot Games tries to present League of Legends as a family-friendly affair. \" a desculpa de sempre...alguem pergunta se houve essa preocupação com a cena do jayce com a mel na season 1..."
    },
    {
        "label": 1,
        "text": "#NowPlaying New Music & Scottish Albums Chart\t\ntwenty one pilots - The Line (from the series Arcane League of Legends)\n\nRadio Jammor is on the air...\nBroadcasting from #Scotland \nhttps://radiojammor.com\n#Music #NewMusic #radio"
    },
    {
        "label": 1,
        "text": "New here so mutuals appreciated!\n\n🧙‍♀️World of Warcraft\n🧂League of Legends\n📜Elder Scrolls Online\n🚀EVE Online\n🎴Magic the Gathering\n🐸Pokémon\n🏳️‍🌈LGBTQIA+\n📖Author\n🎭Actor\n🎡Londoner\n🫦Sex Positive\n\nWhat's your thing? Feel free to let me know.\n\n#promosky"
    },
    {
        "label": 1,
        "text": "arcane is an elaborate scheme to groom people into playing league of legends so you’re better off"
    },
    {
        "label": 1,
        "text": "i would counter their $250 million dollar marketing and tell you to not play league of legends. i'd rather you smoke crack"
    },
    {
        "label": 1,
        "text": "truly is there anything funnier than watching a syndra kill an annie and then immediately steal her tibbers for her own nefarious purposes #lolsky"
    },
    {
        "label": 1,
        "text": "arcane is the smoke room for people who's league of legends is echo and legend of runeterra is arches"
    },
    {
        "label": 1,
        "text": "Arcane kinda does the same thing that the MCU does where it’s like “oh if you’re in the know you might recognize this character from the source material it’s like a fun Easter egg” but then the reward is recognizing a league of legends character so it’s not actually that good"
    },
    {
        "label": 1,
        "text": "of League of Legends"
    },
    {
        "label": 1,
        "text": "My top 4 games these past 6 months lmao. Would guys still love me if I said I play league of legends and enjoy it 👉👈\n\n#promosky #gaymer #baldursgateiii #leaugeoflegends #overwatch2 #fortnite #gamegirl"
    },
    {
        "label": 1,
        "text": "The Boy Savior [League of Legends] !ttsmonster !vavid !socials\n\ntwitch.tv/JFlare205"
    },
    {
        "label": 1,
        "text": "I will never play league of legends but arcane is just so good"
    },
    {
        "label": 1,
        "text": "what if you said you would never get into league of legends but some fuckass animation studio in france  gave you one of the biggest achievements in visual storytelling based on league of legends"
    },
    {
        "label": 1,
        "text": "Its 2024 and the best thing on tv might be from freaking league of legends"
    },
    {
        "label": 1,
        "text": "oh yea i should mention my interests:\n\nmy wives\numineko\nwomen\nfinal fantasy xiv\nyu gi oh\nresident evil\npokemon\nleague of legends\ncaitvi\nwomen\nminthara\nstar rail\nkafstel\ngenshin impact\narchipelago / game randomizers\nsilksong hype\nwomen\n\n#promosky"
    },
    {
        "label": 1,
        "text": "hmmmm... just realized I went back to playing League of Legends on the same day I ran out of my psych meds. coincidence?"
    },
    {
        "label": 1,
        "text": "also, lots of their music is attached to other things people enjoy a lot, like Arcane or the League of Legends Worlds series. and those are incredible pieces of media\n\ni saw the argument comparing it to nickleback, which is funny considering now tik tok is popping vids like \"yo this ain't that bad?\""
    },
    {
        "label": 1,
        "text": "Lgbtq and I fuck with league of legends and lord of the rings"
    },
    {
        "label": 1,
        "text": "Currently learning “Remember Me” from Arcane (League of Legends series) on the piano and this is the second time a song with that same title has hurt me 😭 First was Coco"
    },
    {
        "label": 1,
        "text": "If the world was perfect League of Legends wouldn't exist."
    },
    {
        "label": 1,
        "text": "Pro Gamer of the Day \n\nDay 10: 🇰🇷 Kim \"Deft\" Hyuk-kyu (League of Legends)"
    },
    {
        "label": 1,
        "text": "Arcane S2 episode 7 was one of the best and deepest of the season. It shows the duality of a person who plays League of Legends if they never installed the game."
    },
    {
        "label": 1,
        "text": "🔥 A Riot Games confirma três novas séries de League of Legends após o sucesso de Arcane! Noxus, Ionia e Demacia serão os focos. Saiba mais! #PCLabs #LeagueOfLegends #Arcane #LoL #Animação \npclabs.com.br/2024/11/riot..."
    },
    {
        "label": 1,
        "text": "Thinking about my former League of Legends mains and how they might be done in an Arcane-style show...\n\nLux: Easy, home run. Cute blonde with a mega death laser 👌\n\nMalzahar: Cool guy. Cute pets, and Void-powered laser beams.\n\nAmumu: TRAUMA. OH FUCK GOD THE TRAUMA. PLS GOD NO 😭"
    },
    {
        "label": 1,
        "text": "Tiger brings the league of legends chat with him"
    },
    {
        "label": 1,
        "text": "Man, I have beyond zero interest in ever playing League of Legends, but Arcane is *top notch* in every degree. Like, the story, the animation, the voice acting. It's so sad and beautiful at the same time."
    },
    {
        "label": 1,
        "text": "I love Legends of Runeterra for how alive it makes the Runeterra lore but I also don't really fw card games.\n\nAnd League of Legends sucks.\n\nWeeeeeh why is it hard to love this universe."
    },
    {
        "label": 1,
        "text": "Voz da Lapis em Steven Universo e da Ashe em League of Legends, hoje é aniversário da maravilhosa dubladora Márcia Morelli! Desejamos um dia recheado de alegria e inúmeras realizações para essa ilustre atriz de voz! 🎁🎊🥳🎂"
    },
    {
        "label": 1,
        "text": "thank god i don't know shit about league of legends, seems like terrible knowledge to have."
    },
    {
        "label": 1,
        "text": "downloaded league of legends today 🫡"
    },
    {
        "label": 1,
        "text": "it's only 3PM and it feels like 6\n\nWhat playing League Of Legends does to a mf"
    },
    {
        "label": 1,
        "text": "for context i just learned what league of legends was today"
    },
    {
        "label": 1,
        "text": "Yeah yeah i know he is a yordle or whatever tf league of legends lore says but still??? We are not sure if he is alive cuz he vanished in a different timeline??? Please.."
    },
    {
        "label": 1,
        "text": "We really did become a League of Legends"
    },
    {
        "label": 1,
        "text": "\nlooking for moots with similar interest (18+) 💙 #promosky\n\n🧚‍♀️ anime\n👹 league of legends\n💫 arcane \n🐕 greyhounds (i have 2)\n🐉 palworld\n🌸 tattoos & piercings\n🦕 dinosaurs \n🌿 nature \n🦊 animal welfare \n🦋 studio ghibli\n🎨 drawing/art\n🪓 norse mythology\n🧠 baldurs gate 3\n🐙 pokémon \n🌈 LGBTQ+"
    },
    {
        "label": 1,
        "text": "woah a schedule????"
    },
    {
        "label": 1,
        "text": "Damn I finally started watching Arcane and this show is actually so good. Even if you don't like League of Legends the story, writing and animation itself is great. I love the steampunk aesthetic for everything, whole show looks great so far."
    },
    {
        "label": 1,
        "text": "Got an instant insomnia after that League of Legends Dev Blogs & Updates today (midnight on my country)\n\nEvery players (including me are confused) though…"
    },
    {
        "label": 1,
        "text": "The most intense CNC scene I could ever come up with is to to be forced against my will to play an entire match of league of legends. Nothing is more violating."
    },
    {
        "label": 1,
        "text": "I’m taking the lyrics of the line by twenty one pilots from the series arcane league of legends and really holding space with that"
    },
    {
        "label": 1,
        "text": "Finished Arcane Season 2. Enjoyed it and combination of beautiful animation with great music choices. \n\nBut preferred season one. Almost feel like the closer the show got to being like the game League of Legends, the less interested I was in it. \n\nZaun Vs Piltover was best aspect of the story."
    },
    {
        "label": 1,
        "text": "I want this in my house. Naked and oiled up. I for know nothing about league of legends but… lemme see his balls"
    },
    {
        "label": 1,
        "text": "also whether you play league of legends or not, I think everyone should consider watching Arcane because holy moly I genuinely believe it is some of the best media of our time"
    },
    {
        "label": 1,
        "text": "She's inspired by a few things- \n\n1. The Goddess Inari from Japanese legends. She's also a kitsune and usually represented by things like good fortune, agriculture, etc\n2. Ahri from League of Legends. \n3. Sakura blossoms 3/?"
    },
    {
        "label": 1,
        "text": "Probably but it’s League of Legends so probably not"
    },
    {
        "label": 1,
        "text": "it’s so funny that they made a league of legends tv show and it’s not even about the good lesbian couple"
    },
    {
        "label": 1,
        "text": "If I make Arcane fan art, will League of Legends fans be cool about it?"
    },
    {
        "label": 1,
        "text": "True as that is, the same remains for Caitlyn & Vi in League of Legends, and they're not receiving any retooling either.\n\nI feel as if they're just doing it because this is what the MCU does; completely rework a character's identity when their capeshit slop gets popular."
    },
    {
        "label": 1,
        "text": "SCHEDULE! 🔔\n\nTUE: HSR Memory of Chaos @ 12 PM EST/9 AM PST/5 PM UTC\nSAT: Kiyo-Sekai for League of Legends @ 8 PM EST/5 AM PST/SUN 1 AM UTC\n\nKiyo-Sekai week! Somehow IRL conditions for me to come back to League happened so I've changed my plans for Kiyo-Sekai to commemorate it!\ntwitch.tv/Kiyosen_"
    },
    {
        "label": 1,
        "text": "So Arcane season 2 was really good! I’m wondering if there is gonna be a season 3 now.\n\nAlso I’m starting to know a few League of Legends champions so…small wins"
    },
    {
        "label": 1,
        "text": "maybe it's not great that lesbians are so starved for good content that they're diving into league of legends"
    },
    {
        "label": 1,
        "text": "So...\n\nThe Tier List idea is going forward, and I have got my mates in on this bizarre venture as well.\n\nA few rules to for us to go over, then I can start recording this madness!"
    },
    {
        "label": 1,
        "text": "omg what map are you playing on?? \nalso aram is peak league of legends tbh"
    },
    {
        "label": 1,
        "text": "no amount of arcane posting will make me watch it. i will not be indoctrinated into enjoying league of legends. the woke left"
    },
    {
        "label": 1,
        "text": "I've only played League like Once but my girlfriend likes kindred a lot so I doodled them #leagueoflegends #lol"
    },
    {
        "label": 1,
        "text": "Otro leak de Viktor en League Of Legends\n\n#Viktor #LeagueOfLegends"
    },
    {
        "label": 1,
        "text": "No sé lo que dice pero puse League of Legends Betis y sale Zeri que es verde, viva. 🫶🏻💚"
    },
    {
        "label": 1,
        "text": "The pronunciation of League of Legends names is gonna kill me. I'm barely over Piltover not rhyming with \"discover\" and now you're telling me Warwick is not pronounced \"warrick\"?"
    },
    {
        "label": 1,
        "text": "the overall changes for League seem interesting, but also trying to encourage players to play at least 45 ranked games a year is too much. no one should be forced into that much competitive League of Legends"
    },
    {
        "label": 1,
        "text": "Eles literalmente viraram o League of Legends wtf Legends never die broo"
    },
    {
        "label": 1,
        "text": "i love arcane and consuming arcane content and ignoring that it all stems from league of legends 🤍🤍🤍 self care"
    },
    {
        "label": 1,
        "text": "03/2024 Xayah - League of Legends"
    },
    {
        "label": 1,
        "text": "02/2024 Nami - League of Legends"
    },
    {
        "label": 1,
        "text": "Don't worry. My knowledge of League Of Legends as a whole is non-existent, so I find myself kind of lost regarding the explanations 😭"
    },
    {
        "label": 1,
        "text": "should I stream playing league of legends?\n\nI haven't played in so long and I COULD play ranked again since I put in the time required."
    },
    {
        "label": 1,
        "text": "league of legends 376\nView this article\n\n#hentaiimage #hentai #rule34 #nsfw"
    },
    {
        "label": 1,
        "text": "🧍‍♂️\n\n✨ gamer since: unsure\n✨ first system: nintendo ds\n✨ last: xbox one\n✨ main: pc / xbox\n✨ fav: pc\n✨ fav. dev: telltale games\n✨ first game: phonics games (pc)\n✨ fav. game: red dead redemption 2 \n✨ least fav. game: league of legends\n✨ graphics or frames: frames"
    },
    {
        "label": 1,
        "text": "Every guy needs a toxic league of legends gym gf to tell him he’s not good enough"
    },
    {
        "label": 1,
        "text": "12/2023 Nidalee - League of Legends"
    },
    {
        "label": 1,
        "text": "💕 Congrats, @damidraws.bsky.social!! And thank you for the artshare! \n\n✨Here's some of my fantasy, OC, fanart work. \n#artshare #art"
    },
    {
        "label": 1,
        "text": "Arcane: class warfare, tangled family dynamics, the dark allure of power. \n\nLeague of legends: pay $10 for a fart sound."
    },
    {
        "label": 1,
        "text": "God I love lesbian pirates 🙏🏴‍☠️\na gift for my sweet gf - @hachemaga.bsky.social inspired a bit by the league of legends splasharts.\n#art #artist #oc"
    },
    {
        "label": 1,
        "text": "eu quando"
    },
    {
        "label": 1,
        "text": "05/2023 Kindred - League of Legends"
    },
    {
        "label": 1,
        "text": "Im currently considering redownloading league of legends so I feel your pain"
    },
    {
        "label": 1,
        "text": "Riot is making THREE more shows in the League of Legends universe!\n\nWhat a timeline to be living in!!"
    },
    {
        "label": 1,
        "text": "12/2022 Katarina - League of Legends"
    },
    {
        "label": 1,
        "text": "i suppose i'll make a quick list before i get busy. hi, i'm looking to find more people with similar interests.\n\n- arcane / league of legends (HUGE)\n- final fantasy\n- fortnite\n- warcraft\n- dead by daylight\n- silent hill (primarily the original trilogy and movies)\n- black sails\n\nthank you!"
    },
    {
        "label": 1,
        "text": "Four Games I’ve worked on:\n\nWorld of Warcraft (Legion, BfA, Shadowlands, and Classic)\nDead Space Remake\nLeague of Legends (Seasons 2022 thru present)\nMass Effect: Legendary Collection"
    },
    {
        "label": 1,
        "text": "12/2022 Samira - League of Legends"
    },
    {
        "label": 1,
        "text": "I claim that I can't play league of legends because I can't stand hour long matches yet I just sat for like 2 hours on Civ VI doing absolutely nothing.\n\nhuh."
    },
    {
        "label": 1,
        "text": "i love league of legends"
    },
    {
        "label": 1,
        "text": "saw league and freaked out cause I thought it was league of legends.\n\nI'm so cooked"
    },
    {
        "label": 1,
        "text": "Post a gaming picture that gives you video game anxiety.\n\nNever again."
    },
    {
        "label": 1,
        "text": "I got some doodles from an artist of her, but yeah, the little creatures from League of Legends."
    },
    {
        "label": 1,
        "text": "Throwback to my ask blog days."
    },
    {
        "label": 1,
        "text": "cannot stop thinking about Arcane...so close to asking oomfies to play league of legends with me"
    },
    {
        "label": 1,
        "text": "If we all need to learn how to play League of Legends you have my sword"
    },
    {
        "label": 1,
        "text": "It’s league of legends characters made into a cool story basically. I know it’s league of legends but it’s really good annoyingly"
    },
    {
        "label": 1,
        "text": "🔹 Action Figure Diorama de Ahri - League of Legends\n \n🚨 R$400,00 na #Shopee \n\n🛒 s.shopee.com.br/1g1gRzI1Lz"
    },
    {
        "label": 1,
        "text": "4 Things We Liked, and 4 We Didn’t, About Arcane Season 2\n\nThe second season of Arcane came to an end this weekend, and with it, the first of what Riot clearly wants to be a larger League of Legends TV universe.…\n\nhttps://geniousgrow.online/4-things-we-liked-and-4-we-didnt-about-arcane-season-2/"
    },
    {
        "label": 1,
        "text": "league of legends 2025 adc will be an experience for sure"
    },
    {
        "label": 1,
        "text": "💄 schedule for Nov 25 - Dec 1"
    },
    {
        "label": 1,
        "text": "The best League of Legends organization in the world so long as they live"
    },
    {
        "label": 1,
        "text": "Spotify Wrapped this week! Predict your Top 5 Artists for the year! 🎶👨‍🎤\n\n1) Evan Call\n2) some Japanese composer\n3) Gojira\n4) League of Legends\n5) prob another Japanese composer\n\nTag:\n@magzyy.bsky.social \n@ttea.bsky.social \n@specifen.bsky.social"
    },
    {
        "label": 1,
        "text": "Searching for mutuals who like the same things! :3\n\n🧙 Lord of the Rings\n🤬 League of Legends\n🎭 LARP\n🎲 Dungeons & Dragons (playing/DMing)\n🗡️ Baldur’s Gate 3\n💻 PC Gaming\n📺 Anime\n🔨Warhammer 40k\n📸 Photography\n🎲 Board games\n🎸 Metal(core)\n🥀 Tattoos & Piercings\n🏳️‍🌈 LGBTQ+\n\n#promosky\n♡ / ↻ appreciated!"
    },
    {
        "label": 1,
        "text": "as i understand it now, this guy is responsible for all of league of legends?"
    },
    {
        "label": 1,
        "text": "i quit playing before this release but they are so cute too wtf"
    },
    {
        "label": 1,
        "text": "pc\nStardew valley \nElden ring\nPalworld\nSims\nAnimal crossing \nLeague of Legends \nBG3\n\nHairstyles \nCoffee/tea\nCats\nFashion"
    },
    {
        "label": 1,
        "text": "I will not play League of Legends after finishing Arcane. I will not play League of Legends after finishing Arcane. I will not play League of Legends after finishing Arcane. I will not play League of Legends after finishing Arcane. I will not play League of Legends after finishing Arcane. AAAAAAAAA"
    },
    {
        "label": 1,
        "text": "league of legends is my comfort game. No I'm not being sarcastic even a little. I will defend the game with my life"
    },
    {
        "label": 1,
        "text": "i really like Arcane. should i try league of legends?"
    },
    {
        "label": 1,
        "text": "she's so me it hurts"
    },
    {
        "label": 1,
        "text": "Reminder that if you haven't watched Arcane yet, you really should because it is one of the best shows out there. Amazing animation, characters, world building, soundtrack, and writing.  Don't have to like League of Legends to enjoy it (please don't play League of Legends because of it, it's a trap)"
    },
    {
        "label": 1,
        "text": "Trying to recommend League of Legends to Arcane enjoyers when sometimes the gameplay is dying to some fuckshit in .37 seconds😐"
    },
    {
        "label": 1,
        "text": "Voy a hacer una pequeña búsqueda de mutuals por aquí porque me siento un poco sola 🫂💜.\n\n-Libros y literatura\n\n-Salir a comer\n\n-Oposiciones\n\n-League of legends\n\n-Maquillaje\n\n-Musicales\n\n-98's / 2000's\n\nBienvenid@s a todxs, no me ignoréis que soy wena gente."
    },
    {
        "label": 1,
        "text": "𝗖𝗵𝗮𝗿𝗮𝗰𝘁𝗲𝗿(𝘀): Jinx\n\n𝗦𝗲𝗿𝗶𝗲𝘀: League of Legends \n\n𝗔𝗿𝘁 𝗯𝘆: x.com/popogori1?s=..."
    },
    {
        "label": 1,
        "text": "05/2022 Soraka - League of Legends"
    },
    {
        "label": 1,
        "text": "My TikTok keeps feeding me League of Legends videos after I watched a bunch of Arcane stuff and I think I'm unemployed enough right now to consider playing League"
    },
    {
        "label": 1,
        "text": "Après Arcane, trois nouvelles séries League of Legends seraient prévues www.actugaming.net/apres-arcane..."
    },
    {
        "label": 1,
        "text": "“And if you loved the journey more than the end, go ahead, just turn that hourglass around and count to ten.”"
    },
    {
        "label": 1,
        "text": "03/2022 Sett, Xayah - League of Legends"
    },
    {
        "label": 1,
        "text": "League of Legends tendrá más series animadas\nhttps://somoskudasai.com/noticias/anime/league-of-legends-tendra-mas-series-animadas/\n\n#anime #japon #manga #noticias #news #yazhouradio"
    },
    {
        "label": 1,
        "text": "O League of Legends tem o Arcane.  O Dota tem o quê? Isso já mostra qual é o melhor entre os dois."
    },
    {
        "label": 1,
        "text": "Play league of legends or overwatch"
    },
    {
        "label": 1,
        "text": "What’s this a stream schedule for the week. Insane.\n\nMonday: Valorant\nTuesday: BO6 Ranked (hopefully)\nWednesday: League of Legends\nThursday: Overwatch Ranked\n\nWill be streamed at twitch.tv/ghoul_urg. Hope to see you all there\n#promosky"
    },
    {
        "label": 1,
        "text": "12/2021 Jinx - League of Legends"
    },
    {
        "label": 1,
        "text": "Arcane is such an anomaly because it resulted in good content coming from both league of legends and imagine dragons. If you would’ve told me years ago a league of legends show with an imagine dragons soundtrack would be one of the best I’ve seen, I would’ve had you institutionalized."
    },
    {
        "label": 1,
        "text": "Guys, my new League of Legends coach is bullying me 😔\nft. @kuroboshivt.bsky.social \n#leagueoflegends #lol"
    },
    {
        "label": 1,
        "text": "11/2021 Gwen - League of Legends"
    },
    {
        "label": 1,
        "text": "Just say you like league of legends, they should know right away it's just damaged goods at that point."
    },
    {
        "label": 1,
        "text": "League of Legends will soon get the first season of its new season model. Here's what you can expect.👀🎮\nsimulationdaily.com/news/league-..."
    },
    {
        "label": 1,
        "text": "Heartwarming: soon you will never have to see anyone posting about that ugly league of legends show ever again"
    },
    {
        "label": 1,
        "text": "Guy who’s only ever played league of legends watching arcane: getting real league of legends vibes from this"
    },
    {
        "label": 1,
        "text": "i know its due to arcane, but seeing oomfs posting about league of legends characters feels deeply wrong"
    },
    {
        "label": 1,
        "text": "if you said the words “animated dramatic steampunk league of legends tv show is the best thing on television and also donald trump is gonna be president AGAIN” to me in 2016 i wouldve died on the spot"
    },
    {
        "label": 1,
        "text": "The thing I always hear is that they look like League of Legends or other MOBA. Like yes. That's literally who they hired to do the illustrations.\n\nRudy Siswanto is the Illustration Art Lead for League of Legends. Ina Wong is also a concept illustrator for the game and Arif Wijaya works on Smite."
    },
    {
        "label": 1,
        "text": "I'm not familiar with the League of Legends universe, but I feel like I read something, or maybe it was just fans speculating that Riot Games are going to explore more of the LOL world. \nWould love to see some Arcane character pops in if they do"
    },
    {
        "label": 1,
        "text": "would i be totally lost watching Arcane if i’ve never played League of Legends?"
    },
    {
        "label": 1,
        "text": "Just finished Arcane last night and just.. wow. An incredible show from beginning to end. Wish that every show was crafted with the same care and love that clearly went into Arcane. Can't wait for more League of Legends stories\n\n#Arcane #League"
    },
    {
        "label": 1,
        "text": ""
    },
    {
        "label": 1,
        "text": "if any arcane  oomfs  wanna learn  league of legends with  a chill gub,  hit me up!! i am  down to help  everyone learn :D  fun havers ONLY!!!!"
    },
    {
        "label": 1,
        "text": "Riot doesn’t deserve the League of Legends IP. How’re they gonna make a fire show based on one of their most boring settings and then just end it after 2 seasons??\n\nImagine if we got a show based in Ionia, Demacia, Noxus etc.? Could have 5-6 seasons of content without even dragging it."
    },
    {
        "label": 1,
        "text": "02/2021 Neeko - League of Legends"
    },
    {
        "label": 1,
        "text": "s1 viktor i miss you sm #arcane #art"
    },
    {
        "label": 1,
        "text": "League of Legends: Toxic, boring, I sleep\n\nLeague of Legumes: Interesting, humorous, high in fiber"
    },
    {
        "label": 1,
        "text": "New week, time to some more mutuals! #skypromo\n\n💕 Nintendo\n💕 Sonic\n💕 league of legends\n💕 arcane\n💕 movies\n💕 pop music\n💕 k-pop\n💕 beabadoobee\n💕 comics\n💕 Sanrio \n💕 ASL"
    },
    {
        "label": 1,
        "text": "you dont want to know what reference i had to use to finish this lmao\n#arcane #vi #cosplaywip #cosplay"
    },
    {
        "label": 1,
        "text": "12/2020 Miss Fortune - League of Legends"
    },
    {
        "label": 1,
        "text": "Congrats on 4.5k Alex and thanks for hosting this art share! Here's some of my best..."
    },
    {
        "label": 1,
        "text": "kelo o MMO de league of legends para viver tempo de qualidade com meus amigos em um ambiente virtual fantasioso onde serei uma lésbica do cabelo rosa e grandes punhos 😭😭😭😭😭"
    },
    {
        "label": 1,
        "text": "Arcane sonrası 3 yeni League of Legends dizisi onaylandı: İşte detaylar\ndhbr.co/bW5h"
    },
    {
        "label": 1,
        "text": "acho q o league of legends finalmente nos ouviu e vai trazer mudanças visuais no mapa graças a Deus"
    },
    {
        "label": 1,
        "text": "searching league of legends and blocking anyone who posts kindred hentai"
    },
    {
        "label": 1,
        "text": "Alright fine. FINE"
    },
    {
        "label": 1,
        "text": "Joder, ya iba a hacer una crítica a lo cretina que es la comunidad del League of Legends y que jugases la linea de top como te diera la gana. Hasta que leí el texto entero. \nMi línea de pensamiento: Mal - Top - Vi - Arcane - Lol - Insultar."
    },
    {
        "label": 1,
        "text": "yo, they put Jinx from Arcane in this little indie game called League of Legends!!!"
    },
    {
        "label": 1,
        "text": "1 - Starting with true obscure lore: I originally discovered digital art through watching a timelapse of a league of legends splashart on Youtube."
    },
    {
        "label": 1,
        "text": "At this point, from Arcane and now this, I think might be a League of Legends fan This was a great game and I recommend anybody looking for more stuff with an Arcane-like art style and/or lore in the same universe play this! \n\n#Leagueoflegends #songofnunu #willump #nunu #poro #arcane"
    },
    {
        "label": 1,
        "text": "Arcane really has me wanting to check League of Legends. Not sure if that’s a good or bad thing 🤣"
    },
    {
        "label": 1,
        "text": "i wanna trust my girlfriends input on it because she’s the most well read person i know but i simply cannot watch league of legends unless i have no choice, i’m sure it’s quality is fantastic in spite of your grievances you have and you would have more insight than me there i’m just a hater"
    },
    {
        "label": 1,
        "text": "Just another manic monday and we're playing league of legends!\nwww.twitch.tv/lunarrose917"
    },
    {
        "label": 1,
        "text": "Depois de Arcane, novas séries do universo de League of Legends devem explorar Noxus, Demacia e Ionia"
    },
    {
        "label": 1,
        "text": "My lil participation ✨🫶 #arcane"
    },
    {
        "label": 1,
        "text": "As someone who knows absolutely nothing about the League of Legends mythos, it's fantastic. I highly recommend watching it."
    },
    {
        "label": 1,
        "text": "From what I've gathered in the first 4 episodes (as someone who knows nothing about League of Legends), it's like Borderlands meets Legend of Korra. I dig it."
    }
]