{"posts": [{"text": "happy bot bamboozlement day uwu"}, {"text": "Totally agree!"}, {"text": "I totally understand. <3 I found that anytime I find that my skills aren't where I want them, even though its uncomfortable, I always feel better when I practice those harder angles!"}, {"text": "I'm glad you found it <3"}, {"text": "Great to know!! Thanks for watching!"}, {"text": "Video is out! \n\nEasy Hair Drawing Technique Revealed (Sketch Any Hairstyle FAST) 👇\n"}, {"text": "I actually thought this was how to pronounce it, but looks like I'm wrong 😭"}, {"text": "Miss-key-vious 👀"}, {"text": "Be excited about your work and others will follow.\n\nCringe isn't real. It's a word people use to shut down others who have big feelings and big dreams.\n\nBe 100% you. There will always be someone who resonates."}, {"text": "Haha yes! I've never used Spotify and always felt left out, but YT Music has been doing it for a couple years now. :)"}, {"text": "Hehehe yes!! I love Doggy God's Street, it's such a fun song!!! \\o/"}, {"text": "That is so wonderful to hear! I'm glad you were able to still make time for it once you found a FT job again."}, {"text": "My YT Music recap. 🎶"}, {"text": "Crow's evolution in my mentorship has been insane to watch. \n\nThis is every reason to start drawing NOW so that in a year you can totally blow yourself away with progress."}, {"text": "Little early, but it’s better than being late! One of the biggest pieces I’ve done this year as a thank you for my 1 year learning under my amazing mentor @sylessae! I never would have thought I could get to this point when I started out and it’s thanks to her guidance!"}, {"text": ""}, {"text": "are you and artist who fantasizes about disappearing into a cave, honing your drawing skills without interruption and returning to society a whole new creative person a year later or are you normal"}, {"text": "There are less than 16 hours left to get 25% off TrueRef+ 🖤✨"}, {"text": "Video is out! \n\nEasy Hair Drawing Technique Revealed (Sketch Any Hairstyle FAST) 👇\n"}, {"text": "I'm sorry you're worried about burning out again!\n\nWhat do you feel you have to worry about when drawing?"}, {"text": "Glad you found it helpful!!"}, {"text": "Join my newsletter if you feel motivated to draw something today and want more motivation in the future.\n\n👉 https://buff.ly/419YaD2"}, {"text": "The artists you look up to have years of practice and layers of understanding of the creative process.\n\nThey went through the same process (and feelings!) you're experiencing, but their perseverance was worth it.\n\nAnd it's worth it for you. "}, {"text": "It's so easy to fall into the trap of seeing beautiful art, trying to recreate it, and getting discouraged that you can't quite grasp it. \n\nThis discouragement leads to feelings of \"I must be a bad artist\" or \"If I can't do that, why should I bother?\" "}, {"text": "This one is so important it deserves its own tweet:\n\n3. Draw at YOUR level, not where you think you should be. "}, {"text": "Over time, you will build your capacity for the challenge. Your understanding will also grow, and you can handle more.\n\nIf you're unsure where to start, working with a mentor or following guides like DrawABox can be very helpful for the \"what should I study\" question. "}, {"text": "2. Study in small, manageable bursts. \n\nYou don't need hours upon hours of practice in a day to make progress, and it's especially counterintuitive if that practice is so frustrating that you avoid drawing for a week.\n\nStudy once a day in 15-30 minute intervals in the beginning. "}, {"text": "1. A strong sense of why drawing is important to you is a powerful motivator. \n\nThis will push you through difficult practice sessions, bad drawings, and countless hours of asking, \"Why isn't this working?\"\n\nYou will get there. Your reason to draw will keep you going. "}, {"text": "The key to showing up involves 3 things:\n1. Knowing WHY you want to draw.\n\n2. Limiting the frustration per session based on your capacity for it to avoid burnout.\n\n3. Aim to create art at your level, not where you think you should be. "}, {"text": "If you've ever tried to draw, you know how hard it is!\n\nYou also know how frustrating it can be to envision something in your head that turns out like a 2nd grader drew it on paper. "}, {"text": "When things are difficult, it is human nature to avoid it. It's a survival thing. Even though drawing is difficult in a nonsurvival way, our brain similarly registers all fear and pain.\n\nLet's talk about how to work through it. "}, {"text": "There are countless nuances about how to get good at drawing, but most people struggle with the number one step:\n\nShowing up to draw.\n\nA thread. 🧵 "}, {"text": "find teemo"}, {"text": "omg that Treasure Planet art is beautiful!! 😭💖"}, {"text": "🚂 All aboard the art train! 🚂\n\nHey all, I'm Noël, a Senior Concept Artist in games, and I love designing colorful characters & creatures 🌿\n\n🚉 Next station 🚉\n@benrosado.bsky.social \n@jinyaoart.bsky.social\n@sirhaian.com \n@devinscribbles.bsky.social"}, {"text": "this is how it was made btw — it’s not a single audio file, it’s actually 3 different samples stored in the BIOS and played back at different speeds!"}, {"text": "hey yall i don't put this stuff out there much but i would really appreciate anyone helping get some attention to this.\n\nmy partner is raising money for GAC. I'm doing everything i can to help her raise the funds, but it would mean the world to us if you would consider reskeeting or contributing 🙏"}, {"text": "Every time you do something you thought impossible, your confidence grows. All of the creative pursuits you've been avoiding—go out and check them off your list.\n\nYou won't feel confidence until you start to take action."}, {"text": "A little horned lady for your timeline.\n\nShow me yours? 👀😈"}, {"text": "I'm glad you're as excited as I am to share it!!"}, {"text": "Just a sketch for now!"}, {"text": ""}, {"text": "Thank you!"}, {"text": "While you wait, you can enjoy some other videos about motivation and other art tips!\n\nwww.youtube.com/@Sylessae"}, {"text": "Seems like it's coming back to you quickly!"}, {"text": "I'm so happy to hear it!!!"}, {"text": "Hair is probably one of the things I get the MOST questions on! I hope it helps!"}, {"text": "I'm so glad to hear it!! I hope you find it helpful"}, {"text": "you and me both"}, {"text": "sorry.. unlimited unthrottled?? Don't know if that's even a word. I think you get me"}, {"text": "New video goes up tomorrow and it's about drawing HAIR.\n\nFor those of you asking for hair tips, I GOTCHU."}, {"text": "This is our dream world, it has unlimited throttled net"}, {"text": "Sameeee"}, {"text": "Cue the epic training music"}, {"text": "This sounds delightful"}, {"text": "are you and artist who fantasizes about disappearing into a cave, honing your drawing skills without interruption and returning to society a whole new creative person a year later or are you normal"}, {"text": "Thank you Dusk!"}, {"text": "Thank you!"}, {"text": "For real, I should have a talk with the boss"}, {"text": "Thank you Rogue!!"}, {"text": "Ready to take your portraits to the next level even on a busy schedule?\n\nEnroll in my portrait bootcamp before slots run out 👉 https://buff.ly/4i9FGIR "}, {"text": ""}, {"text": "Learn more about @altmetric.com's Bluesky integration:"}, {"text": "Scientists, academics, researchers: We’re excited to share that @altmetric.com is now tracking mentions of your research on Bluesky! 🧪"}, {"text": "I have a million things on my to-do list this week and not enough of those tasks are \"draw more horned babes\""}, {"text": "Thank you!"}, {"text": "Me too :')"}, {"text": "its so shinyyyyyyyyyyy"}, {"text": "Nyehehehehe :3"}, {"text": "ooh nvm i found it :D"}, {"text": "It's been really fun!! 😄😄😄\nOnly issue is now I'm out of money to buy more boosters 🤣"}, {"text": "Oooh where is that? 👀"}, {"text": "It came back! 🎉🎉🎉🥰\n#pokemon"}, {"text": "That's exciting!!"}, {"text": "You're welcome!\n\nHope we see you in session!"}, {"text": "Oops, I miss typed there. The last live lesson is on March 9th (not 19th)"}, {"text": "Hi there! No worries about the question, it's listed in the FAQ at the end!\n\nIt starts Sunday January 19th 2025 and the last live lesson is on March 19th (but the study sessions officially end on the 15th)!\n\nLet me know if you have any other questions!"}, {"text": "Absolutely ADORABLE, love the palette and the horns!"}, {"text": "The best way to test GIF support 💖"}, {"text": "OH I'm loving her colors! Very ethereal like a goddess!"}, {"text": "Thank you Nekro! <3"}, {"text": "Her teeth are SO intense, I love her design!!"}, {"text": "OOH I love her horns!"}, {"text": "claustrophobia is so stupid. let Santa get married."}, {"text": "A little horned lady for your timeline.\n\nShow me yours? 👀😈"}, {"text": "That's a very discouraging feeling!\n\nI relate to that a lot. I had to reframe the way I looked at studying in general--it became more about curiosity than a task to check off. \n\nIt helps suck you in a little more organically into what you're drawing. Make discoveries, not grind!"}, {"text": "I think this is super relatable. But creating something you can reference would be really helpful!\n\nEven if it's just some notes you take along the way c:"}, {"text": "It does make sense!\n\nIf you like a lot of different styles, it might help to make a list of all the individual things you like about each. From that, what if you made your own style based on your likes instead of trying to pick just one?"}, {"text": "Baby steps!! It can be really hard not to compare where you're starting again to where you once were.\n\nBe kind to yourself <3"}, {"text": "Maybe taking down some notes in those motivated moments of your thoughts, how intense the feeling are, and what triggered them--might give you more clues!\n\nIf it happens, it means we can recreate it!"}, {"text": "I see! What usually motivates you?"}, {"text": "What if you just flipped a coin or threw a bunch of things into a RNG?"}, {"text": "What do you find difficult about staying consistent with drawing?"}, {"text": "Thanks! <3"}, {"text": "Thank you Dusk!!"}, {"text": "Birds in a music box 💿 \n\n#xayah #rakan"}, {"text": "Great!! Glad to have you!"}, {"text": "Every time you do something you thought impossible, your confidence grows. All of the creative pursuits you've been avoiding—go out and check them off your list.\n\nYou won't feel confidence until you start to take action."}, {"text": "Consuming too much art and drawing too little can often lead to this.\n\nArt is inspiring, but if you’re getting the opposite effect, it might be time to take a break from scrolling and draw instead."}, {"text": "Backgrounds are HARD, and let's be honest - most of us want to focus on the figure. \n\nBut backgrounds help tell the story of our characters, and they shouldn't be neglected. That doesn't mean we have to start by drawing huge, hyper-detailed scenes for our characters from scratch.\n\n👇A thread."}, {"text": ""}, {"text": "Consuming too much art and drawing too little can often lead to this.\n\nArt is inspiring, but if you’re getting the opposite effect, it might be time to take a break from scrolling and draw instead."}, {"text": "Can anyone recommend some artist starter packs? Gimme all the fantasy characters/landscapes!"}, {"text": "Professionals use art reference.\nHobbyists use art reference.\nNewbies use art reference.\nTeachers use art reference. \nEveryone uses reference.\n\nUse reference for your art.\nYou're not cheating."}, {"text": "Start drawing today. \n\nEither a year passes and you still haven't drawn, or a year passes and you have a whole year of drawing practice under your belt."}, {"text": ""}, {"text": "Backgrounds are HARD, and let's be honest - most of us want to focus on the figure. \n\nBut backgrounds help tell the story of our characters, and they shouldn't be neglected. That doesn't mean we have to start by drawing huge, hyper-detailed scenes for our characters from scratch.\n\n👇A thread."}, {"text": "Leaking stuff and spreading those leaks is bad for pretty much everyone involved.\n\nLets talk about it..."}, {"text": "Professionals use art reference.\nHobbyists use art reference.\nNewbies use art reference.\nTeachers use art reference. \nEveryone uses reference.\n\nUse reference for your art.\nYou're not cheating."}, {"text": "The art process is messy for a reason.\n\nIn the chaos is where you find your true self."}, {"text": ""}, {"text": "When it comes to your art, which of these do you struggle with the most?\n\n1. Lack of confidence\n2. Comparing to others\n3. Burnout\n4. Inconsistency"}, {"text": "Taking care of your resident fallen supercomputer god \n\n#rainworld"}, {"text": "Art isn’t about perfection. It’s about persistence. \n\nThe doodles you hate today teach you how to create the masterpieces you’ll love tomorrow. \n\nIf you keep doodling, the masterpiece will happen naturally."}, {"text": "We could go on about how we welcome publishers, we don't demote links, we encourage independent developers to build apps and extensions on top of Bluesky's network.... but instead, we'll show you. \n\nAll thanks to the incredible community here! 🦋"}, {"text": "Draw slower and observe more. \n\nDetails of our subjects reveal themselves to those who are patient enough to see."}, {"text": "The questions themselves made me think about aspects that i hadn’t considered before. Im early in my artist-journey, and i think this one was very helpfull!"}, {"text": "Need pose references? 💙✨\nTrueRef's biggest event of the year has started!"}, {"text": "It’s scary how accurate this is"}, {"text": "Mario Kart games sorted by how cool their shortcuts are"}, {"text": "Draw slower and observe more. \n\nDetails of our subjects reveal themselves to those who are patient enough to see."}, {"text": "My portrait bootcamp is for you if you:\n- Spend too much time thinking about drawing rather than actually drawing\n- Don't know what to focus on in your studies\n- Get overwhelmed by all there is to learn\n- Struggle to balance art with other responsibilities\n- Thrive with accountability & structure\n👇"}, {"text": "Telling yourself “I only have 30 minutes to draw, it’s not worth it” adds up to weeks of zero progress.\n\nHere's your sign to start."}, {"text": "Art isn’t about perfection. It’s about persistence. \n\nThe doodles you hate today teach you how to create the masterpieces you’ll love tomorrow. \n\nIf you keep doodling, the masterpiece will happen naturally."}, {"text": "🦐\nI'd say it's pretty true\nI'm more comfortable with my craft now, and feel more confident as I got the chance to connect with more people for a few years\n\nKnowing this place is safe also helped a lot in connecting and watching other artists' crafts ^^\n\nAnd I have terrible posture"}, {"text": "VFX Artists"}, {"text": "the cast of #Arcane reads fandom brainrot"}, {"text": "DRAW MORE IS NOT ACTIONABLE ADVICE.\n\nWatch my latest video for better advice. 👉 youtu.be/Li5T08DQVJc?..."}, {"text": "If you want to get better drawing from your imagination, spend more time using reference.\n\nUsing reference introduces you to the nuance of your subjects. Without understanding that nuance, all our brains know are the simplified iconic representation of what we're drawing."}, {"text": "📢 App Version 1.95 is rolling out now (1/6)\n\nLots of bugfixes and performance improvements in this one!"}, {"text": "So happy I got to animate on a bunch of in game Arcane content earlier in the year including this recall for Arcane Brawler Vi!"}, {"text": "The art process is messy for a reason.\n\nIn the chaos is where you find your true self."}, {"text": "O Circuito Desafiante está de volta!\n\nSaiba tudo sobre como vai funcionar o Tier 2 das Américas em 2025 e conheça as equipes participantes\n\n🔗 lolesports.com/pt-BR/news/a..."}, {"text": "Since I'm moving I don't quite have the funds for this, but I've been mentored by Syl and she is an incredible teacher! I can't overstate enough how much I've learned from her instruction. This course looks amazing and I'm definitely going to get on round 2 or 3."}, {"text": "I got PSA 10, yay ! 🎉🎉🎉"}, {"text": "My portrait bootcamp is for you if you:\n- Spend too much time thinking about drawing rather than actually drawing\n- Don't know what to focus on in your studies\n- Get overwhelmed by all there is to learn\n- Struggle to balance art with other responsibilities\n- Thrive with accountability & structure\n👇"}, {"text": "Most artists miss a day of drawing and then try to motivate themselves with shame and guilt.\n\n\"You're not a real artist. A real artist would be drawing right now.\"\n\nThis never serves your creativity—it only hurts your self-confidence.\n\nEncourage yourself like you would a friend."}, {"text": "If you want to get better drawing from your imagination, spend more time using reference.\n\nUsing reference introduces you to the nuance of your subjects. Without understanding that nuance, all our brains know are the simplified iconic representation of what we're drawing."}, {"text": "\"I can't draw it until I learn how to draw it.\"\n\nEmbrace the freedom of drawing badly. No amount of tutorial watching, reading, or asking will help you improve unless you're also putting in the practice."}, {"text": "Brief update on our ongoing efforts to allow users to specify consent (or not) for AI training: 🧵"}, {"text": "post a gif of your comfort show"}, {"text": "Three flavors of chaos all wrapped into one. Arcane Fractured Jinx is ready to save the day—or watch it all burn."}, {"text": "Finally, I have gathered all the infinity stones! 🌟🌟🌟🌟"}, {"text": "Take the leap forward with new Arcane skins for Professor Heimerdinger, Last Stand Ekko, and Vander Warwick on the PBE."}, {"text": "Let the glorious evolution begin. Viktor is on PBE as the Herald of the Arcane."}, {"text": "Trade your Mythic Essence for a little extra kaboom with the Kabooooom! Nexus Finisher💥"}, {"text": "Winner, winner, sump rat dinner! Play Arcane Fractured Jinx on PBE now."}, {"text": "Every ending is a new beginning. Grab the latest Arcane skins for:\n\n🪕Professor Heimerdinger\n⏰Last Stand Ekko\n🐺Vander Warwick\n🌞Savior Viktor"}, {"text": "DRAW MORE IS NOT ACTIONABLE ADVICE.\n\nWatch my latest video for better advice. 👉 youtu.be/Li5T08DQVJc?..."}, {"text": "#Artists if you're not following @sylessae.bsky.social you're missing out on fantastic advice and resources\n\nSick of \"just draw more\"?\nwww.youtube.com/watch?v=Li5T...\n\nI think I'll be rewatching this one until it sinks in 😅"}, {"text": "Telling yourself “I only have 30 minutes to draw, it’s not worth it” adds up to weeks of zero progress.\n\nHere's your sign to start."}, {"text": "Most artists miss a day of drawing and then try to motivate themselves with shame and guilt.\n\n\"You're not a real artist. A real artist would be drawing right now.\"\n\nThis never serves your creativity—it only hurts your self-confidence.\n\nEncourage yourself like you would a friend."}, {"text": "|￣￣￣￣￣￣￣￣￣￣￣￣￣|\n           hey, I like your art          \n|＿＿＿＿＿＿＿＿＿＿＿＿＿|\n                    \\ (•◡•) / \n                      \\      / \n                       ——\n                       |     |\n                       |_   |_"}, {"text": "Try not to forget:\n\nWe begin drawing because of our childlike curiosity to replicate - to understand, to dissect - what interests us. The desire to be \"good\" was never why you picked up the pencil in the first place.\n\nExperiment. Be a kid again."}, {"text": "Let every sketch be a stepping stone, not a final product. Lower your expectations to make showing up easier."}, {"text": "Livestream starting in a few minutes 👇"}, {"text": "seasons seasons seasons seasons seasons seasons seasons seasons seasons seasons seasons seasons seasons seasons seasons seasons seasons seasons seasons seasons seasons seasons seasons seasons seasons seasons seasons seasons seasons seasons seasons seasons seasons seasons seasons seasons"}, {"text": "Join us for another livestream with COO @rose.bsky.team and CTO @pfrazee.com, where they'll share team updates, the story of how Bluesky began, and what’s next. \n\nPlus, a special guest appearance from @flavorflav.bsky.social! 🎉\n\nToday 11/25 @ 5 pm PT / 8 pm ET / 1 am GMT / 10am JST"}, {"text": "RiotPabro and RiotMeddler are back for the last Dev Update of 2024. Strap in gamers, this is a big one:\n🦾Arcane Champ Update\n🪓Season One Thematic Reveal\n👿Season One Gameplay Preview\n🎟️Battle Pass & Rewards\n🥇Ranked Resets\n⏩Swiftplay\n🤼Multiplayer Practice Tool\n\nyoutu.be/3zx1PwFXFdQ?..."}, {"text": "Creative flow doesn't show up on demand. You summon it by showing up."}, {"text": "Harper was offended that I walked near her"}, {"text": "NEW BIDEO FELLAS\n\nStill no LPP but I somehow got an early preview of the MASSIVE changes happening to League in 2025\n\nSO here's a quick rapid-fire style video explaining all the awesome stuff that's happening in the SEASON OF NOXUS\n\nfull video here —> youtu.be/qu5V4zYce18?..."}, {"text": "Things to remember if you're a tired artist:\n- Quit the doomscroll\n- Prep before you sit down\n- Embrace small wins\n- Bad sketches are good practice\n- Draw before your brain talks you out of it\n- Rest when you need it."}, {"text": "Try not to forget:\n\nWe begin drawing because of our childlike curiosity to replicate - to understand, to dissect - what interests us. The desire to be \"good\" was never why you picked up the pencil in the first place.\n\nExperiment. Be a kid again."}, {"text": "Stop worrying about wasting time drawing \"the wrong thing.\"\n\nEvery drawing is practice."}, {"text": ""}, {"text": "A person on a bicycle is by far the most energy-efficient among animals and machines per distance traveled relative to body weight. The bicycle is magic.\n\nwww.jstor.org/stable/24923..."}, {"text": "Impromptu live stream time. ✌️\n\nStruggling with drawing, comparing to others, art block--something else?\n\nLet's talk about it. \n\n👉 www.twitch.tv/sylessae"}, {"text": ""}, {"text": "\"I can't draw it until I learn how to draw it.\"\n\nEmbrace the freedom of drawing badly. No amount of tutorial watching, reading, or asking will help you improve unless you're also putting in the practice."}, {"text": "Optimist: The cup is half full\n\nPessimist: The cup is half empty \n\nGame Designer: Well, the cup variable is set to 0.5 and feedback is mixed. Let’s set it to 0.4 and 0.6 and see how players react. Worse case we cut the cup system."}, {"text": "A comic on the idea of Turning your brain off when consuming media \n\n#comic #tvshow #baztey"}, {"text": "Do I need 150 HDMI cables? No, of course not.\n\nDo I HAVE 150 HDMI cables? Yes, of course I do. Who throws away a perfectly good HDMI cable?"}, {"text": "just a heads up; this week I've seen at least three people with custom domain accounts on bluesky have to deal with impersonators, who are just grabbing the default bsky account name.\n\nBluesky's official advice for now is to just sign up for the .bsky.social username so nobody else can:"}, {"text": "📌 Ways to make money with your art in 2025 without relying on freelance or studio work: "}, {"text": "If you're an artist who juggles a day job, a social life, and trying to keep up a regular sleep schedule while eating and treating your body well, you know how hard it is to find the time and energy for your art.\n\nDon’t let doomscrolling steal that time."}, {"text": ""}, {"text": "Stop worrying about wasting time drawing \"the wrong thing.\"\n\nEvery drawing is practice."}, {"text": "howdy"}, {"text": "It's such a blessing to have been born just in time to witness Arcane. 💖"}, {"text": "my fav scene in the Arcane finale is when everyone turned to the camera and said “we are league of legends”"}, {"text": "I've been but an empty shell ever since I've watched the last 3 episodes. 🥲\n\n#Arcane"}, {"text": "#Arcane is more than just the best video game tv adaption. It's a marvel in its own right. One of the best series from this decade. An one of the best in media entertainment history. \n\nGrateful to encounter such a series."}, {"text": "If you're an artist who juggles a day job, a social life, and trying to keep up a regular sleep schedule while eating and treating your body well, you know how hard it is to find the time and energy for your art.\n\nDon’t let doomscrolling steal that time."}, {"text": "Man I'm so happy to finally be able to read all the Arcane reactions. It's been so hard to not talk about anything for so long. 😂"}, {"text": "“you’re perfect”\n#arcane"}, {"text": "arcane"}, {"text": ""}, {"text": "Pretty girls and pointy ears"}, {"text": "Seeing a student graduate from my mentorship after a year is truly beautiful. \n\nI can't explain how I feel to hear that someone can rekindle the joy in their relationship with art, learn to trust their intuition, and practice self-kindness when creating.\n\nI just have a big, proud smile on my face."}, {"text": "|￣￣￣￣￣￣￣￣￣￣￣￣￣|\n           hey, I like your art          \n|＿＿＿＿＿＿＿＿＿＿＿＿＿|\n                    \\ (•◡•) / \n                      \\      / \n                       ——\n                       |     |\n                       |_   |_"}, {"text": "Oh hey, I just made Youtube partner. Thanks for watching my videos everyone. 💛"}, {"text": "📌 Ways to make money with your art in 2025 without relying on freelance or studio work: "}, {"text": "I was blessed to have witnessed the Arcane finale event tonight.\nIt was incredible."}, {"text": "Arcane"}, {"text": "I hope y'all are ready. 😊"}, {"text": "Arcane sooooon"}, {"text": "Pretty girls and pointy ears"}, {"text": "I cannot wait for the last 3 Arcane episodes!! Aaaaaah!!!"}, {"text": ""}, {"text": "Pink is the best color, change my mind"}, {"text": "Easy art hack to get the most out of your drawing session:\n\nPrepare and gather your reference material the night before drawing. Then, wake up early and start drawing before you do anything else. You'll start with full energy, focus, and motivation."}, {"text": "Art advice you can use right now:\n\nDraw slower\nObserve more\nObserve again\nDon’t give up after the first sketch\nUse references \nAsk for feedback\nWork simple, then add details\nIterate on ideas\nTry a new process\nMake frequent comparisons to refs\nDraw what you love\nDraw with others"}, {"text": ""}, {"text": "\"I don't have enough time to draw.\"\n\nThis thought is sabotaging your progress. \n\n30 minutes daily can lead to results, but you must take the chance."}, {"text": "Me after my lanes type “jgl diff” after dying 3 times before I finish my first clear."}, {"text": "I got 3* Jinx in Tocker's Trials! 🌟🌟🌟"}, {"text": "Name a show you’re positive no one remembers but you"}, {"text": "Happy New Skins Day!!! 🎉🥳"}, {"text": "Are you a social media manager running an account for an organization or high-profile individual? Or do you own a website and want a simpler username?\n\nOn Bluesky, you can verify your account by setting your website as your username.\n\nWe just refreshed our how-to guide:"}, {"text": "#NovaFotoDoPerfil"}, {"text": "Art skill is a result of patience and hard work.\nArt skill is a result of patience and hard work.\nArt skill is a result of patience and hard work.\nArt skill is a result of patience and hard work.\nArtists are not born with skill."}, {"text": "they hold their babies"}, {"text": "If you're scrolling for \"inspiration,\" I've got bad news. \n\nThe continuous cycle of dopamine hits released when scrolling through an endless entertainment feed destroys your motivation and makes it hard to focus.\n\nIf you get frustrated when drawing, scrolling won't make things easier."}, {"text": "You must believe in your artistic vision.\n\nIf you don't, who will?"}, {"text": "If your audience saw your \"twist\" coming or guess what's gonna happen, there's a 95% chance that's a good thing. It means you foreshadowed and your characters are consistent enough to predict. Good job! +1 Writer Point for you!"}, {"text": "artists 🎨\n\nstop apologizing for not posting, for taking breaks, for being slow, for drawing the same character, for posting only sketches, for gushing over OCs, for being a beginner, for raising your prices, for trying a new medium—\n\nstart doing whatever you heckin want"}, {"text": "Thanks for your patience as we navigated some technical difficulties today! Moving forward, the performance issues you may have noticed should hopefully be resolved.\n\nTL;DR we're so back"}, {"text": ""}, {"text": "Remember me 🎶\n\n#Arcane #ArcaneArt #arcaneleagueoflegends #Sketch #Sketchbook #Art #TraditionalArt #Draw #Drawing #leagueoflegends @leagueunofficial.bsky.social  #Vander #Warwick #VanderArcane #CMMacias #CMMaciasG #Sketches #Boceto #Arte #traditionaldrawing #FanArt #fanarts @fortiche.bsky.social"}, {"text": "✨I'm Quill! I draw bugs, monsters and lesbians✨\nPatreon: patreon.com/idolomantises\nTwitter: x.com/Idolomantises\nInstagram: instagram.com/idolomantises/\nTumblr: idolomantises.tumblr.com\nTiktok: www.tiktok.com/@idolomantises"}, {"text": "Fuel 🪵🔥"}, {"text": "Paradise found in home's reflection...\n\nA very symbolic art piece dedicated to the adoration between @narinaya.bsky.social’s precious Anathema and my beloved Rezavi.\n#Art #BG3 #OCs #DigitalArtist"}, {"text": "We are now requiring asset page creators to tag their use of generative AI in their work. You can learn more here: itch.io/t/4309690/ge...\n\nOn your dashboard you can find a bulk tagging dialog if you have pages that need tagging."}, {"text": "“Ever since you dropped into my life, it’s like I put on glasses”\n\n#arcane #jinx #isha #lowpoly"}, {"text": "We are so back"}, {"text": "Just a normal Arcane family meeting nothing to see here"}, {"text": "Four games I've worked on:"}, {"text": "My most read column of the past year will remain evergreen for as long as grotesquely large trucks exist \n\nwww.theguardian.com/commentisfre..."}, {"text": "What stops you from starting your dream project today?"}, {"text": "#art #fantasy #fairy #digitalart"}, {"text": "Art advice you can use right now:\n\nDraw slower\nObserve more\nObserve again\nDon’t give up after the first sketch\nUse references \nAsk for feedback\nWork simple, then add details\nIterate on ideas\nTry a new process\nMake frequent comparisons to refs\nDraw what you love\nDraw with others"}, {"text": "and now in this corner of the Rift…"}, {"text": "📢 App Version 1.94 is rolling out today (1/5)\n\nA new release to go along with 20 million users!\n\nOpen this thread for details. 🧵"}, {"text": "Another jinx doodle for the butterflies\n\nEnjoy\n#jinx #leagueoflegends #artoflegends"}, {"text": "It’s time to suit up for Patch 14.23 🪖\n\nNEW Arcane skins, champion balances, and Bounty adjustments. \nriot.com/3YTsSNN"}, {"text": "Also thanks to all the people who have played When the Darkness comes over the years. It means a lot. ❤️\n\nIt's now passed the 250k unique users! ^_^\n\nAlways follow your light. ❤️"}, {"text": "Bluesky now has over 20M people!! 🎉\n\nWe've been adding over a million users per day for the last few days. To celebrate, here are 20 fun facts about Bluesky:"}, {"text": "Every artist inspecting the shadows on someone’s face in the sunlight instead of hearing a single word they are saying \n\n👁👄👁"}, {"text": "Hey peeps! If you’re enjoying the content I put out I want to give a quick heads up:\n\nIf you want to help me to grow then reposting my posts is the easiest way to do so. \n\nBluesky doesn’t have an algorithm like Twitter that works with likes. The best way to show up on users feeds is if you repost! 🫂"}, {"text": "artists 🎨\n\nstop apologizing for not posting, for taking breaks, for being slow, for drawing the same character, for posting only sketches, for gushing over OCs, for being a beginner, for raising your prices, for trying a new medium—\n\nstart doing whatever you heckin want"}, {"text": "drop a near-death comeback clip to see if Wolf approves of your warrior spirit ⬇️⬇️⬇️"}, {"text": "Bluesky tip for newbies: Bluesky has no real algorithm. Likes here do nothing but show the poster that you enjoyed their content.\n\nThat kindness is always going to be appreciated by creators, but if you want to help to boost something here, you have to repost it so others see it. 🙂"}, {"text": "Just pulled this. My god it is beautiful."}, {"text": "Just thought I'd post here the little Unity game I made a few years back: store.steampowered.com/app/1021950/...\n\nIt was my first (and so far only) venture into Solo Dev, as an outlet to try and explore my psyche, and explain to friends how I was feeling at the time. 🫂\n\n#Unity\n#GameDev\n#IndieGameDev"}, {"text": "YOU HAVE THE POTENTIAL TO DO GOOD.\n\nDO GOOD. BRING LOVE. BRING CREATIVITY. \n\nYOU ARE AWESOME!!!!!!!!!!"}, {"text": "After posting nothing but my cat Harper for the last 4 weeks, I've added about 15,000 new followers and built up my base here. Thanks everyone!\n\nNow, I'll start posting normal speedrunning stuff here too, with Harper pics mixed in."}, {"text": "crop of a piece for a book called BLAST (2012). there's something vaguely steampunk about it aesthetically although i never really subscribed to the genre. maybe it's the dystopic carnival atmosphere, idk."}, {"text": "I’m officially done with my fanart of Jinx!!! Here was my process!! \n\n#jinx #arcane #leagueoflegends #fanart #digitalartist #digitalart #artist #draw #drawing #powder #timelapse #replay"}, {"text": ""}, {"text": "I'm starting up a portrait drawing bootcamp for artists with limited drawing time.\n\nIt will teach how to draw portraits and utilize a (repeatable) learning method to get results with minimal time!\n\nThe start date is TBD, but enrollment will be limited.\n\n8weekportraitenroll.carrd.co"}, {"text": "Frieren — The World Turned Upside Down"}, {"text": "When you’re working through a creative challenge, and your frustration is beginning to lead you to self-doubt, know this:\n\nThe challenge is uncomfortable. Discomfort leads to growth. Growth leads to innovation.\n\nYou’re in the first phase."}, {"text": "Easy art hack to get the most out of your drawing session:\n\nPrepare and gather your reference material the night before drawing. Then, wake up early and start drawing before you do anything else. You'll start with full energy, focus, and motivation."}, {"text": "me watching Bluesky's user count grow by another million in a day\n\nhello and welcome to all 19M of you! 🥳"}, {"text": "GIGI PENTA YAY!!!"}, {"text": "GIGI FIRST BLOOD HAHA"}, {"text": "nooooooooooooo Nerissa hates ARAM 😭😭😭😭\nmy world is shattered"}, {"text": "Holo EN is currently playing League of Legends!!! www.youtube.com/watch?v=xLiu... 🎉🎉🎉🎉🎉"}, {"text": "look at this sassy roselia"}, {"text": "Finally!!"}, {"text": "I found this little guy at the vintage shop this morning and my inner child is screaming in joy."}, {"text": "Artists are TIRED.\n\nDay jobs eat up energy. There's always a wrestling match between insufficient time and a lack of motivation. When you do have time, you're exhausted from thinking about how you should be drawing instead of scrolling.\n\nSound familiar? Let's talk about it:"}, {"text": "I'm surprised that after over 8000 ARAMs, my win rate is still ~50%. 🤔"}, {"text": "#Arcane"}, {"text": "jinxd\n#arcane"}, {"text": "This is the second time I watch Arc 2, but I still get teary-eyed. 😭"}, {"text": "New art challenge:\n\nDraw for an hour a day INSTEAD OF doomscrolling on socials for an hour a day.\n\nWho's in?"}, {"text": "A couple jackpots today at the arcade. 🎉"}, {"text": ""}, {"text": ""}, {"text": "These are the only cards I'm still missing in Pokémon TCG Pocket. I can't wait for trading to be a thing. :')"}, {"text": "Update on my Jinx fan art almost done 😁💙\n\n#digitalart #art #fanart #arcane #leagueoflegends #jinx #drawing #artist #colorart #draw"}, {"text": "Hey all! I'm proud to present the last skin I had the pleasure to be the Character Artist for \"Arcane Survivor Jayce\" This is truly one of my favorites. Enjoy!\n\n#Arcane #Jayce #ArcaneSurvivor #LeagueofLegends #Riotgames #Handpainted #Characterart #Gameart"}, {"text": "Consider the power of drawing daily for 30 minutes:\n\n- 30 minutes of drawing a day = 15 hours a month\n- 15 hours of drawing a month = 1 full illustration\n- 1 full illustration monthly = 12 illustrations a year\n\nYour portfolio is going to start filling up pretty quickly."}, {"text": "Another day, another million new people have joined Bluesky! \n\n18M users? 🙂‍↔️ 18M friends 🙂‍↕️"}, {"text": "Seeing a student graduate from my mentorship after a year is truly beautiful. \n\nI can't explain how I feel to hear that someone can rekindle the joy in their relationship with art, learn to trust their intuition, and practice self-kindness when creating.\n\nI just have a big, proud smile on my face."}, {"text": "The great thing is, while some might see this mindset leading to losing followers, the amount of joy and effort you put into work will lead to MORE growth.\n\nSeems paradoxical, but true. Draw for yourself first. ✌️"}, {"text": "I'm starting up a portrait drawing bootcamp for artists with limited drawing time.\n\nIt will teach how to draw portraits and utilize a (repeatable) learning method to get results with minimal time!\n\nThe start date is TBD, but enrollment will be limited.\n\n8weekportraitenroll.carrd.co"}, {"text": "A Rise Gaming é BICAMPEÃ da #IgnisCup! 🏆🏆"}, {"text": "A Rise Gaming abriu 2-0 na série e está a UMA vitória do bicampeonato da #IgnisCup!\n\nSerá que a Vivo Keyd consegue buscar o reverse sweep, ou acaba no Jogo 3? 👀\n\nConfira os picks e bans do Jogo 3 🔥"}, {"text": "Aaaaah, I love reading the Arcane reactions. Finally. 😈"}, {"text": "A Rise Gaming venceu o Jogo 1 da série, mostrando um jogo bastante dominante contra a VKS! #IgnisCup\n\nAssista ao Jogo 2 em breve\n\n📺 twitch.tv/CBLOL | youtube.com/CBLOL"}, {"text": "here’s something worth your effort 👀\n\nStarting November 17 at 11:00 PT until November 23 at 23:59 PT you can earn new #Arcane Twitch drops. Just tune in to any League streamer OR official ”Arcane Unleashed” Twitch streams for one hour! \nGet your hands on a new emote, we promise it’s worth the effort"}, {"text": "Confira os picks e bans do Jogo 1 da #IgnisCup, entre Rise Gaming e Vivo Keyd Stars 🔥\n\nAssista ao vivo em nossos canais oficiais 👇\n\n📺 twitch.tv/cblol | youtube.com/cblol"}, {"text": "Bath time? 🔥"}, {"text": "Thank you for being so supportive. ✨\n\nI know my time is limited for sneaking these in, but meeting your characters is always a pleasure.\n\nThey filled up last night; I'll do my best to open them again soon."}, {"text": "Bookstores are where I go when I need to regain focus, find fresh creativity, and fill myself with inspirational hope. \n\nA bookstore brings me to life again."}, {"text": "É HOJE!\n\nA partir das 13h, você curte a Grande Final da #IgnisCup, em uma reedição da última decisão\n\nA Rise Gaming cria sua dinastia com o bicampeonato, ou a Vivo Keyd consegue a revanche? 🔥\n\nAssista em nossos canais oficiais 📺"}, {"text": "Artists are TIRED.\n\nDay jobs eat up energy. There's always a wrestling match between insufficient time and a lack of motivation. When you do have time, you're exhausted from thinking about how you should be drawing instead of scrolling.\n\nSound familiar? Let's talk about it:"}, {"text": "Consider the power of drawing daily for 30 minutes:\n\n- 30 minutes of drawing a day = 15 hours a month\n- 15 hours of drawing a month = 1 full illustration\n- 1 full illustration monthly = 12 illustrations a year\n\nYour portfolio is going to start filling up pretty quickly."}, {"text": "Fear stops us from creating.\n \nFear of failure.\nFear of judgment.\nFear of wasting time.\nFear of being misunderstood.\n\nBut what are you more afraid of—staying stuck or finally stepping out of your comfort zone and getting results?"}, {"text": "Quick lil doodle of @sylessae.bsky.social while I watched one of their vids on youtube."}, {"text": ""}, {"text": "Thank you so much for 10k! 🥳🎈"}, {"text": "I cannot get over how amazing this OST is...\nThe Shurimian Jan’ahrem prayer chants are spectacular.\nyoutu.be/Gj-jmBi0aK8"}, {"text": "💡 Tip: You can set your website as your username on Bluesky!\n\nThis is one form of self-verification, and we especially encourage official organizations and brands to do this! Examples include @npr.org @react.dev @duolingobrasil.com.br. \n\nHere's our guide for how to do this:"}, {"text": "Ok, hear me out - 𝘴𝘩𝘢𝘱𝘦𝘴."}, {"text": "Sketch commissions are OPEN.\n✨ 2 Slots left | www.ko-fi.com/sylessae"}, {"text": "OVER $3M CONTRIBUTED?! Now that’s a birthday celebration 🙌 Thanks for sharing Player Days (and 15 years of League) with us – here’s to 15 more 🎉"}, {"text": "If you are a #gamedev, a game studio etc; here's how to get a label next to your username: See quoted post. 🏷️"}, {"text": "Another day at Bluesky, and it looks like growth is not slowing down! Welcome!\n\nWe’d like to take a moment to share our stance on AI and user data:"}, {"text": "I'm going to post some old stuff first I guess..."}, {"text": "Wow uh hi to all the new followers! Thanks for following! 🥰🎉"}, {"text": "Flowers"}, {"text": "Bath time? 🔥"}, {"text": "One of the great things about moving here is seeing so many artists realize that their art wasn't actually unworthy of attention and love"}, {"text": "I was saving you.\n\n #arcane"}, {"text": "From Season 1! #Arcane"}, {"text": "The Heart of Hex\n#Arcane #arcanespoilers"}, {"text": "Pra quem não sabe, ela é minha mãe 🦾\n\n#art #arcane #BRart"}, {"text": "But I have nothing to fear!\nFor the blue bird is with me. #Arcane"}, {"text": "Any artists that follow me? Post your #arcane fanart below! #leagueoflegends #artist #game #fanart"}, {"text": "Fear stops us from creating.\n \nFear of failure.\nFear of judgment.\nFear of wasting time.\nFear of being misunderstood.\n\nBut what are you more afraid of—staying stuck or finally stepping out of your comfort zone and getting results?"}, {"text": "Caitvi season 2 fanart I finished yesterday 🧁🥊\n\n@arcaneshow.bsky.social \n@leagueunofficial.bsky.social \n\n#caitvi #arcane #arcanefanart ✨"}, {"text": "Commander Kiramman."}, {"text": "Dear followers, as we approach 10k, I wanted to update you: I’ve reached out to Riot Games to discuss this account’s future. Since I’m just a fan sharing updates, I offered to transfer it to their official team if they’re interested in joining Bluesky. What changes can we expect?"}, {"text": "Lest: “I didn’t hear anything”\n\nalso Lest:"}, {"text": "Apologies for this…\nor maybe not :) \n#Arcane"}, {"text": "just a lil shrimp 💖💖\nwww.youtube.com/watch?v=6Y4b..."}, {"text": "Mercury"}, {"text": "But I have nothing to fear!\nFor the blue bird is with me. #Arcane"}, {"text": "We are live!\nJoin us for a Q&A with @pfrazee.com and @rose.bsky.team on twitch now www.twitch.tv/blueskysocial"}, {"text": "it's official — 1,000,000 people have joined Bluesky in just the last day!!! \n\nwelcome and thank you for being here 🥳"}, {"text": "we're 10k people away from reaching 1,000,000 new users in a single day.... \n\nhelp us find 10,000 of our closest friends? as a treat?\n\ntext a friend this link: bsky.app/download"}, {"text": ""}, {"text": "CAN ANYONE SEE THIS"}, {"text": "Modern Noir, featuring the deadly Neri, is here! 🚬🖤\nLethal women are a special interest of mine.\n\n#references"}, {"text": "Bluesky's CTO @pfrazee.com and COO @rose.bsky.team will be doing a live Q&A about Bluesky today at 5pm PT / 8pm ET!\n\nCome hangout: www.twitch.tv/blueskysocial"}, {"text": "Casa dos melhores jogadores universitários de Esports do Brasil, a Copa Aliança será decidida na Arena Riot Games - em três modalidades 🔥\n\nNo próximo domingo, as finais de LoL, TFT e VALORANT  acontecem a partir de 13h 👀\n\n📺 Assista ao vivo | twitch.tv/acadarenabr"}, {"text": "These little guys (OCs)"}, {"text": "are we out of the woods yet? are we in the clear yet?\n\nif Bluesky is a lil slow for you, hang tight! there were some networking issues on the U.S. east coast affecting Bluesky and other apps, but looks like they're resolving now. 💙"}, {"text": "The Temple of Artemis\n\n#pixelart"}, {"text": "when twitter was rate limited:  you stupid ass.  elon you suck.  suck my ass\n\nwhen bluesky is down:  it’s going to be ok.  can i kiss you to make it better"}, {"text": "Yuria ✨"}, {"text": "Está chegando a hora... 👀\n\nRise Gaming e Vivo Keyd Stars, últimas finalistas da #IgnisCup, se reencontram de novo valendo título\n\nVem aí o bicampeonato da Rise? Ou as Guerreiras vão se vingar?\n\n 📺 Sábado, 13h, ao vivo em nossos canais oficiais"}, {"text": "Looks like 20+ years of drawing with 'being a professional' as a goal is starting to pay (❁´◡`❁)\n\nAnd yes, I'm working on (and struggling with) all the recommended activities to benefit from :'D"}, {"text": "Limited sketch slots opening in 2 DAYS.\n✨ www.ko-fi.com/sylessae"}, {"text": "Every time you scroll, your brain gets a dopamine hit. It feels good, it's mindless—it numbs your anxiety.  \n\nHere's the catch: it messes with your motivation and focus, making the creation process impossible.  \n\nIf you struggle to focus while drawing, drop social media for a week."}, {"text": "Called out 🥲"}, {"text": "A made a quiz for creatives that gives advice!!\n\nAdvice includes:\n- ways to reduce overwhelm, impostor syndrome, and overthinking\n- how to keep improving\n- how to approach learning\n- how to enjoy the process\n- how to rekindle your love for art\n\nQuiz: 👉 sylessae.scoreapp.com"}, {"text": "How often do you say \"no\" to your creativity?"}, {"text": "What color will your victory be?"}, {"text": "Moon!"}, {"text": "How inspiring to see so many drawings under the #DrawNotScroll tag. \n\nY’all make me proud."}, {"text": ""}, {"text": "Cinco fãs da #IgnisCup se olhando 👁️👁️\nA Grande Final da Terceira Etapa, entre Rise Gaming e Vivo Keyd Stars, acontece no próximo sábado\n📺 Assista ao vivo às 13h, nos nossos canais oficiais"}, {"text": "Illiaryn sketch for @bookofash.bsky.social ✨\n\nLimited ko-fi sketches opening in 3 DAYS:\n👉 www.ko-fi.com/sylessae"}, {"text": "The real reason Batman doesn't kill"}, {"text": ""}, {"text": "Let's goooo! The beast is defeated! 🎉🎉🎉🎉"}, {"text": "Me every year from September to December"}, {"text": ""}, {"text": ""}, {"text": "Just a few more days until Arcane S2 Act 2!! 🎉🎉🎉"}, {"text": "NEW: Hundreds of Bethesda workers at America's largest video game union have gone on strike today, protesting the company's recent outsourcing. Microsoft did not immediately respond to comment. www.inverse.com/gaming/bethe..."}, {"text": "a horror game where you need to inspect cabins and cast your vote if they are haunted or not (so you need to look at everything VERY closely omg)"}, {"text": "\"I am with you\"\nAphelios and Alune cosplays.\nAphelios: me | Alune: (IG)meredream | 📷(IG) joshuajirahmejia \n\n#cosplay #riot #leagueoflegends \n@leagueofficial.bsky.social"}, {"text": "15M people on Bluesky!!! 💫\n\nThe Verge beat us to our own announcement — that's the beauty of an open network with public stats!"}, {"text": "Set things right with Arcane Survivor Jayce."}, {"text": "Progress always has a price. But Arcane Survivor Jayce is prepared to pay it."}, {"text": "siri clear my schedule, it‘s arcane time"}, {"text": "3 months of making art a priority.\n3 months of free expression.\n3 months of telling yourself every idea is worth the time.\n3 months of self-kindness during the creative process.\n\nIn 3 months, you'll be a different artist. 🎨"}, {"text": "Bluesky stuns in new App Store ranking"}, {"text": ""}, {"text": "Don't mind me, just had to put this somewhere"}, {"text": "Dratini curled up for a nap"}, {"text": "hello and welcome to the 1M people that have joined Bluesky in the last week!!!"}, {"text": "New art challenge:\n\nDraw for an hour a day INSTEAD OF doomscrolling on socials for an hour a day.\n\nWho's in?"}, {"text": "Are you looking for a method to help you determine when a drawing is finished?\n\n👇🧵Let's go over it."}, {"text": ""}, {"text": "Old tower on a mountain."}, {"text": "your friend at month 1 of their newest game dev role: this studio is so chill and everyone is so nice. no drama here!!!\n\nyour friend at month 47: so yes it turns out the team did actually kill and eat the former vfx director, as i suspected. but that was AFTER the interns all died in The Incident"}, {"text": "Your relationship with practicing art will change once you begin to look at your projects as mini creative challenges versus a grind to reach some illusory finish line."}, {"text": "Teach what you learn from your creative studies. Most people think they can't help others because they're still learning. \n\n✨ But here's a spoiler: people appreciate the help and articulating it to them solidifies your understanding.\n\nWhat you learn today could be someone's next eureka moment."}, {"text": "A great tool to find Starter Packs!\nblueskydirectory.com/starter-pack..."}, {"text": "If you had to label yourself a \"type\" of artist, what kind would you be?"}, {"text": "A queen needs no crown, only horns. 🔥"}, {"text": "🧵A thread for creative individuals who wants to make things but gets so overwhelmed by all the ideas in their head that they end up doing nothing:"}, {"text": "I didn't think this quiz would be relevant to me as I'm very secure in my relationship to writing as a hobby & passion project, but this result 100% hit the nail on the head! it's made me feel so seen. the advice abt nurturing that passion in a sustainable way has given me lots to think about ✨"}, {"text": ""}, {"text": "Arcane is a show that will cure your depression, but only after going to great lengths to make sure you already have it first. 😮‍💨"}, {"text": "A queen needs no crown, only horns. 🔥"}, {"text": "🧵A thread for creative individuals who wants to make things but gets so overwhelmed by all the ideas in their head that they end up doing nothing:"}, {"text": "I took it and it is really deep. I'll post my results if anyone is curious about it."}, {"text": ""}, {"text": "I knew it was going to be this HAHAHA 🫣🤣🤣💛 this quiz got me on lock 😆"}, {"text": "Thousands of people have already taken the quiz and my hosting is nearing its capacity for quiz entries. And I JUST released it today.\n\nI apologize and hope to increase funding sooner so more people can take it at once.\n\nThere is now a waitlist for when we hit that cap!"}, {"text": ""}, {"text": "Far from free with broken wings"}, {"text": "You are far more powerful than you believe."}, {"text": "Avoid scrolling during droughts of inspiration or moments of low motivation. Social media will drain your dopamine—and we need dopamine to feel motivated!\n\nInstead, try:\n- walking in nature\n- exercise or yoga\n- automatic drawing/writing\n- sitting in the sun"}, {"text": "Creative growth doesn’t happen in comfort zones, but sustainability requires periodic comfort.\n\nKnow when to push. \nKnow when to rest.\n\nNever neglect one for the other."}, {"text": "awwabbbwb ⭐ The advice is spot-on (a warning about balance and being wary of bad habits ♥)\n\nI feel like this quiz will be extra helpful for folks starting out (either the business side or simply to bring more consistency in their art practice in the long-term) and/or struggling with motivation."}, {"text": "i prefer \"radical perfectionism\"\nthis did need a question about \"do you sometimes cry during your creative process\" though (the answer is a lot)"}, {"text": "I'm an Overthinker. That actually makes sense, thanks for the test, @sylessae.bsky.social !"}, {"text": "i'm always full of keys but chest-less 😔"}, {"text": "This one is for the artists: you can recirculate your old art here. I do this all the time because I'm old and nobody knows who I am. Seriously, they'll never notice. Give yourself a break, post an old piece, walk your iguanas, it's cool, fine"}, {"text": "If you regularly rest from drawing, you won't need to fight burnout for 6 months to compensate for it.\n\nListen to your body and your mind."}, {"text": "In honor of Arcane s2 releasing 🫡\n\n#arcane #art #caitvi #leagueoflegends #fanart"}, {"text": "I took this quiz by sylessae.bsky.social. I’m honestly relieved I got The Beginner. I often feel like I have to pretend to not be one since artists I admire seem to have it all figured out. The quiz gave actionable advice too, which I’ve taken note of."}, {"text": "WOW, this is insanely accurate! Loved the quiz, thank you @sylessae.bsky.social! 💜💜💜"}, {"text": "Creative growth doesn’t happen in comfort zones, but sustainability requires periodic comfort.\n\nKnow when to push. \nKnow when to rest.\n\nNever neglect one for the other."}, {"text": "For those of you who consume art on this site, are you:\n\na. an artist who is a fan of other artists\nb. someone who doesn't make art but admires art\nc. something else--tell me"}, {"text": "Why are artists so afraid to ask for money for their work?"}, {"text": "Overwhelmed definitely fits me to a T. Especially these last couple of months where friends of mine have even started to notice how stressed I’ve been. \n\nI do like the advice given here, especially about breaking goals down in to smaller steps. Will try to implement that more."}, {"text": "This was very validating. After going to art school. The taking five years to teach English and returning after barely drawing for years I feel so off!"}, {"text": "thank you for this!! i got the intermediate and will definitely try to implement this advice - particularly the time management adice :)\n\nas an aside, any creative not following Sylessae is missing out on a lot of constructive encouragement & teaching moments <3"}, {"text": "i beat myself up trying to learn csp a couple of weeks ago but it's ok to be like 'that absolutely doesn't work for me.' i went back to procreate and hashed out an entire painting in 2 hours that i was decently happy with. \n\nidk if i'm an expert but i have 20 years in of being stubborn so hey. 👍"}, {"text": "The way I already knew lol\n\nFr though go give Sylessae a follow and check out the quiz! It had some surprising questions and honestly she's a goddess for all that she does <3"}, {"text": "hey this is too loud (but accurate)"}, {"text": "I did this as a writer, not a true artist artist. Still checks out 🤣"}, {"text": "ah. well i'm not surprised ; w ;"}, {"text": "Hey, that's me!"}, {"text": "sylessae.scoreapp.com\n\nThis is so accurate it hurts 😂"}, {"text": "A made a quiz for creatives that gives advice!!\n\nAdvice includes:\n- ways to reduce overwhelm, impostor syndrome, and overthinking\n- how to keep improving\n- how to approach learning\n- how to enjoy the process\n- how to rekindle your love for art\n\nQuiz: 👉 sylessae.scoreapp.com"}, {"text": "Why are artists so afraid to ask for money for their work?"}, {"text": "Happy Arcane Day, everyone! 💖"}, {"text": ""}, {"text": "always 💚✏️✨"}, {"text": "For those of you who consume art on this site, are you:\n\na. an artist who is a fan of other artists\nb. someone who doesn't make art but admires art\nc. something else--tell me"}, {"text": "📢 App Version 1.93 is rolling out now (1/5)\n\nThis release includes the thread composer, improved tooling for adding content warnings to your own posts, and other improvements and fixes.\n\nOpen this thread for more details. 🧵"}, {"text": "【  🟣  】 \n\nblack hole study.\n\n♡ — ·"}, {"text": "I finally got a frame for the best receipt I ever received :D"}, {"text": "Someone at work posted this and it’s the truest representation of ”life at this moment (tm)” I’ve seen."}, {"text": "sparkle angel of life and death watches over UwU\n\n🔥👁️🪽✨\n\n#darkart #cryptid #angel #clipstudiopaint #art #illustration"}, {"text": "E a motivação do brTT para a próxima temporada, tá como? 👀"}, {"text": "Yay finally!! 🎉"}, {"text": ""}, {"text": "Level 30! 🎉🎉🎉"}, {"text": "HOJE É DIA DE #IGNISCUP 😍\n\nOs Playoffs começam nesta quinta-feira, às 18h, com direito às atuais campeãs em Summoner's Rift\n\nRise Gaming 🆚 Bad Day\nBanshee 🆚 E-Wolves\n\n📺 Assista ao vivo em nossos canais oficiais"}, {"text": "Omg what a cute card! 🥰🥰"}, {"text": "Game Dev, Art and too many hobbies :D"}, {"text": "daddy <3"}, {"text": "Midnight Market"}]}